[{"name": "AIM ImmunoTech Inc.", "sector": "Healthcare", "description": "AIM ImmunoTech Inc., an immuno-pharma company, focuses on the research and development of therapeutics to treat multiple types of cancers, viral diseases, and immune-deficiency disorders in the United States. The company's products include Ampligen, a drug of macromolecular ribonucleic acid molecules for the treatment of chronic fatigue syndrome (CFS). It is also developing Ampligen for the treatment of renal cell carcinoma, malignant melanoma, non-small cell lung, ovarian, breast, colorectal, prostate and pancreatic cancer, myalgic encephalomyelitis, Hepatitis B, HIV, COVID-19, and post-COVID conditions. In addition, the company provides Alferon N Injection, an injectable formulation of natural alpha interferon to treat genital warts, a sexually transmitted disease. It has agreements with UMN Pharma Inc.; Japanese National Institute of Infectious Diseases; Shionogi & Co., Ltd.; Polysciences Inc.; and University of Cagliari Dipartimento di Scienze della Vita e dell'Ambiente. The company was formerly known as Hemispherx Biopharma, Inc. and changed its name to AIM ImmunoTech Inc. in August 2019. AIM ImmunoTech Inc. was incorporated in 1966 and is headquartered in Ocala, Florida."}, {"name": "Ascendant Digital Acquisition Corp. III", "sector": "Financial Services", "description": "Ascendant Digital Acquisition Corp. III does not have significant operations. It intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses in the interactive entertainment, film/television, music, print and digital books, e-sports, live events, and other forms of consumer entertainment, and enabling services and technologies sectors. The company was incorporated in 2021 and is based in New York, New York."}, {"name": "Abrdn Australia Equity Fund Inc", "sector": "Financial Services", "description": "Abrdn Australia Equity Fund Inc is a closed ended equity mutual fund launched and managed by Aberdeen Standard Investments (Asia) Limited. The fund is managed by Aberdeen Standard Investments Australia Limited. It invests in the public equity markets of Australia. The fund makes its investments in firms operating across diversified sectors. It employs fundamental analysis with a bottom-up and top-down stock picking approach with focus on factors like growth prospects, competitive positions in domestic and export markets, technology, research and development, productivity, labor and raw material costs, profit margins, return on investment, capital resources, quality of management, and government regulation to create its portfolio. The fund benchmarks the performance of its portfolio against the S&P ASX 200 Accumulation Index. It also uses proprietary research to create its portfolio. The Aberdeen Australia Equity Fund Inc. was previously known as The First Australia Fund, Inc. Abrdn Australia Equity Fund Inc was formed in September 30, 1985 and is domiciled in the United States."}, {"name": "abrdn Global Income Fund, Inc.", "sector": "Financial Services", "description": "Abrdn Global Income Fund Inc is a closed-ended fixed income mutual fund launched and managed by Aberdeen Standard Investments (Asia) Limited. It is co-managed by Aberdeen Standard Investments Australia Limited and Aberdeen Asset Managers Limited. The fund invests in fixed income markets across the globe. It primarily invests in fixed-income securities denominated in the Commonwealth currencies and global debt securities. The fund benchmarks the performance of its portfolio against a composite index comprised of 20% Bank of America Merrill Lynch Australian Government Bonds Index, 20% Bank of America Merrill Lynch UK Government Bonds Index, 15% Bank of America Merrill Lynch Canadian Government Bonds Index, 15% Bank of America Merrill Lynch New Zealand Government Bonds Index, and 30% Bank of America Merrill Lynch Global Emerging Markets Index. Abrdn Global Income Fund Inc was formed on June 28, 1991 and is domiciled in the United States."}, {"name": "Actinium Pharmaceuticals, Inc.", "sector": "Healthcare", "description": "Actinium Pharmaceuticals, Inc., a clinical-stage biopharmaceutical company, focuses on developing and commercializing therapies for bone marrow transplant (BMT) or a type of cellular therapy, and for other adoptive cell therapies. Its lead product candidate, I-131 apamistamab (Iomab-B) that is in a pivotal Phase III clinical trial for elderly relapsed or refractory acute myeloid leukemia trial for BMT conditioning; and a Phase I study with a CD19- targeted CAR T-cell therapy with memorial sloan kettering cancer center. The company also offers clinical and preclinical development programs that utilize multiple isotopes, including Actinium-225, Iodine-131, and Lutetium-177 directed at multiple validated cancer targets, including CD45, CD33, CD38, CD47, HER2, and HER3 for targeted conditioning prior to cell and gene therapies, such as bone marrow transplant and cancer therapeutics as single agents or in combination with other therapeutic modalities. It has collaboration with Astellas Pharma, Inc. to develop theranostics for solid tumor indications; EpicentRx, Inc that focuses on a novel CD47 immunotherapy targeted radiotherapy; and AVEO Oncology that focuses on developing a HER3 targeting ARC for solid tumors. The company was incorporated in 2000 and is based in New York, New York."}, {"name": "Adara Acquisition Corp.", "sector": "Financial Services", "description": "Adara Acquisition Corp. does not have significant operations. The company intends to effect a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses. It focuses on searching for businesses in the consumer products industry and related sectors, including those consumer industry businesses in the health and wellness, e-commerce, discretionary spending, and information technology sectors and related channels of distribution. The company was incorporated in 2020 and is based in Charlotte, North Carolina."}, {"name": "AgEagle Aerial Systems, Inc.", "sector": "Technology", "description": "AgEagle Aerial Systems, Inc. engages in designing and delivering autonomous unmanned aerial systems for the energy/utilities, infrastructure, agriculture, and government industries worldwide. The company operates in three segments: Drones and Custom Manufacturing; Sensors; and Software-as-a-Service (SaaS). It offers fixed-wing drones, including eBee Ag, eBee Geo, eBee TAC, and eBee X; and sensor solutions, such as Altum-PT, RedEdge-MX, RedEdge-MX Dual Camera Imaging System, RedEdge-P, Aeria X, Duet M, Duet T, S.O.D.A., S.O.D.A. 3D, and S.O.D.A. Corridor. The company also provides software solutions comprising FarmLens, a subscription cloud analytics service that processes data collected with a drone for use by farmers and agronomists; HempOverview, a web- and map-based technologies to streamline and standardize hemp cultivation; Ground Control that provides individual pilots and large enterprises to automate and scale drone operations workflows; and eMotion, a drone flight and data management solutions. AgEagle Aerial Systems, Inc. was founded in 2010 and is headquartered in Wichita, Kansas."}, {"name": "Air Industries Group", "sector": "Industrials", "description": "Air Industries Group, an aerospace and defense company, designs, manufactures, and sells structural parts and assemblies for mission-critical aerospace and defense applications, and a prime contractor to the U.S. Department of Defense in the United States. The company operates through two segments, Complex Machining and Turbine and Engine Component. The Complex Machining segment offers aircraft landing and arresting gears, engine mounts, flight controls, throttle quadrants, and other components. Its products are deployed on a range of military and commercial aircraft, including Sikorsky's UH-60 Blackhawk, Lockheed Martin F-35 Joint Strike Fighter, Northrop Grumman E2D Hawkeye, the US Navy F-18, and USAF F-16 and F-15 fighter aircraft. The Turbine and Engine Component segment makes components and provides services for aircraft jet engines and ground-power turbines. Its jet engine components are used on the USAF F-15 and F-16, the Airbus A-330, the Boeing 777, and others, as well as ground-power turbine applications. The company's products are used by original equipment manufacturers in the manufacture of fixed wing aircraft, helicopters jet turbine engines, and other complex aerospace and defense products. Air Industries Group was founded in 1979 and is headquartered in Bay Shore, New York."}, {"name": "Alexco Resource Corp.", "sector": "Basic Materials", "description": "Alexco Resource Corp. engages in the mineral exploration, evaluation, development, and operational activities primarily in Yukon Territory, Canada. The company explores for silver, lead, zinc, and gold deposits. It owns interests in the majority of the historic Keno Hill Silver District project that comprises the Flame & Moth, Bermingham, Lucky Queen, Bellekeno, and Onek deposits, as well as 722 quartz mining leases, 873 quartz claims, 24 placer mining claims, 1 quartz mining license and 50% of 3 quartz mining leases, 2 crown grants, and 6 fee simple lots and 7 surface leases located in Yukon Territory. Alexco Resource Corp. was incorporated in 2004 and is headquartered in Vancouver, Canada."}, {"name": "Wells Fargo Advantage Funds - Allspring Income Opportunities Fund", "sector": "Financial Services", "description": "Wells Fargo Advantage Funds - Allspring Income Opportunities Fund is a closed-ended fixed income mutual fund launched and managed by Wells Fargo Funds Management, LLC. It is co-managed by Wells Capital Management Incorporated. The fund invests in the fixed income markets of the United States. It primarily invests in below investment grade debt securities, high-yield debt securities, loans and preferred stocks rated Ba or lower by Moody's Investors Service, Inc. or BB or lower by Standard & Poor's Ratings Group. The fund benchmarks the performance of its portfolio against Merrill Lynch High Yield Index. Wells Fargo Advantage Funds - Allspring Income Opportunities Fund was formed on February 26, 2003 and is domiciled in the United States."}, {"name": "Allspring Utilities and High Income Fund", "sector": "Financial Services", "description": "Allspring Utilities and High Income Fund is a closed-ended balanced mutual fund launched and managed by Wells Fargo Funds Management LLC. It is co-managed by Crow Point Partners, LLC and Wells Capital Management Incorporated. The fund invests in the public equity and fixed income markets of the United States. It primarily invests in stocks of companies across all market capitalizations operating in utility sector including water, gas, electric, and telecommunications companies. For the fixed income component of its portfolio the fund seeks to invest in non-investment grade securities. Allspring Utilities and High Income Fund was formed on April 28, 2004 and is domiciled in the United States."}, {"name": "Alpha Pro Tech, Ltd.", "sector": "Industrials", "description": "Alpha Pro Tech, Ltd., together with its subsidiaries, develops, manufactures, and markets a range of disposable protective apparel, infection control, and building supply products in the United States and internationally. The company operates through two segments, Disposable Protective Apparel and Building Supply. The Disposable Protective Apparel segment provides shoe covers, bouffant caps, coveralls, frocks, lab coats, and gowns, hoods, as well as face masks and shields. The Building Supply segment offers construction weatherization products, such as housewrap and housewrap accessories, including window and door flashing, and seam tape, and synthetic roof underlayment, as well as other woven material. The company markets its products under the Alpha Pro Tech brand name, as well as under private labels. Its products are used primarily in cleanrooms; industrial safety manufacturing environments; health care facilities, such as hospitals, laboratories, and dental offices; building and re-roofing sites. The company distributes its products through a network of purchasing groups, distributors, and independent sales representatives, as well as through its sales and marketing force. Alpha Pro Tech, Ltd. was founded in 1983 and is headquartered in Markham, Canada."}, {"name": "American Shared Hospital Services", "sector": "Healthcare", "description": "American Shared Hospital Services leases radiosurgery and radiation therapy equipment to health care providers. The company offers radiosurgery equipment for the Gamma Knife stereotactic radiosurgery, a non-invasive procedure to treat malignant and benign brain tumors, and arteriovenous malformations, as well as for trigeminal neuralgia. It also provides financing services for Leksell Gamma Knife units. In addition, the company offers proton beam radiation therapy services in Orlando, Florida and Long Beach, California, as well as offers planning, installation, reimbursement, and marketing support services to its customers. As of December 31, 2021, it had 115 operating Gamma Knife units located in the United States, as well as two in South America in Lima, Peru and Guayaquil, Ecuador. The company also operates one PBRT system. American Shared Hospital Services was founded in 1980 and is based in San Francisco, California."}, {"name": "Ampio Pharmaceuticals, Inc.", "sector": "Healthcare", "description": "Ampio Pharmaceuticals, Inc., a biopharmaceutical company, focuses on the development of immunomodulatory therapies for the treatment of pain from osteoarthritis in the United States. Its product pipeline includes AP-013, an intra-articular injection, which is in phase III clinical trial for the treatment of osteoarthritis of the knee; AP-017, an intravenous ampion treatment that is in Phase II clinical trial to treat adult COVID-19 patients requiring oxygen supplementation; AP-019, an Inhaled Ampion treatment, which is in Phase II clinical trial for the treatment of Adults with Respiratory Distress Due to COVID-19; and AP-018 that is in Phase I clinical trial to treat patients with prolonged respiratory symptoms due to COVID-19. The company is headquartered in Englewood, Colorado."}, {"name": "Ardmore Shipping Corporation", "sector": "Industrials", "description": "Ardmore Shipping Corporation engages in the seaborne transportation of petroleum products and chemicals worldwide. As of February 15, 2022, the company operated a fleet of 25 double-hulled product and chemical tankers. It serves oil majors, oil companies, oil and chemical traders, chemical companies, and pooling service providers. The company was founded in 2010 and is based in Pembroke, Bermuda."}, {"name": "Armata Pharmaceuticals, Inc.", "sector": "Healthcare", "description": "Armata Pharmaceuticals, Inc., a clinical-stage biotechnology company, focuses on the development of targeted bacteriophage therapeutics for antibiotic-resistant infections worldwide. It develops its products using its proprietary bacteriophage-based technology. The company's product candidates include AP-SA02 for the treatment of Staphylococcus aureus bacteremia; AP-PA02 for Pseudomonas aeruginosa; and AP-PA03 for the treatment of pneumonia. It has a partnership agreement with Merck & Co. for developing synthetic bacteriophage candidates to target undisclosed infectious disease agents. The company is headquartered in Marina del Rey, California."}, {"name": "Asensus Surgical, Inc.", "sector": "Healthcare", "description": "Asensus Surgical, Inc., a medical device company, engages in the research, development, and sale of medical device robotics to enhance minimally invasive surgery (MIS) in the United States, Europe, and Asia. It digitizes the interface between the surgeon and the patient to pioneer a new era of Performance-Guided surgery by unlocking clinical intelligence for surgeons to enable consistently superior outcomes and a new standard of surgery. The company's products include Senhance Surgical system, a multi-port robotic surgery system that allows up to four arms to control robotic instruments and a camera for laparoscopic procedures. Its products also comprise instruments and other products, including 3mm diameter instruments, 3mm and 5mm hooks, and articulating instruments; and Senhance ultrasonic system, an advanced energy device to deliver controlled energy to ligate and divide tissue. The company was formerly known as TransEnterix, Inc. and changed its name to Asensus Surgical, Inc. in February 2021. Asensus Surgical, Inc. was founded in 2006 and is headquartered in Durham, North Carolina."}, {"name": "Austin Gold Corp.", "sector": "Basic Materials", "description": "Austin Gold Corp., a gold exploration company, focuses on the exploration and evaluation of mineral property interests in Nevada. The company's principal property the Kelly Creek Project with a mix of 6 patented mining claims and 1,600 unpatented mining claims covering an area of 136.8 square kilometers located in the Kelly Creek Basin, in southeastern Humboldt County, Nevada. Its other projects include the Fourmile Basin Project that comprises 312 unpatented lode mining claims covering approximately 6410 acres located in Nye County; the Lone Mountain Project consisting of 454 unpatented lode mining claims and 6 patented mining claims covering approximately 34.2 square kilometers located near Lone Mountain in Elko County; and the Miller Project with a total of 281 unpatented lode mining claims covering approximately 23.5 square kilometers in Elko County in Nevada. The company was incorporated in 2020 and is headquartered in Vancouver, Canada."}, {"name": "Avalon Holdings Corporation", "sector": "Industrials", "description": "Avalon Holdings Corporation provides waste management services to industrial, commercial, municipal, and governmental customers in the United States. It operates in Waste Management Services, and Golf and Related Operations segments. The Waste Management Services segment offers hazardous and nonhazardous waste disposal brokerage and management services; and captive landfill management services, as well as engages in the salt water injection well operations. This segment also provides turnkey services, including daily operations, facilities management, and management reporting; and sells construction mats. The Golf and Related Operations segment operates and manages four golf courses and related clubhouses, a hotel, and a travel agency. Its golf and country club facilities provide swimming pools, fitness centers, tennis courts, dining, and banquet and conference facilities, as well as spa services. The company also owns and operates hotel under the brand of The Grand Resort, which provides various facilities, such as hotel, indoor and outdoor swimming pool, bath, fitness center, restaurants, bars, cigar lounge, salon and spa, banquet and conference facilities, and adjoining tennis center. Avalon Holdings Corporation was founded in 1998 and is headquartered in Warren, Ohio."}, {"name": "AMCON Distributing Company", "sector": "Consumer Defensive", "description": "AMCON Distributing Company, together with its subsidiaries, engages in the wholesale distribution of consumer products in the Central, Rocky Mountain, and Mid-South regions of the United States. It operates through Wholesale Distribution and Retail Health Food segments. The Wholesale Distribution segment distributes consumer products, including cigarettes and tobacco products, candy and other confectionery, beverages, groceries, paper products, health and beauty care products, frozen and refrigerated products, and institutional foodservice products. It serves retailers, such as convenience stores, discount and general merchandise stores, grocery stores, drug stores, liquor stores, tobacco shops, and gas stations; and institutional customers, including restaurants and bars, schools, and sports complexes, as well as other wholesalers. This segment also markets private label lines of water, candy products, batteries, and other products. In addition, the Retail Health Food segment is involved in the retail of natural, organic, and specialty foods consisting of produce, baked goods, frozen foods, nutritional supplements, personal care items, and general merchandise. Further, the company operates twenty retail health food stores under the Chamberlin's Natural Foods, Akin's Natural Foods, and Earth Origins Market brands. AMCON Distributing Company was incorporated in 1986 and is based in Omaha, Nebraska."}, {"name": "Abrdn Asia-Pacific Income Fund Inc", "sector": "Financial Services", "description": "Abrdn Asia-Pacific Income Fund Inc is a close ended fixed income mutual fund launched and managed by Aberdeen Standard Investments (Asia) Limited. It is co-managed by Aberdeen Standard Investments Australia Limited and Aberdeen Asset Managers Limited. The fund invests in fixed income markets of Asia, Australia, and New Zeland. It primarily invests in debt securities issued by governmental entities, banks, companies, and other entities. Abrdn Asia-Pacific Income Fund Inc was formed on March 14, 1986 and is domiciled in the United States."}, {"name": "Abrdn Emerging Markets Equity Income Fund Inc", "sector": "Financial Services", "description": "Abrdn Emerging Markets Equity Income Fund Inc is a closed ended balanced mutual fund and managed by Aberdeen Asset Managers Limited. It invests in the public equity and fixed income markets of Chile. The fund seeks to invest in securities of companies operating across diversified sectors. It employs fundamental analysis with a bottom-up security selection approach to create its portfolio. The fund benchmarks the performance of its portfolio against the MSCI Chile Index. It conducts in-house research to create its portfolio. The fund was formerly known as Aberdeen Chile Fund, Inc. Abrdn Emerging Markets Equity Income Fund Inc was formed on January 30, 1989 and is domiciled in the United States."}, {"name": "Acme United Corporation", "sector": "Consumer Defensive", "description": "Acme United Corporation supplies first aid and safety, cutting, sharpening, and measuring products to the school, home, office, hardware, sporting goods, and industrial markets in the United States, Canada, Europe, and internationally. The company offers scissors, shears, knives, rulers, pencil sharpeners, paper trimmers, safety cutters, lettering products, glue guns, and other craft products under the Westcott brand name; and cutting tools under the Clauss brand. It also provides fixed blades, folding knives, sight cutting tools, and tactical tools under the Camillus brand; fishing tools and knives, as well as cut and puncture resistant gloves, telescopic landing nets, net containment systems, and tools and fishing gaffs under the Cuda brand; and sharpening tools under the DMT brand. In addition, the company offers first aid kit and safety solutions under the First Aid Only brand; portable eyewash solution and over-the-counter medication, including active ingredients aspirin, acetaminophen, and ibuprofen under the PhysiciansCare brand; bodily fluid and spill clean-up solution under the Spill Magic brand; various first aid kit, refill, and safety supplies, including CPR kits, burn kits, and automotive and emergency first aid kits under the First Aid Central; and alcohol prep pads, alcohol wipes, benzalkonium chloride wipes, various antiseptic wipes, castile soaps, and lens cleaning wipes under the Med-Nap brand. It sells its products directly and through its independent manufacturer representatives to wholesale, contract, and retail stationery distributors; office supply super stores; school supply distributors; industrial distributors; wholesale florists; mass market and e-commerce retailers; and hardware chains, as well as sells a selection of products through its websites. The company was formerly known as Acme Shear Company and changed its name to Acme United Corporation in 1971. Acme United Corporation was founded in 1867 and is based in Shelton, Connecticut."}, {"name": "Adams Resources & Energy, Inc.", "sector": "Energy", "description": "Adams Resources & Energy, Inc., through its subsidiaries, primarily engages in the marketing, transportation, terminalling, and storage in various crude oil and natural gas basins in the United States. The company operates through three segments: Crude Oil Marketing, Transportation and Storage; Tank truck Transportation of Liquid Chemicals, Pressurized Gases, Asphalt and Dry Bulk; and Pipeline Transportation, Terminalling and Storage of Crude Oil. It purchases crude oil and arranges sales and deliveries to refiners and other customers primarily onshore in Texas, Oklahoma, North Dakota, Michigan, Wyoming, and Louisiana; and owns and operates a fleet of 201 tractor-trailer rigs and maintains approximately 180 pipeline inventory locations or injection stations. The company also transports liquid chemicals, pressurized gases, asphalt, and dry bulk on a for hire basis in the continental United States, and into Canada and Mexico; and operates nineteen truck terminals in Houston, Corpus Christi, Nederland, Freeport, Baton Rouge, St. Rose, Boutte, Sterlington, Jacksonville, Tampa, Atlanta, Augusta, Alabama, North Carolina, Ohio, West Virginia, Arkansas, East St. Louis, Joliet, Louisiana, and the Corpus Christi. In addition, it operates crude oil and condensate pipeline system, which connects the Eagle Ford Basin to the Gulf Coast waterborne market that has a capacity of 450,000 barrels per day. Adams Resources & Energy, Inc. was founded in 1947 and is headquartered in Houston, Texas."}, {"name": "AgeX Therapeutics, Inc.", "sector": "Healthcare", "description": "AgeX Therapeutics, Inc., a biotechnology company, focuses on the development and commercialization of novel therapeutics targeting human aging and degenerative diseases in the United States. The company's lead cell-based therapeutic candidates in development include AGEX-BAT1, a cell therapy product candidate for the treatment of various age-related metabolic disorders, such as Type II adult-onset diabetes and obesity; and AGEX-VASC1, a cell-based therapy to restore vascular support in aged ischemic tissues, such as peripheral vascular disease and ischemic heart disease. Its lead drug-based therapeutic candidate for scarless wound repair in discovery is AGEX-iTR1547, a drug-based formulation; and lead biologic candidate for induced tissue regeneration is AGEX-iTR1550, a gene delivery technology. The company has a research collaboration with the University of California at Irvine to develop cellular therapies to treat neurological disorders and diseases. AgeX Therapeutics, Inc. was incorporated in 2017 and is based in Alameda, California."}, {"name": "Airspan Networks Holdings Inc.", "sector": "Communication Services", "description": "Airspan Networks Holdings Inc. designs and produces wireless network equipment for 4G and 5G networks for mainstream public telecommunications service providers and private network implementations. It offers a range of 4G and 5G network build and network densification products with a portfolio of software and hardware tools for indoor and outdoor, compact femto, pico, micro, and macro base stations, as well as fixed wireless access and backhaul solutions portfolio for point-to-point and point-to-multipoint applications. The company serves mobile communications service providers, large enterprises, military communications integrators, and internet service providers. Airspan Networks Holdings Inc. is headquartered in Boca Raton, Florida."}, {"name": "Allspring Multi-Sector Income Fund", "sector": "Financial Services", "description": "Allspring Multi-Sector Income Fund is a closed-ended fixed income mutual fund launched and managed by Wells Fargo Funds Management, LLC. The fund is co-managed by First International Advisors, Inc. and Wells Capital Management Incorporated. It invests in fixed income markets across the globe. The fund primarily invests in a mix of non-investment-grade corporate debt securities, including bank loan securities, foreign and emerging markets debt securities, adjustable and fixed-rate mortgages, and investment-grade corporate bonds. Allspring Multi-Sector Income Fund was formed on June 25, 2003 and is domiciled in the United States."}, {"name": "Almaden Minerals Ltd.", "sector": "Basic Materials", "description": "Almaden Minerals Ltd., an exploration stage company, engages in the acquisition, exploration, evaluation, and development of mineral properties. It primarily owns a 100% interest in the Ixtaca gold-silver project located in Puebla State, Mexico. The company was incorporated in 1980 and is headquartered in Vancouver, Canada."}, {"name": "Altisource Asset Management Corporation", "sector": "Financial Services", "description": "Altisource Asset Management Corporation is an alternative lending company that provides liquidity and capital to under-served market and portfolio management and corporate governance services to institutional investors in the United States. The company offers its services under an asset management agreement to Altisource Residential Corporation, which acquires and manages single-family rental properties for working class families. It also provides management services to NewSource Reinsurance Company Ltd. Altisource Asset Management Corporation was founded in 2012 and is headquartered in Christiansted, Virgin Islands with the additional in United States and India."}, {"name": "Americas Gold and Silver Corporation", "sector": "Basic Materials", "description": "Americas Gold and Silver Corporation, together with its subsidiaries, engages in the acquisition, exploration, development, and operation of mineral properties in North America. It explores for silver, lead, zinc, copper, and gold deposits. The company holds 100% interests in the Cosalá Operations consisting of 67 mining concessions that covers approximately 19,385 hectares located in the state of Sinaloa, Mexico; and the San Felipe development project in Sonora, Mexico. It also owns a 60% interest in the Galena Complex located in the northern Idaho Silver Valley, Idaho; and a 100% interest in the Relief Canyon mine located in the Pershing County, Nevada, the United States. The company was formerly known as Americas Silver Corporation and changed its name to Americas Gold and Silver Corporation in September 2019. Americas Gold and Silver Corporation was incorporated in 1998 and is headquartered in Toronto, Canada."}, {"name": "Amylyx Pharmaceuticals, Inc.", "sector": "Healthcare", "description": "Amylyx Pharmaceuticals, Inc., a clinical-stage biopharmaceutical company, engages in developing various therapeutics for amyotrophic lateral sclerosis (ALS) and other neurodegenerative diseases. The company's product pipeline includes AMX0035, a dual UPR-Bax apoptosis inhibitor composed of sodium phenylbutyrate and taurursodiol for the treatment of amyotrophic lateral sclerosis. It is also developing AMX0035 for other neurodegenerative diseases. The company was founded in 2013 and is headquartered in Cambridge, Massachusetts."}, {"name": "Annovis Bio, Inc.", "sector": "Healthcare", "description": "Annovis Bio, Inc., a clinical stage drug platform company, develops drugs to treat neurodegeneration. The company's lead compound is Buntanetap, an orally administered drug, which has completed Phase 2a clinical trials for the treatment of Alzheimer's disease (AD) and Parkinson's disease, as well as is in clinical trials for Alzheimer's disease in Down Syndrome and other chronic neurodegenerative disorders. It is also developing ANVS405 for protecting the traumatic brain injury and stroke; and ANVS301, which is in Phase I clinical trials to increase cognitive capability in later stages of AD and dementia. The company was incorporated in 2008 and is based in Berwyn, Pennsylvania."}, {"name": "The Arena Group Holdings, Inc.", "sector": "Communication Services", "description": "The Arena Group Holdings, Inc., together with its subsidiaries, operates digital media platform the United States and internationally. The company offers the Platform, a proprietary online publishing platform comprising publishing tools, video platforms, social distribution channels, newsletter technology, machine learning content recommendations, notifications, and other technology. The company was formerly known as TheMaven, Inc. and changed its name to The Arena Group Holdings, Inc. in February 2022. The Arena Group Holdings, Inc. was incorporated in 1990 and is based in New York, New York."}, {"name": "Ashford Inc.", "sector": "Financial Services", "description": "Ashford, Inc is an asset management firm. The firm provides investment management and related services to the real estate and hospitality sectors. Ashford, Inc was formed on April 2, 2014 and is based in Dallas, Texas. Ashford Inc.(NYSEAM:AINC) operates independently of Ashford Hospitality Trust, Inc. as of November 5, 2019."}, {"name": "Ault Disruptive Technologies Corporation", "sector": "Financial Services", "description": "Ault Disruptive Technologies Corporation does not have significant operations. It focuses on effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or other business combination with one or more businesses in technology sector. The company was incorporated in 2021 and is based in Las Vegas, Nevada."}, {"name": "Avino Silver & Gold Mines Ltd.", "sector": "Basic Materials", "description": "Avino Silver & Gold Mines Ltd., together with its subsidiaries, engages in the acquisition, exploration, and advancement of mineral properties in Canada. It primarily explores for silver, gold, and copper deposits. The company owns interests in 42 mineral claims and four leased mineral claims, including Avino mine area property comprising four exploration concessions covering 154.4 hectares, 24 exploitation concessions covering 1,284.7 hectares, and one leased exploitation concession covering 98.83 hectares; Gomez Palacio property consists of nine exploration concessions covering 2,549 hectares; Santiago Papasquiaro property comprises four exploration concessions covering 2,552.6 hectares and one exploitation concession covering 602.9 hectares; and Unification La Platosa properties, which include three leased concessions located in the state of Durango, Mexico. It also owns 100% interests in the Minto and Olympic-Kelvin properties located in British Columbia, Canada; and 14 quartz leases in Eagle property located in the Mayo Mining Division of Yukon, Canada. The company was incorporated in 1968 and is headquartered in Vancouver, Canada."}, {"name": "B2Gold Corp.", "sector": "Basic Materials", "description": "B2Gold Corp. operates as a gold producer with three operating mines in Mali, the Philippines, and Namibia. It operates the Fekola Mine in Mali, the Masbate Mine in the Philippines, and the Otjikoto Mine in Namibia. The company also has an 25% interest in the Calibre Mining Corp.; and approximately 19% interest in BeMetals Corp. In addition, it has a portfolio of other evaluation and exploration assets in Mali, Uzbekistan, and Finland. The company was incorporated in 2006 and is headquartered in Vancouver, Canada."}, {"name": "BK Technologies Corporation", "sector": "Technology", "description": "BK Technologies Corporation, through its subsidiary, BK Technologies, Inc., engages in design, manufacture, and markets wireless communications products in the United States and internationally. The company offers two-way land mobile radios (LMR), repeaters, base stations, and related components and subsystems. Its BK Technologies, BKR, and BK Radio branded products include LMR equipment for professional radio users primarily in government, public safety, and military applications, as well as P-25 digital products; and RELM branded products provide two-way communications for commercial and industrial concerns, such as hotels, construction firms, schools, and transportation services. The company was incorporated in 1997 and is headquartered in West Melbourne, Florida."}, {"name": "BNY Mellon Municipal Income, Inc.", "sector": "Financial Services", "description": "BNY Mellon Municipal Income, Inc. is a closed ended fixed income mutual fund launched and managed by BNY Mellon Investment Adviser, Inc. It invests in the fixed income markets of the United States. The fund primarily invests in municipal obligations that are rated investment grade and have maturities of less than one year. It employs fundamental analysis to create its portfolio. The fund was formerly known as Dreyfus Municipal Income, Inc. BNY Mellon Municipal Income, Inc. was formed on October 24, 1988 and is domiciled in the United States."}, {"name": "Barnwell Industries, Inc.", "sector": "Energy", "description": "Barnwell Industries, Inc. acquires, develops, produces, and sells oil and natural gas in Canada. It operates through three segments: Oil and Natural Gas, Land Investment, and Contract Drilling. The company acquires and develops crude and natural gas assets in the province of Alberta; and invests in land interests in Hawaii. It also owns and operates five water well drilling rigs, two pump rigs, and other ancillary drilling and pump equipment; drills water and water monitoring wells of varying depths; installs and repairs water pumping systems; and distributes trillium flow technologies. Barnwell Industries, Inc. was incorporated in 1956 and is headquartered in Honolulu, Hawaii."}, {"name": "Belpointe PREP, LLC", "sector": "Real Estate", "description": "Belpointe PREP, LLC focuses on identifying, acquiring, developing or redeveloping, and managing commercial real estate properties in the United States. It also intends to invest in and manage a real estate-related assets, including commercial real estate loans and mortgages; and debt and equity securities issued by other real estate-related companies, as well as private equity acquisitions and investments and opportunistic acquisitions of other qualified opportunity funds and qualified opportunity zone businesses. Belpointe PREP, LLC was incorporated in 2020 and is based in Greenwich, Connecticut."}, {"name": "Bioceres Crop Solutions Corp.", "sector": "Basic Materials", "description": "Bioceres Crop Solutions Corp., together with its subsidiaries, provides crop productivity solutions. It operates through three segments: Seed and Integrated Products, Crop Protection, and Crop Nutrition. The Seed and Integrated Products segment develops and commercializes seed technology, biotechnological events, germplasm, and seed treatments. The Crop Protection segment develops, produces, and markets Rizoderma, adjuvants, therapies, herbicides, insecticides, fungicides, and baits. The Crop Nutrition segment develops, produces, commercializes, and sells inoculants, bio-inductors, and biological and microgranulated fertilizers. The company also offers HB4, a drought tolerant seed technology program. It operates in Argentina, Uruguay, France, South Africa, and internationally. The company was founded in 2001 and is headquartered in Rosario, Argentina. Bioceres Crop Solutions Corp. is a subsidiary of Bioceres LLC."}, {"name": "Birks Group Inc.", "sector": "Consumer Cyclical", "description": "Birks Group Inc. designs, develops, manufactures, and retails fine jewelry, timepieces, sterling and plated silverware, and gifts in the United States and Canada. The company operates through two segments, Retail and Other. It offers various merchandise, including designer jewelry, diamonds, gemstone and precious metal jewelry, rings, wedding bands, earrings, bracelets, necklaces, precious gemstones, gold jewelry, and pearls. As of June 23, 2022, the company operated 24 stores under the Maison Birks brand in various metropolitan markets in Canada; one retail location under the Brinkhaus brand in Calgary; and 2 retail locations under the Graff and Patek Philippe brands in Vancouver. It also engages in the retail and wholesale of fine jewelry collections through Mappin & Webb and Goldsmiths stores, as well as through e-commerce platforms; and gold exchange business. The company was formerly known as Birks & Mayors Inc. and changed its name to Birks Group Inc. in September 2013. Birks Group Inc. was founded in 1879 and is headquartered in Montreal, Canada."}, {"name": "Blue Ridge Bankshares, Inc.", "sector": "Financial Services", "description": "Blue Ridge Bankshares, Inc. operates as a bank holding company for the Blue Ridge Bank, National Association that provides commercial and consumer banking, and financial services. It operates through: Commercial Banking and Mortgage Banking segments. The company accepts checking, savings, money market, cash management, and individual retirement accounts, as well as certificates of deposit. It also offers commercial and industrial, residential mortgages, commercial mortgages, home equity, consumer installment, and guaranteed government loans; and mortgages loans on real estate. In addition, it provides wire, direct deposit payroll, remote deposit, payroll processing, electronic statement, and other services; and property and casualty insurance products to individuals and businesses, as well as online, mobile, and telephone banking services. Further, the company offers employee benefit plans and administration services; management services for personal and corporate trusts, including estate planning and settlement, and trust administration, investment and wealth management, and other insurance products; and wholesale and third-party residential mortgage origination services to other financial institutions and credit unions. It has branches in Callao, Charlottesville, Chester, Colonial Heights, Culpeper, Fredericksburg, Gordonsville, Harrisonburg, Hartfield, Henrico, Kilmarnock, Louisa, Luray, Martinsville, Midlothian, Mineral, Montross, Orange, Petersburg, Richmond, Shenandoah, Suffolk, Virginia Beach, Warsaw, and White Stone, Virginia; and Greensboro, North Carolina. The company was founded in 1893 and is headquartered in Charlottesville, Virginia."}, {"name": "Brooklyn ImmunoTherapeutics, Inc.", "sector": "Healthcare", "description": "Brooklyn ImmunoTherapeutics, Inc., a clinical stage biopharmaceutical company, engages in developing therapies to treat patients with cancer. Its advanced program is IRX-2 that is in a Phase 2b clinical trial in patients with squamous cell cancer of the head and neck. The company also develops therapies using gene-editing and cell therapy technology for the treatment of oncology, blood disorder, and monogenic disease. Brooklyn ImmunoTherapeutics, Inc. is based in Brooklyn, New York."}, {"name": "BGSF, Inc.", "sector": "Industrials", "description": "BGSF, Inc. provides workforce solutions and placement services in the United States. It operates in two segments, Real Estate and Professional. The Real Estate segment offers office and maintenance field talent to various apartment communities and commercial buildings. The Professional segment provides skilled IT professionals with expertise in SAP, Workday, Peoplesoft, Hyperion, Oracle, One Stream, cyber, project management, and other IT workforce solutions, as well as finance, accounting, legal, human resource, and related support personnel. Its client partners include Fortune 500 companies, and medium and small companies, as well as consulting companies that engage in systems integration projects. The company was formerly known as BG Staffing, Inc. and changed its name to BGSF, Inc. in February 2021. BGSF, Inc. was incorporated in 2007 and is based in Plano, Texas."}, {"name": "BM Technologies, Inc.", "sector": "Technology", "description": "BM Technologies, Inc. operates as a financial technology (fintech) company in the United States. It facilitates deposits and banking services between a customer and its partner bank, customers bank, which is a related party and is a Federal Deposit Insurance Corporation insured bank. The company, through its fintech banking platform, offers digital banking and disbursement services to consumers and students through digital channels. The company was formerly known as BankMobile Technologies, Inc. and changed its name to BM Technologies, Inc. in January 2021. BM Technologies, Inc. was founded in 2014 and is headquartered in Wayne, Pennsylvania."}, {"name": "Ballantyne Strong, Inc", "sector": "Consumer Cyclical", "description": "Ballantyne Strong, Inc. operates in the entertainment industry worldwide. The company manufactures and distributes projection screens and customized screen support systems directly, as well as through third-party distributors and integrators. It also distributes other products and provides technical support services to the cinema exhibition industry, theme parks, schools, museums, and other entertainment-related markets. In addition, the company offers technical services, such as digital projection equipment installation, and after-sale maintenance and network support services directly to theater owners and other entertainment-related markets, as well as through dealers or value added reseller networks. Further, it distributes and supports third party products, including digital projectors, servers, library management systems, menu boards, and sound systems; and operates digital ignition technology incubator and co-working facility in Alpharetta, Georgia. Ballantyne Strong, Inc. was founded in 1932 and is based in Charlotte, North Carolina."}, {"name": "Bancroft Fund Ltd.", "sector": "Financial Services", "description": "Bancroft Fund Ltd. is a closed-ended equity mutual fund launched by GAMCO Investors, Inc. It is managed by Gabelli Funds, LLC. The fund invests in the public equity markets. It primarily invests in convertible securities including convertible debt and convertible preferred stocks. The fund invests in stocks of companies across market capitalization. It benchmarks the performance of its portfolio against S&P 500 Index, Bank of America Merrill Lynch All U.S. Convertibles Index, and Barclays Balanced U.S. Convertibles Index. The fund was formerly known as Bancroft Convertible Fund, Inc. Bancroft Fund Ltd. was formed on April 20, 1971 and is domiciled in the United States."}, {"name": "Bar Harbor Bankshares", "sector": "Financial Services", "description": "Bar Harbor Bankshares operates as the holding company for Bar Harbor Bank & Trust that provides commercial, lending, retail, and wealth management banking services. It accepts various deposit products, including interest-bearing and non-interest-bearing demand accounts, savings accounts, time deposits, and money market deposit accounts, as well as certificates of deposit. The company also provides commercial real estate loans, such as multi-family, commercial construction and land development, and other commercial real estate classes; commercial and industrial loans, including loans to commercial and agricultural businesses, and tax exempt entities; residential real estate loans consists of mortgages for 1-4 family housing; and consumer loans comprises home equity loans, lines of credit, auto, and other installment lending. In addition, it provides life insurance, annuity, and retirement products, as well as financial planning services; and third-party investment and insurance services. Further, the company offers trust and estate administration, wealth advisory, and investment management services to individuals, businesses, not-for-profit organizations, and municipalities; and 401K plan, financial, estate and charitable planning, investment management, family office, municipal, and tax services. It operates 53 locations across Maine, New Hampshire, and Vermont. The company was founded in 1887 and is based in Bar Harbor, Maine."}, {"name": "Ero Copper Corp.", "sector": "Basic Materials", "description": "Ero Copper Corp., a mining company, focuses on the production, exploration, and development of mining projects in Brazil. The company also explores for copper, gold, and silver deposits. Its principal property is the Vale do CuraÃ§Ã¡ property covering an area of approximately 153,741 hectares located in the northeastern Bahia State, Brazil. The company also holds interests in the Boa EsperanÃ§a project covering an area of approximately 4,034 hectares located in ParÃ¡, Brazil; and NX gold mine covering an area of approximately 31,096 located in Mato Grosso, Brazil. Ero Copper Corp. was incorporated in 2016 and is headquartered in Vancouver, Canada."}, {"name": "Battalion Oil Corporation", "sector": "Energy", "description": "Battalion Oil Corporation, an independent energy company, engages in the acquisition, production, exploration, and development of onshore oil and natural gas assets in the United States. As of December 31, 2021, the company held interests in 40,400 net acres in the Delaware Basin located in the counties of Pecos, Reeves, Ward, and Winkler, Texas. It also had estimated proved reserves of approximately 95.9 million barrels of oil equivalent comprising 58.7 million barrels of crude oil, 16.3 million barrels of natural gas liquids, and 125.0 billion cubic feet of natural gas. The company was formerly known as Halcón Resources Corporation and changed its name to Battalion Oil Corporation in January 2020. Battalion Oil Corporation was founded in 1987 and is headquartered in Houston, Texas."}, {"name": "Better Choice Company Inc.", "sector": "Consumer Defensive", "description": "Better Choice Company Inc. operates as an animal health and wellness company. Its products portfolio includes naturally formulated kibble and canned dog and cat foods, freeze-dried raw dog foods and treats, vegan dog foods and treats, oral care products and supplements, as well as toppers, dental products, chews, and grooming products. The company provides its products for dogs, cats, and pet parents under the Halo and TruDog brand names. Better Choice Company Inc. primarily sells its products through its online portals, as well as through online retailers and pet specialty stores. It has operations in the United States, Canada, China, and Asia. The company was formerly known as Sports Endurance, Inc. and changed its name to Better Choice Company Inc. in March 11, 2019. Better Choice Company Inc. was founded in 1986 and is based in Tampa, Florida."}, {"name": "BiomX Inc.", "sector": "Healthcare", "description": "BiomX Inc., a clinical-stage microbiome company, develops products using natural and engineered phage technologies designed to target and kill specific harmful bacteria. It targets bacteria that affect the appearance of skin, as well as chronic diseases, such as inflammatory bowel diseases (IBD), primary sclerosing cholangitis (PSC), cystic fibrosis (CF), atopic dermatitis, and colorectal cancer (CRC). It is developing BX004, a phage therapy for CF patients with chronic Pseudomonas aeruginosa respiratory infections that is in Phase 1b/2a clinical trials. The company's pipeline products also include BX005, a topical phage cocktail, which is in Phase 1/2 clinical study that targets Staphylococcus aureus (S. aureus), a bacteria associated with the manifestation of the disease; and BX003, an orally administered phage cocktail, which is in Phase 1b/2a that targets a bacterial target present in the gut of IBD and PSC patients. In addition, the company engages in the provision of colorectal cancer program that utilizes engineered phage with various payloads, which are administered intravenously to target Fusobacterium nucleatum bacteria residing within the tumor microenvironment. BiomX Inc. was founded in 2015 and is headquartered in Ness Ziona, Israel."}, {"name": "BitNile Holdings, Inc.", "sector": "Industrials", "description": "BitNile Holdings, Inc., through its subsidiaries, designs, develops, manufactures, and sells power system solutions for the defense/aerospace, industrial, automotive, telecommunications, healthcare, medical/biopharmaceutical, and textile industries in North America, Europe, the Middle East, and internationally. It offers switching and uninterruptible power supplies, power conversion and distribution equipment frequency converters, and transformer and power rectifiers; radio frequency and microwave filters, diplexers, multiplexers, detectors, switch filters, integrated assemblies, and detector logarithmic video amplifiers; and custom computer-based automated test equipment, turnkey systems, high precision calibration equipment, advance power systems, and project management and engineering solutions. The company also provides power conversion and display solutions; residential and commercial high-speed EV charging solutions; commercial loans, convertible notes, and revolving lines of credit; and virtual training courses through the LightSpeedVT platform, as well as creates various media, communications, and content, including web development, corporate communications, social media, and scripted and unscripted television. In addition, it invests in public and private companies; and various commercial and residential real estate, including hospitality, multifamily, and industrial properties, as well as operates hotels and data centers. Further, the company engages in Bitcoin mining and other activities, as well as provides digital marketing services. It sells its products directly through its sales force, as well as through independent manufacturer representatives and distributors. The company was formerly known as Ault Global Holdings Inc. and changed its name to BitNile Holdings, Inc. in December 13, 2021. BitNile Holdings Inc. was incorporated in 1969 and is headquartered in Las Vegas, Nevada."}, {"name": "Bluerock Residential Growth REIT, Inc.", "sector": "Real Estate", "description": "Bluerock Residential Growth REIT, Inc. (NYSE American: BRG) is a real estate investment trust that focuses on developing and acquiring a diversified portfolio of institutional-quality highly amenitized live/work/play apartment communities in demographically attractive knowledge economy growth markets to appeal to the renter by choice. The Company's objective is to generate value through off-market/relationship-based transactions and, at the asset level, through value-add improvements to properties and to operations. The Company is included in the Russell 2000 and Russell 3000 Indexes. BRG has elected to be taxed as a real estate investment trust (REIT) for U.S. federal income tax purposes. Bluerock Residential Growth REIT, Inc. operates as a subsidiary of Bluerock Multifamily Advisor, LLC."}, {"name": "Caledonia Mining Corporation Plc", "sector": "Basic Materials", "description": "Caledonia Mining Corporation Plc primarily engages in the operation of a gold mine. It also explores for and develops mineral properties for precious metals. The company holds 64% interest in the Blanket Mine, a gold mine located in Matabeleland South Province, Zimbabwe. It also has an agreement to purchase 100% ownership in the Maligreen project, a brownfield gold exploration project located in Gweru mining district in the Zimbabwe Midlands. The company was formerly known as Caledonia Mining Corporation and changed its name to Caledonia Mining Corporation Plc in March 2016. Caledonia Mining Corporation Plc was incorporated in 1992 and is headquartered in Saint Helier, Jersey."}, {"name": "Can-Fite BioPharma Ltd.", "sector": "Healthcare", "description": "Can-Fite BioPharma Ltd., a clinical-stage biopharmaceutical company, develops small molecule therapeutic products for the treatment of cancer, liver inflammatory diseases, and erectile dysfunction. The company's lead drug candidate Piclidenoson, which has been completed Phase III clinical trial for the treatment of psoriasis; and Phase II clinical trial for the treatment of COVID-19. It also develops Namodenoson that is in Phase III clinical trial for the treatment of hepatocellular carcinoma, as well as in Phase IIb trial for the treatment of non-alcoholic steatohepatitis; and CF602, which is in pre-clinical trial for the treatment of erectile dysfunction. In addition, the company develops commercial predictive biomarker blood test kit for A3AR. Can-Fite BioPharma Ltd. has license and collaboration agreement with CMS Medical to develop, manufacture, and commercialize Piclidenoson and Namodenoson; and collaboration agreement with Univo Pharmaceuticals to identify and co-develop specific formulations of cannabis components for the treatment of cancer, inflammatory, autoimmune, and metabolic diseases. The company was formerly known as Can-Fite Technologies Ltd. and changed its name to Can-Fite BioPharma Ltd. in January 2001. Can-Fite BioPharma Ltd. was incorporated in 1994 and is headquartered in Petah Tikva, Israel."}, {"name": "Cboe Global Markets, Inc.", "sector": "Financial Services", "description": "Cboe Global Markets, Inc., through its subsidiaries, operates as an options exchange worldwide. It operates through five segments: Options, North American Equities, Futures, Europe and Asia Pacific, and Global FX. The Options segment trades in listed market indices. The North American Equities segment trades in listed U.S. and Canadian equities. This segment also offers exchange-traded products (ETP) transaction and ETP listing services. The Futures segment trades in futures. The Europe and Asia Pacific segment offers pan-European listed equities and derivatives transaction services, ETPs, exchange-traded commodities, and international depository receipts, as well as ETP listings and clearing services. The Global FX segment provides institutional foreign exchange (FX) trading and non-deliverable forward FX transactions services. The company has strategic relationships with S&P Dow Jones Indices, LLC; FTSE International Limited; Frank Russell Company; MSCI Inc.; and DJI Opco, LLC. The company was formerly known as CBOE Holdings, Inc. and changed its name to Cboe Global Markets, Inc. in October 2017. Cboe Global Markets, Inc. was founded in 1973 and is headquartered in Chicago, Illinois."}, {"name": "Central Securities Corp.", "sector": "Financial Services", "description": "Central Securities Corp. is a publicly owned investment manager. The firm invests in the public equity markets of the United States. It also invests on bonds, convertible bonds, preferred stocks, convertible preferred stocks, warrants, options real estate, or short-term obligations of governments, banks and corporations. Central Securities Corp. was founded on October 1, 1929 and is based in New York, New York."}, {"name": "Cheniere Energy, Inc.", "sector": "Energy", "description": "Cheniere Energy, Inc., an energy infrastructure company, primarily engages in the liquefied natural gas (LNG) related businesses in the United States. It owns and operates the Sabine Pass LNG terminal in Cameron Parish, Louisiana; and the Corpus Christi LNG terminal near Corpus Christi, Texas. The company also owns Creole Trail pipeline, a 94-mile pipeline interconnecting the Sabine Pass LNG terminal with various interstate pipelines; and operates Corpus Christi pipeline, a 21.5-mile natural gas supply pipeline that interconnects the Corpus Christi LNG terminal with various interstate and intrastate natural gas pipelines. It is also involved in the LNG and natural gas marketing business. The company was incorporated in 1983 and is headquartered in Houston, Texas."}, {"name": "Cornerstone Building Brands, Inc.", "sector": "Industrials", "description": "Cornerstone Building Brands, Inc., together with its subsidiaries, designs, engineers, manufactures, markets, and installs external building products for the commercial, residential, and repair and remodel markets in the United States, Canada, Mexico, and internationally. The company operates through three segments: Windows, Siding, and Commercial. Its Windows segment provides vinyl, aluminum, wood, and aluminum clad-wood windows and patio doors; and steel, wood, and fiberglass entry doors under the Ply Gem, Simonton, Atrium, American Craftsman, Silver Line, Great Lakes Window, and North Star brands. The company's Siding segment offers vinyl siding and skirting, composite siding, steel siding, vinyl and aluminum soffit, aluminum trim coil, aluminum gutter coil, fabricated aluminum gutter protection, PVC trim and moldings, and window and door trim products, as well as injection molded accents, such as shakes, shingles, shutters and vents, vinyl fencing and railing, and stone veneer. Its Commercial segment designs, engineers, manufactures, and distributes a range of metal products, such as metal building systems, metal roofing and wall systems, and coil coatings. The company was formerly known as NCI Building Systems, Inc. and changed its name to Cornerstone Building Brands, Inc. in May 2019. Cornerstone Building Brands, Inc. is headquartered in Cary, North Carolina."}, {"name": "Clough Global Dividend and Income Fund", "sector": "Financial Services", "description": "Clough Global Dividend and Income Fund is a closed ended balanced mutual fund launched and managed by Clough Capital Partners L.P. The fund primarily invests in the public equity and fixed income markets across the globe. It seeks to invest in securities of companies operating across diversified sectors. For its fixed income portion, it invests in corporate and sovereign debt. It invest in fixed income securities having a maturity ranging from 30 days to over 30 years. The fund invests in non-U.S. markets primarily through liquid securities, including depositary receipts. Its equity portion primarily invests in stocks of small-cap and mid-cap companies. The fund employs a fundamental analysis with a bottom-up stock picking approach to make its investments. It primarily employs a theme-oriented investment approach which emphasizes on industry consolidation, technological change, an emerging shortage of a product or raw material which derives from a period of under-investment, and changes in government regulation or major economic or investment cycles. The fund's research process includes identifying shortages, global geographic growth opportunities, and unique global credit market opportunities. The fund was formerly known as Clough Global Allocation Fund. Clough Global Dividend and Income Fund was formed on April 27, 2004 and is domiciled in the United States."}, {"name": "Clough Global Opportunities Fund", "sector": "Financial Services", "description": "Clough Global Opportunities Fund is a closed ended balanced mutual fund launched and managed by Clough Capital Partners L.P. It invests in public equity and fixed income markets across the globe. The fund invests in securities of companies operating across diversified sectors. For its fixed income portion, the fund invests in both investment grade and non-investment grade issues. It employs a combination of fundamental and quantitative analysis with bottom-up stock picking approach to create its portfolio. Clough Global Opportunities Fund was formed on January 12, 2006 and is domiciled in the United States."}, {"name": "CompX International Inc.", "sector": "Industrials", "description": "CompX International Inc. manufactures and sells security products and recreational marine components primarily in North America. It operates in two segments, Security Products and Marine Components. The Security Products segment manufactures mechanical and electrical cabinet locks, and other locking mechanisms used in various applications, including ignition systems, mailboxes, file cabinets, desk drawers, tool storage cabinets, high security medical cabinetry, integrated inventory and access control secured narcotics boxes, electrical circuit panels, storage compartments, gas station security, and vending and cash containment machines. This segment serves recreational transportation, postal, office and institutional furniture, cabinetry, tool storage, healthcare, and other industries. The Marine Components segment manufactures and distributes stainless steel exhaust headers, exhaust pipes, mufflers, and other exhaust components; gauges, such as GPS speedometers and tachometers; mechanical and electronic controls and throttles; wake enhancement systems, trim tabs, steering wheels, and billet aluminum accessories; dash panels, LED indicators, and wire harnesses; and grab handles, pin cleats, and related hardware and accessories primarily for performance and ski/wakeboard boats for the recreational marine and other industries. The company sells its products directly to original equipment manufacturers, as well as through distributors. The company was incorporated in 1993 and is based in Dallas, Texas. CompX International Inc. is a subsidiary of NL Industries, Inc."}, {"name": "Core Molding Technologies, Inc.", "sector": "Basic Materials", "description": "Core Molding Technologies, Inc., together with its subsidiaries, operates as a molder of thermoplastic and thermoset structural products. The company offers a range of manufacturing processes that include compression molding of sheet molding compound, resin transfer molding, liquid molding of dicyclopentadiene, spray-up and hand-lay-up, direct long-fiber thermoplastics, and structural foam and structural web injection molding. It serves various markets, including medium and heavy-duty truck, automobile, power sport, construction, agriculture, building products, and other commercial markets in the United States, Mexico, Canada, and internationally. The company was formerly known as Core Materials Corporation and changed its name to Core Molding Technologies, Inc. in August 2002. Core Molding Technologies, Inc. was incorporated in 1996 and is headquartered in Columbus, Ohio."}, {"name": "Cornerstone Strategic Value Fund, Inc.", "sector": "Financial Services", "description": "Cornerstone Strategic Value Fund, Inc. is a closed-ended equity mutual fund launched and managed by Cornerstone Advisors, Inc. The fund invests in public equity markets across the globe. It seeks to invest in stocks of companies operating across diversified sectors. The fund primarily invests in value and growth stocks of companies. It also invests through other closed-end investment companies and ETF's. Cornerstone Strategic Value Fund, Inc. was formed on May 1, 1987 and is domiciled in the United States."}, {"name": "Credit Suisse High Yield Bond Fund, Inc.", "sector": "Financial Services", "description": "Credit Suisse High Yield Bond Fund, Inc. is a closed ended fixed income mutual fund launched and managed by Credit Suisse Asset Management, LLC. The fund invests in the fixed income markets of the United States. It invests in the securities of companies across diversified sectors. The fund primarily invests in below-investment-grade corporate bonds with an average credit quality lower than BBB by Standard & Poor's and an average duration of 5.07 years. It focuses factors like financial condition, cash flow and borrowing requirements, value of assets in relation to cost, strength of management, responsiveness to business conditions, credit standing and anticipated results of operations to make its investments. The fund benchmarks the performance of its portfolio against the BofA Merrill Lynch High Yield Master II Constrained Index. Credit Suisse High Yield Bond Fund, Inc. was formed on July 31, 1998 and is domiciled in the United States."}, {"name": "Cybin Inc.", "sector": "Healthcare", "description": "Cybin Inc., a biopharmaceutical company, focuses on developing psychedelic-based therapeutics. The company's development pipeline includes CYB003, a deuterated psilocybin analog to treat major depressive and alcohol use disorders; CYB004, a deuterated dimethyltryptamine for treating anxiety disorders; and CYB005, a phenethylamine derivative to treat neuroinflammation. It has also developed EMBARK, a psychedelic-assisted psychotherapy. The company is headquartered in Toronto, Canada."}, {"name": "CKX Lands, Inc.", "sector": "Energy", "description": "CKX Lands, Inc. engages in the ownership and management of land in the United States. It operates through three segments: Oil and Gas, Surface, and Timber. The company leases its properties for minerals, such as oil and gas; raising and harvesting timber; and surface uses comprising agriculture, right of ways, and hunting. It owns approximately 13,711 net acres of land consisting of 10,369 net acres of timber lands; 2,253 net acres of agriculture lands; and 895 net acres of marsh lands, as well as 194 net acres of land located in metropolitan areas. The company was formerly known as Calcasieu Real Estate & Oil Co., Inc. and changed its name to CKX Lands, Inc. in May 2005. CKX Lands, Inc. was incorporated in 1930 and is based in Lake Charles, Louisiana."}, {"name": "CTO Realty Growth, Inc.", "sector": "Real Estate", "description": "CTO Realty Growth, Inc. is a Florida-based publicly traded real estate company, which owns income properties comprised of approximately 2.4 million square feet in diversified markets in the United States and an approximately 23.5% interest in Alpine Income Property Trust, Inc., a publicly traded net lease real estate investment trust (NYSE: PINE)."}, {"name": "Camber Energy, Inc.", "sector": "Energy", "description": "Camber Energy, Inc., an independent oil and natural gas company, engages in the acquisition, development, and sale of crude oil, natural gas, and natural gas liquids (NGL) in Kansas, Missouri; Louisiana; and Texas. As of December 31, 2021, its total estimated proved producing reserves consists of approximately 73,800 barrels of oil equivalent, including 48,400 barrels were crude oil and NGL reserves, and 152,400 thousand cubic feet were natural gas reserves. The company was formerly known as Lucas Energy Inc. and changed its name to Camber Energy, Inc. in January 2017. Camber Energy, Inc. was incorporated in 2003 and is headquartered in Houston, Texas."}, {"name": "CEL-SCI Corporation", "sector": "Healthcare", "description": "CEL-SCI Corporation engages in the research and development of immunotherapy for the treatment of cancer and infectious diseases. The company's lead investigational immunotherapy is Multikine, which is under phase III clinical trial for the treatment of head and neck cancer. Its Ligand Epitope Antigen Presentation System (LEAPS), a pre-clinical patented T-cell modulation process that stimulates the human immune system to fight bacterial, viral, and parasitic infections, as well as autoimmune diseases, allergies, transplantation rejections, and cancer. The company also develops LEAPS-H1N1-DC; CEL-2000 and CEL-4000 are product candidates for the treatment of rheumatoid arthritis; and LEAPS COV-19, a product candidate to treat COVID-19 coronavirus. CEL-SCI Corporation has a collaboration agreement with the University of Georgia's Center for Vaccines and Immunology to develop LEAPS COVID-19 immunotherapy. The company was incorporated in 1983 and is headquartered in Vienna, Virginia."}, {"name": "Centrus Energy Corp.", "sector": "Energy", "description": "Centrus Energy Corp. supplies nuclear fuel and services for the nuclear power industry in the United States, Japan, Belgium, and internationally. The company operates through two segments, Low-Enriched Uranium (LEU) and Technical Solutions. The LEU segment sells separative work units (SWU) component of LEU; SWU and natural uranium components of LEU; and natural uranium for utilities that operate nuclear power plants. The Technical Solutions segment offers technical, manufacturing, engineering, procurement, construction, and operations services to public and private sector customers, including the American Centrifuge engineering and testing activities. The company was formerly known as USEC Inc. and changed its name to Centrus Energy Corp. in September 2014. Centrus Energy Corp. was incorporated in 1998 and is headquartered in Bethesda, Maryland."}, {"name": "Chase Corporation", "sector": "Basic Materials", "description": "Chase Corporation, a specialty chemicals company, manufactures and sells protective materials for various applications worldwide. It operates through three segments: Adhesives, Sealants and Additives; Industrial Tapes; and Corrosion Protection and Waterproofing. The Adhesives, Sealants and Additives segment offers protective conformal and moisture protective electronic coatings and cleaning solutions; advanced adhesives, sealants, and coatings; polymeric microspheres; polyurethane dispersions; superabsorbent polymers; and cleaning and protection solutions for electronic assemblies. The Industrial Tapes segment provides wire and cable materials; specialty tapes and related products; insulating and conducting materials; laminated durable papers; water-blocking compounds; laminated film foils and cover tapes; and pulling and detection tapes. The Corrosion Protection and Waterproofing segment offers protective pipe-coating tapes and other protectants; polymeric asphalt additives; waterproofing membranes; waterproofing sealants, expansion joints, and accessories; technological products, and tapes and membranes; specialized high-performance coating and lining systems; waterproofing and corrosion protection systems; and pipeline protection tapes and products. It sells its products through its salespeople, as well as manufacturers' representatives and distributors. The company was founded in 1946 and is headquartered in Westwood, Massachusetts."}, {"name": "Chicago Rivet & Machine Co.", "sector": "Industrials", "description": "Chicago Rivet & Machine Co. operates in the fastener industry in North America. It operates in two segments, Fasteners and Assembly Equipment. The Fastener segment manufactures and sells rivets, cold-formed fasteners and parts, and screw machine products. The Assembly Equipment segment manufactures automatic rivet setting machines and assembly equipment, as well as parts and tools for related machines. The company sells its products to automobile and automotive component manufacturers through independent sales representatives. The company was founded in 1920 and is headquartered in Naperville, Illinois."}, {"name": "China Pharma Holdings, Inc.", "sector": "Healthcare", "description": "China Pharma Holdings, Inc. develops, manufactures, and markets generic and branded pharmaceutical, and biochemical products primarily to hospitals and private retailers in the People's Republic of China. The company offers products in the form of dry powder injectables, liquid injectables, tablets, capsules, and cephalosporin oral solutions. Its products include Cerebroprotein Hydroloysate injection to treat memory decline and attention deficit; Gastrodin injection for tiredness, loss of concentration, poor sleep, and traumatic syndromes of the brain; Propylgallate and Ozagrel Sodium to treat cerebral thrombosis, coronary heart disease, and after surgery complications; Alginic Sodium Diester injection for ischemic heart, cerebrovascular, and high lipoprotein blood diseases; Bumetanide injection to treat edema diseases; and Candesartan for hypertension. It also provides Roxithromycin dispersible tablets for pharyngitis and tonsillitis; Cefaclor dispersible tablets for tympanitis, lower respiratory tract infection, urinary tract infections, and skin/skin tissue infection; Cefalexin capsules for acute tonsillitis; Andrographolide for sore throat caused by upper respiratory tract infection; Clarithromycin granules and capsules; and Naproxen Sodium and PseudophedrineHydrochlorida sustained release tablets. In addition, the company offers Hepatocyte growth-promoting factor, Tiopronin, Compound Ammonium Glycyrrhetate S, and Omeparzole for the treatment of digestive diseases. Further, it provides Vitamin B6 injection; Granisetron Hydrochloride injection to treat nausea and vomiting caused by radiotherapy and chemotherapy during the treatment of malignant tumors; Noni Enzyme, a food supplement; sanitizers; and masks. The company offers its products through distributors, as well as through its network of 16 sales offices and approximately 1,000 sales representatives. China Pharma Holdings, Inc. was founded in 1993 and is based in Haikou, the People's Republic of China."}, {"name": "Clough Global Equity Fund", "sector": "Financial Services", "description": "Clough Global Equity Fund is a closed ended equity mutual fund launched and managed by Clough Capital Partners, L.P. It invests in public equity markets across the globe. The fund seeks to invest in stocks of companies operating across diversified sectors. It employs fundamental and quantitative analysis with a bottom up stock picking approach to create its portfolio, with focus on factors such as a company's competitive position, quality of company management, quality and visibility of earnings and cash flow, balance sheet strength, and relative valuation. The fund follows a theme-based investment process which involves focusing on such events as industry consolidation, technological change, an emerging shortage of a product or raw material, and changes in government regulations. It benchmarks the performance of its portfolio against the S&P 500 Index. Clough Global Equity Fund was formed on January 25, 2005 and is domiciled in the United States."}, {"name": "Cohen & Company Inc.", "sector": "Financial Services", "description": "Cohen & Company Inc. is a publicly owned investment manager. The firm primarily provides its services to individuals and institutions. It manages separate client-focused fixed income portfolios. Institutional Financial Markets, Inc. also manages funds and collateralized debt obligations for its clients. It invests in the fixed income and alternative investment markets across the globe. The firm's fixed income investments include U.S. trust preferred securities, European hybrid capital securities, Asian commercial real estate debt, mortgage backed securities, and asset backed securities. The firm was formerly known as Institutional Financial Markets, Inc. Cohen & Company Inc. was founded in 1999 and is based in Philadelphia, Pennsylvania with additional offices in New York City; Boca Raton, Florida; Chicago, Illinois; Bethesda, Maryland; Boston, Massachusetts; Paris, France; and London, United Kingdom."}, {"name": "Comstock Inc.", "sector": "Real Estate", "description": "Comstock Inc. engages in the exploration, development, and production of mineral properties in Nevada. The company explores for gold, silver, lithium, nickel, cobalt, and mercury ores. It operates in two segments, Mining and Real Estate. The Mining segment owns and controls approximately 9,358 acres of mining claims and parcels, including approximately 2,396 acres of patented claims and surface parcels; and approximately 6,962 acres of unpatented mining claims in the Comstock and Silver City districts, as well as focuses on exploring and developing properties in the Lucerne and Dayton resource areas; and Occidental and Gold Hill mineral properties. The Real Estate segment comprises land and real estate rental properties, as well as the Gold Hill Hotel and Daney Ranch properties. It has collaboration agreements with Oro Industries Inc. and Mercury Clean Up, LLC for the manufacture and deployment of mercury remediation systems with proprietary mechanical, hydro, electro-chemical, and oxidation processes to reclaim and remediate mercury from soils, waste, and tailings. The company was formerly known as Comstock Mining Inc. and changed its name to Comstock Inc. in May 2022. Comstock Inc. was incorporated in 2008 and is based in Virginia City, Nevada."}, {"name": "Contango Ore, Inc.", "sector": "Basic Materials", "description": "Contango Ore, Inc., an exploration stage company, engages in the exploration of gold and associated minerals in the United States. It also explores for copper and silver deposits. The company, through its subsidiaries, leases approximately 675,000 acres from the Tetlin Tribal Council and approximately 13,000 State of Alaska mining claims for exploration and development; and owns 100% interest in the mineral rights to approximately 200,000 acres of State of Alaska mining claims located north and northwest of the Tetlin Lease. The company also holds interest in the Shamrock property that consists of 361 Alaska state mining claims covering approximately 52,640 acres. Contango Ore, Inc. was founded in 2009 and is based in Houston, Texas."}, {"name": "CorMedix Inc.", "sector": "Healthcare", "description": "CorMedix Inc., a biopharmaceutical company, focuses on developing and commercializing therapeutic products for the prevention and treatment of infectious and inflammatory diseases in the United States and internationally. Its lead product candidate is DefenCath/Neutrolin, a novel anti-infective solution for the reduction and prevention of catheter-related infections and thrombosis in patients requiring central venous catheters in clinical settings, such as hemodialysis, total parenteral nutrition, and oncology. The company was formerly known as Picton Holding Company, Inc. and changed its name to CorMedix, Inc. in January 2007. CorMedix Inc. was incorporated in 2006 and is based in Berkeley Heights, New Jersey."}, {"name": "Cornerstone Total Return Fund, Inc.", "sector": "Financial Services", "description": "Cornerstone Total Return Fund, Inc. is a closed-ended equity mutual fund launched and managed by Cornerstone Advisors, Inc. It invests in the public equity markets of the United States. The fund seeks to invest in stocks of companies operating across diversified sectors. It primarily invests in value and growth stocks of companies across all market capitalizations. The fund also invests through other closed-end investment companies and ETFs. It benchmarks the performance of its portfolio against the S&P 500 Index. Cornerstone Total Return Fund, Inc. was formed on March 16, 1973 and is domiciled in the United States."}, {"name": "Credit Suisse Asset Management Income Fund, Inc.", "sector": "Financial Services", "description": "Credit Suisse Asset Management Income Fund, Inc. is a closed-ended fixed income mutual fund launched and managed by Credit Suisse Asset Management, LLC. The fund invests in the fixed income markets of the United States. It primarily invests in high yield corporate debt such as bonds and debentures that are rated Baa or lower by Moody's or BBB or lower by S&P. The fund benchmarks the performance of its portfolio against the BofA Merrill Lynch US High Yield Master II Constrained Index. Credit Suisse Asset Management Income Fund, Inc. was formed on February 11, 1987 and is domiciled in the United States."}, {"name": "CynergisTek, Inc.", "sector": "Technology", "description": "CynergisTek, Inc. provides cyber security, privacy, and compliance services in the United States. The company identifies, measures, and tests security and privacy risk of organization, as well as verifies and validates their programs to meet compliance and business objectives through IT audits, technical testing, and risk and program assessments; develops policies, procedures, and playbooks to help build out a risk management program; and verifies the processes, people, and technology are working effectively. It also provides insights to the ROI of an organization's security investment; resources to help organizations prioritize, implement, and execute initiatives to strengthen their security and privacy programs; and on-going management and oversight organization's security and privacy programs to address or give alerts when an issue arises. It serves primarily in the healthcare industry, as well as education, financial services, government, internet and media, and manufacturing industries under the CynergisTek, Redspin, and Backbone Consulting brands. The company was formerly known as Auxilio, Inc. and changed its name to CynergisTek, Inc. in September 2017. CynergisTek, Inc. was incorporated in 1995 and is based in Austin, Texas."}, {"name": "DSS, Inc.", "sector": "Consumer Cyclical", "description": "DSS, Inc. operates in the product packaging, biotechnology, direct, commercial lending, securities and investment management, alternative trading, digital transformation, secure living, and alternative energy businesses worldwide. It manufactures, markets, and sells custom folding cartons, mailers, photo sleeves, and 3-dimensional direct mail solutions; and markets and distributes nutritional and personal care products. The company also invests in or acquires companies in the biohealth and biomedical fields, including businesses that focuses on the advancement of drug discovery and prevention, inhibition, and treatment of neurological, oncological, and immune related diseases; and develops open-air defense initiatives for air-borne infectious diseases comprising tuberculosis and influenza. In addition, it focuses on acquiring equity positions in undervalued commercial banks, bank holding companies, and nonbanking licensed financial companies; and companies engaged in\u0097nonbanking activities related to banking, including loan syndication services, mortgage banking, trust and escrow services, banking technology, loan servicing, equipment leasing, problem asset management, special purpose acquisition company consulting, and advisory capital raising services. Further, the company provides securities and investment management services, as well as operates a real estate investment trust for acquiring hospitals and other acute or post-acute care centers; and focuses on developing healthy living communities. Additionally, it develops and/or acquires assets and investments in the securities trading and/or funds management arena, as well as operates as a digital assets broker dealer; and offers solar farms, solar battery banks, and residential energy creation and storage services. The company was formerly known as Document Security Systems, Inc. and changed its name to DSS, Inc. in September 2021. DSS, Inc. was incorporated in 1984 and is headquartered in West Henrietta, New York."}, {"name": "Daxor Corporation", "sector": "Healthcare", "description": "Daxor Corporation, a medical device company, provides blood volume measurement technology focused on blood volume testing. The company develops and markets BVA-100 Blood Volume Analyzer, a diagnostic blood test to provide safe, accurate, objective quantification of blood volume status and composition compared to patient-specific norms for used in a broad range of medical and surgical conditions. The company was formerly known as Idant Corporation and changed its name to Daxor Corporation in May 1973. Daxor Corporation was incorporated in 1971 and is headquartered in Oak Ridge, Tennessee."}, {"name": "Delaware Investments National Municipal Income Fund", "sector": "Financial Services", "description": "Delaware Investments National Municipal Income Fund is a closed-ended fixed income mutual fund launched by Delaware Management Holdings, Inc. The fund is managed by Delaware Management Business Trust. It invests in the fixed income markets of the United States. The fund primarily invests in investment grade municipal obligations, the income from which is exempt from federal income taxes. Its investments include airport revenue bonds, escrowed to maturity bonds, hospital revenue bonds, pre-refunded bonds, public power revenue bonds, school district general obligation bonds, and short term investments. The fund benchmarks the performance of its portfolio against the Barclays Municipal Bond Index and Lipper CE General & Insured Municipal Debt Funds (Leveraged) Average. Delaware Investments National Municipal Income Fund was formed on February 26, 1993 and is domiciled in the United States."}, {"name": "Dow Inc.", "sector": "Basic Materials", "description": "Dow Inc. provides various materials science solutions for packaging, infrastructure, mobility, and consumer applications in the United States, Canada, Europe, the Middle East, Africa, India, the Asia Pacific, and Latin America. It operates through Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure, and Performance Materials & Coatings segments. The Packaging & Specialty Plastics segment provides ethylene, and propylene and aromatics products; and polyethylene, polyolefin elastomers, ethylene vinyl acetate, and ethylene propylene diene monomer rubbers. The Industrial Intermediates & Infrastructure segment offers ethylene oxides, propylene oxides, propylene glycol and polyether polyols, aromatic isocyanates and polyurethane systems, coatings, adhesives, sealants, elastomers, and composites. This segment also provides caustic soda, and ethylene dichloride and vinyl chloride monomers; and cellulose ethers, redispersible latex powders, and acrylic emulsions. The Performance Materials and Coatings segment provides architectural paints and coatings, and industrial coatings that are used in maintenance and protective industries, wood, metal packaging, traffic markings, thermal paper, and leather; performance silicones and specialty materials; and silicone feedstocks and intermediates. It also engages in property and casualty insurance, as well as reinsurance business. Dow Inc. was incorporated in 2018 and is headquartered in Midland, Michigan."}, {"name": "Dakota Gold Corp.", "sector": "Basic Materials", "description": "Dakota Gold Corp. engages in the acquisition and exploration of mineral properties. It primarily explores for gold deposits. The company holds 100% interest in the Blind Gold, City Creek, Homestake Paleoplacer, Tinton, West Corridor, Ragged Top, Poorman Anticline, Maitland, and South Lead/Whistler Gulch projects located Homestake District, South Dakota. It also holds an option to acquire 100% interest in the Barrick Option and the Richmond Hill Option projects situated in Homestake District, South Dakota. Dakota Gold Corp. was incorporated in 2017 and is based in Lead, South Dakota."}, {"name": "Decisionpoint Systems, Inc.", "sector": "Technology", "description": "Decisionpoint Systems, Inc. provides and integrates enterprise mobility and wireless applications solutions that delivers improved productivity and operational advantages to its clients by helping to move business decision points closer to its customers. It makes enterprise software applications accessible to the front-line worker anytime, anywhere. The company utilizes wireless, mobility, and RFID technologies. It sells, installs, deploys, and repairs mobile computing and wireless systems, such as mobile computers and application software; and related data capture equipment, including bar code scanners and radio frequency identification readers for the retail, warehousing and distribution, healthcare, wholesale distribution, and field sales and service industries. The company also offers lifecycle management, and project management and deployment services; and managed services, such as consulting, technology acquisition, project management, software integration and development, deployment, repair services, service desk, and reverse logistics and end of life disposal services, as well as OnPoint Service Hub, a customer service portal that provides customers real-time asset management and tracking information. In addition, it provides MobileConductor, a software platform that provides complete in-vehicles solutions; VizeTrace, a software platform that manages RFID installations; and custom software development services, as well as resells specialized independent software vendors applications. The company is headquartered in Laguna Hills, California."}, {"name": "Delta Apparel, Inc.", "sector": "Consumer Cyclical", "description": "Delta Apparel, Inc., through its subsidiaries, designs, manufactures, sources, and markets activewear and lifestyle apparel products in the United States and internationally. The company operates through two segments, Delta Group and Salt Life Group. It offers on-demand digitally printed apparel products under the DTG2Go brand; silhouettes and fleece products; performance shirts that keep athletes dry under the Delta Dri line brand; ringspun garments; Delta Soft apparel products; and heritage, mid- and heavier-weight tee shirts under the Delta Pro Weight and Magnum Weight brand names, as well as polos, outerwear, headwear, bags, and other accessories. The company also distributes its products to various audience, which includes sporting goods and outdoor retailers, specialty and resort shops, farm and fleet stores, department stores, and mid-tier retailers, as well as through www.soffe.com website. In addition, it offers apparel, swimwear, board shorts, sunglasses, bags, and accessories under the Salt Life brand name; and craft beer under the Salt Life Lager brand through surf shops, specialty stores, department stores, and outdoor retailers, as well as through its ecommerce site www.saltlife.com. Delta Apparel, Inc. was incorporated in 1999 and is headquartered in Duluth, Georgia."}, {"name": "Denison Mines Corp.", "sector": "Energy", "description": "Denison Mines Corp. engages in the acquisition, exploration, development, extraction, processing, selling of, and investing in uranium properties in Canada. Its flagship project is the 95% interest owned Wheeler River uranium project located in the Athabasca Basin region in northern Saskatchewan. The company was formerly known as International Uranium Corporation and changed its name to Denison Mines Corp. in December 2006. Denison Mines Corp. was founded in 1997 and is headquartered in Toronto, Canada."}, {"name": "EMX Royalty Corporation", "sector": "Basic Materials", "description": "EMX Royalty Corporation, together with its subsidiaries, engages in the exploring for, and generating royalties from, metals and minerals properties. It explores for gold, silver, platinum, palladium, copper, lead, zinc, nickel, cobalt, volcanogenic massive sulfide, molybdenum, and iron deposits. The company's royalty and exploration portfolio primarily consist of properties in North America, Turkey, Europe, Australia, New Zealand, South America, as well as Sweden, and Norway. The company was formerly known as Eurasian Minerals Inc. and changed its name to EMX Royalty Corporation in July 2017. EMX Royalty Corporation is headquartered in Vancouver, Canada."}, {"name": "Eagle Capital Growth Fund, Inc.", "sector": "Financial Services", "description": "Eagle Capital Growth Fund, Inc. is a closed-end equity mutual fund launched and managed by Sims Capital Management LLC. The fund invests in the public equity markets of the United States. It makes its investments in the stocks of companies operating across diversified sectors. The fund benchmarks the performance of its portfolio against the S&P 500 Index. It was previously known as NAIC Growth Fund, Inc. Eagle Capital Growth Fund, Inc. was formed on April 11, 1989 and is domiciled in the United States."}, {"name": "Eaton Vance Limited Duration Income Fund", "sector": "Financial Services", "description": "Eaton Vance Limited Duration Income Fund is a closed-ended fixed income mutual fund launched and managed by Eaton Vance Management. The fund invests in the fixed income markets of the United States. It primarily invests in senior, secured floating-rate loans, government agency mortgage-backed securities, and corporate bonds that are rated below investment grade. The fund seeks to maintain an average duration of three and a half years and average quality BBB/BBB- in its investments. It benchmarks the performance of its portfolio against the S&P/LSTA Leveraged Loan Index, the Merrill Lynch U.S. High Yield Index, and the Barclays Capital U.S. Intermediate Government Bond Index. Eaton Vance Limited Duration Income Fund was formed on May 30, 2003 and is domiciled in the United States."}, {"name": "Eaton Vance Municipal Bond Fund", "sector": "Financial Services", "description": "Eaton Vance Municipal Bond Fund is a closed ended fixed income mutual fund launched and managed by Eaton Vance Management. It invests primarily in high grade municipal obligations. The fund's investment portfolio primarily includes investments in companies operating in the transportation, water and sewer, and electric utilities sectors. It was formerly known as Eaton Vance Insured Municipal Bond Fund. Eaton Vance Municipal Bond Fund was founded in 2002 and is based in Boston, Massachusetts."}, {"name": "Eaton Vance New York Municipal Bond Fund", "sector": "Financial Services", "description": "Eaton Vance New York Municipal Bond Fund is a close-ended fixed income mutual fund launched and managed by Eaton Vance Management. The fund invests in the fixed income market of United States. It invests primarily in high grade municipal obligations comprising of various industries, such as general obligations, hospital, electric utilities, transportation, water and sewer, public education, and private education. Eaton Vance New York Municipal Bond Fund was formed in 2002 and is domiciled in United States."}, {"name": "Endeavor Group Holdings, Inc.", "sector": "Communication Services", "description": "Endeavor Group Holdings, Inc. operates as an entertainment, sports, and content company in the United States, the United Kingdom, and internationally. It operates in three segments: Owned Sports Properties, Events, Experiences & Rights, and Representation. The Owned Sports Properties segment operates a portfolio of sports properties, including Ultimate Fighting Championship, Professional Bull Rider, Euroleague, and Diamond Baseball Holdings, that license broadcast and other intellectual property rights and operate exclusive live events. The Events, Experiences & Rights segment provides services to a portfolio of live events, including sporting events, fashion, art fairs and music, culinary, and lifestyle festivals. This segment also owns and operates the IMG Academy, an academic and sports training institution; and produces and distributes sports video programming. The Representation segment offers services to a diverse group of talent across entertainment, sports, and fashion, such as actors, directors, writers, athletes, models, musicians, and other artists in various mediums comprising film, television, art, books, and live events. This segment provides brand strategy, marketing, advertising, public relations, analytics, digital, activation, and experiential services to corporate and other clients; intellectual property licensing services to a portfolio of entertainment, sports, and consumer product brands; and content development, production, financing, sales, and advisory services for television properties, documentaries, feature films, and podcasts. The company was founded in 1898 and is based in Beverly Hills, California."}, {"name": "Qualtrics International Inc.", "sector": "Technology", "description": "Qualtrics International Inc. operates an experience management platform to manage customer, employee, product, and brand experiences worldwide. The company offers The Qualtrics Experience Management Platform, a system of action that guides users with specific instructions for improvement and automated actions to improve experiences, as well as for listening, understanding, and taking action on both structured and unstructured data. It also provides professional services that primarily consist of research services, through its DesignXM, which allows customers to gain market intelligence, as well as implementations, configurations, and integration and engineering services to help customers deploy its XM Platform. The company was founded in 2002 and is headquartered in Provo, Utah. Qualtrics International Inc. is a subsidiary of SAP America, Inc."}, {"name": "Ellomay Capital Ltd.", "sector": "Utilities", "description": "Ellomay Capital Ltd., together with its subsidiaries, engages in the production of renewable and clean energy in Israel, Spain, and the Netherlands. The company owns six photovoltaic (PV) plants comprising four PV plants in Spain with an aggregate installed capacity of approximately 7.9 megawatts (MW); one PV plant with a peak capacity of 300 MW in the municipality of Talaván, Spain; and one PV plant in Israel with an installed capacity of approximately 9 MW. It also operates a dual-fuel operated power plant with an installed capacity of approximately 860 MWp in the vicinity of Ashkelon, Israel; and constructs a 156 MW pumped storage hydro power plant in the Manara Cliff, Israel. In addition, the company develops anaerobic digestion plants with a green gas production capacity of approximately 375 Nm3/h in Goor and 475 Nm3/h in Oude-Tonge in the Netherlands. Further, it is involved in the construction of a PV plant with installed capacity of 28MW in the municipality of Talaván, Spain. The company was formerly known as NUR Macroprinters Ltd. and changed its name to Ellomay Capital Ltd. in April 2008. Ellomay Capital Ltd. was incorporated in 1987 and is headquartered in Tel Aviv-Yafo, Israel."}, {"name": "Emerson Radio Corp.", "sector": "Technology", "description": "Emerson Radio Corp., together with its subsidiaries, designs, sources, imports, markets, and sells various houseware and consumer electronic products under the Emerson brand in the United States and internationally. It offers houseware products, such as microwave ovens, compact refrigerators, wine products, and toaster ovens; audio products, including clock radios, Bluetooth speakers, and wireless charging products; and other products comprising massagers, toothbrushes, and security products. The company also licenses its trademarks to others on a worldwide basis for various products. Emerson Radio Corp. markets its products primarily through mass merchandisers and online marketplaces. The company was founded in 1912 and is headquartered in Parsippany, New Jersey."}, {"name": "Empire Petroleum Corporation", "sector": "Energy", "description": "Empire Petroleum Corporation engages in the exploration and development of oil and gas interests in Louisiana, New Mexico, North Dakota, Montana, and Texas. The company was formerly known as Americomm Resources Corporation and changed its name to Empire Petroleum Corporation in August 2001. Empire Petroleum Corporation was incorporated in 1983 and is headquartered in Tulsa, Oklahoma."}, {"name": "Equinox Gold Corp.", "sector": "Basic Materials", "description": "Equinox Gold Corp. engages in the operation, acquisition, exploration, and development of mineral properties. The company primarily explores for gold and silver deposits. Its properties include the Aurizona gold mine located in Maranhão State; the RDM gold mine located in Minas Gerais State; and Fazenda gold mine and the Santa Luz gold mine located in Bahia State, Brazil. The company also hold interests in the Mesquite gold mine and the Castle Mountain property situated in California, the United States; and the Los Filos Gold Mine located in Guerrero State, Mexico. In addition, it holds a 60% interest in the Greenstone project located in Ontario, Canada. The company was formerly known as Trek Mining Inc. and changed its name to Equinox Gold Corp. in December 2017. Equinox Gold Corp. was incorporated in 2007 and is headquartered in Vancouver, Canada."}, {"name": "Evans Bancorp, Inc.", "sector": "Financial Services", "description": "Evans Bancorp, Inc. primarily operates as the financial holding company for Evans Bank, N.A. that provides a range of banking products and services to consumer and commercial customers in Western New York and the Finger Lakes Region of New York State. It operates in two segments, Banking Activities and Insurance Agency Activities. The company offers deposit products, which include checking and negotiable order of withdrawal accounts, savings accounts, and certificates of deposit. It also provides residential mortgages; commercial and multi-family mortgages and commercial construction loans; home equities, such as home equity lines of credit and second mortgage loans; commercial and industrial loans comprising term loans and lines of credit; consumer loans, including direct automobile, recreational vehicle, boat, home improvement, and personal loans; other loans consisting of cash reserves, overdrafts, and loan clearing accounts; and installment loans. In addition, the company sells various premium-based insurance policies, including business and personal insurance, employee benefits, surety bonds, risk management, life, disability, and long-term care coverage, as well as provides claims adjusting services to various insurance companies; and non-deposit investment products, such as annuities and mutual funds. It operates through a total of 21 full-service banking offices in Erie County, Niagara County, Monroe County, and Chautauqua County, New York. Evans Bancorp, Inc. was founded in 1920 and is headquartered in Williamsville, New York."}, {"name": "Evolve Transition Infrastructure LP", "sector": "Energy", "description": "Evolve Transition Infrastructure LP, together with its subsidiaries, engages in the acquisition, development, ownership, and operation of infrastructure for the transition of energy supply to lower carbon sources in the United States. The company engages in gathering, processing, and transporting natural gas, NGLs, and crude oil. This segment also operates approximately 160 miles of gathering pipelines, as well as four gathering and processing facilities, including stabilizers, storage tanks, compressors and dehydration units, and other related assets in Western Catarina, which are located in Dimmit and Webb Counties, Texas; and provides upstream production services from the Eagle Ford Shale in South Texas. It owns production assets in Texas and Louisiana. Evolve Transition Infrastructure GP LLC serves as the general partner of the company. The company was formerly known as Sanchez Midstream Partners LP and changed its name to Evolve Transition Infrastructure LP in February 2021. Evolve Transition Infrastructure LP was incorporated in 2005 and is based in Houston, Texas."}, {"name": "Enservco Corporation", "sector": "Energy", "description": "Enservco Corporation, through its subsidiaries, provides well enhancement and fluid management services to the onshore oil and natural gas industry in the United States. It offers frac water heating, hot oiling, pressure testing, acidizing, and water hauling, as well as well site construction services. The company owns and operates a fleet of approximately 318 specialized trucks, trailers, frac tanks, and other well-site related equipment. It operates in the eastern United States region comprising the southern region of the Marcellus Shale formation and the Utica Shale formation in eastern Ohio; Rocky Mountain region consisting of western Colorado and southern Wyoming, central Wyoming, western North Dakota, and eastern Montana; and the Central United States region, including Eagle Ford Shale and East Texas Oilfield in Texas. Enservco Corporation was incorporated in 1980 and is headquartered in Longmont, Colorado."}, {"name": "EVI Industries, Inc.", "sector": "Industrials", "description": "EVI Industries, Inc., through its subsidiaries, distributes, sells, rents, and leases commercial, industrial, and vended laundry and dry cleaning equipment, and steam and hot water boilers in the United States, Canada, the Caribbean, Latin America, and Asia. The company sells and/or leases its customers commercial laundry equipment specializing in washing, drying, finishing, material handling, water heating, power generation, and water reuse applications. It also supplies related replacement parts and accessories; and provides installation, maintenance, and repair services to government, institutional, industrial, commercial, and retail customers. The company was formerly known as EnviroStar, Inc. and changed its name to EVI Industries, Inc. in December 2018. EVI Industries, Inc. was founded in 1959 and is based in Miami, Florida."}, {"name": "Eaton Vance California Municipal Bond Fund", "sector": "Financial Services", "description": "Eaton Vance California Municipal Bond Fund is a close-ended fixed income mutual fund launched and managed by Eaton Vance Management. The fund invests in the fixed income market of United States. It invests primarily in high grade municipal obligations comprising of various industries, such as general obligations, hospital, electric utilities, transportation, water and sewer, public education, and private education. The fund was formerly known as Eaton Vance Insured California Municipal Bond Fund. Eaton Vance California Municipal Bond Fund was formed in 2002 and is domiciled in United States."}, {"name": "Eaton Vance California Municipal Income Trust", "sector": "Financial Services", "description": "Eaton Vance California Municipal Income Trust is a close ended fixed income mutual fund launched and managed by Eaton Vance Management. It invests in the fixed income markets. The fund invests primarily in debt securities issued by education, hospital, housing, insured-education, insured-electric utilities, insured-hospital, insured-transportation, insured-water and sewer, transportation, and other sectors. Eaton Vance California Municipal Income Trust was formed in 1999 and is domiciled in United States."}, {"name": "Electromed, Inc.", "sector": "Healthcare", "description": "Electromed, Inc. develops, manufactures, markets, and sells airway clearance therapy and related products that apply high frequency chest wall oscillation (HFCWO) therapy in pulmonary care for patients of various ages in the United States and internationally. The company offers SmartVest airway clearance system; SmartVest SQL System that consists of an inflatable therapy garment, a programmable air pulse generator, and a patented single-hose that delivers air pulses from the generator to the garment; and SmartVest Connect, a wireless technology with personalized HFCWO therapy management portal for patients with compromised pulmonary function. It also provides single patient use SmartVest and SmartVest Wrap products for health care providers in the acute care setting. The company offers its products primarily to home health care market for patients with bronchiectasis, cystic fibrosis, and neuromuscular disease. Electromed, Inc. markets its products primarily to physicians and health care providers, as well as directly to patients. The company was incorporated in 1992 and is headquartered in New Prague, Minnesota."}, {"name": "Ellsworth Growth and Income Fund Ltd.", "sector": "Financial Services", "description": "Ellsworth Growth and Income Fund Ltd. is a closed-ended equity mutual fund launched by GAMCO Investors, Inc. The fund is managed by Gabelli Funds, LLC. It invests in the public equity markets. The fund primarily invests in convertible securities. It invests in stocks of companies across market capitalizations. The fund benchmarks the performance of its portfolio against the Bank of America Merrill Lynch All U.S. Convertibles Index, Barclays Balanced U.S. Convertibles Index, and S&P 500 Index. It was formerly known as Ellsworth Fund Ltd. Ellsworth Growth and Income Fund Ltd. was formed on June 27, 1986 and is domiciled in the United States."}, {"name": "Energy Fuels Inc.", "sector": "Energy", "description": "Energy Fuels Inc., together with its subsidiaries, engages in the extraction, recovery, exploration, and sale of conventional and in situ uranium recovery in the United States. The company owns and operates the Nichols Ranch project, the Jane Dough property, and the Hank project located in Wyoming; and the Alta Mesa project located in Texas, as well as White Mesa Mill in Utah. It also holds interests in uranium and uranium/vanadium properties and projects in various stages of exploration, permitting, and evaluation located in Utah, Wyoming, Arizona, New Mexico, and Colorado. The company was formerly known as Volcanic Metals Exploration Inc. and changed its name to Energy Fuels Inc. in May 2006. Energy Fuels Inc. was incorporated in 1987 and is headquartered in Lakewood, Colorado."}, {"name": "Envela Corporation", "sector": "Consumer Cyclical", "description": "Envela Corporation, together with its subsidiaries, primarily buys and sells jewelry and bullion products to individual consumers, dealers, Fortune 500 companies, municipalities, school districts, and other organizations in the United States. It offers jewelry and fine-watch products, including bridal jewelry, fashion jewelry, custom-made jewelry, diamonds, and other gemstones, as well as watches and jewelry components. The company also buys and sells various forms of gold, silver, platinum, and palladium products, including United States and other government coins, private mint medallions, art bars, and trade unit bars; and numismatic items, such as rare coins, currency, medals, tokens, and other collectibles, as well as provides jewelry and watches repair services. In addition, it offers end-of-life electronics recycling services; disposal transportation and product tracking services; IT-asset disposition services, including compliance and data sanitization services; and services to companies in the areas of software upgrades, and hardware or networking capabilities, as well as moving to cloud services. As of December 31, 2021, Envela Corporation marketed its products and services through six retail locations under the Dallas Gold & Silver Exchange name; and one retail location under the Charleston Gold & Diamond Exchange name, as well as through cgdeinc.com, dgse.com, echoenvironmental.com, ITADUSA.com, availrecovery.com, and teladvance.com e-commerce sites. The company was formerly known as DGSE Companies, Inc. and changed its name to Envela Corporation in December 2019. Envela Corporation was incorporated in 1965 and is headquartered in Irving, Texas."}, {"name": "Espey Mfg. & Electronics Corp.", "sector": "Industrials", "description": "Espey Mfg. & Electronics Corp., a power electronics design and original equipment manufacturing company, designs, manufactures, and tests electronic equipment primarily for use in military and industrial applications in the United States and internationally. The company's principal products include power supplies, power converters, filters, power transformers, magnetic components, power distribution equipment, UPS systems, antennas, and high-power radar systems for use in AC and DC locomotives, shipboard power, shipboard radar, airborne power, ground-based radar, and ground mobile power applications. It also provides various services comprising design and development to specification, build to print, design services, design studies, environmental testing services, metal fabrication, painting services, and development of automatic testing equipment. In addition, the company produces individual components, such as inductors, printed circuit boards, wires, and tests items. It serves industrial manufacturers and defense companies, the government of the United States, foreign governments, and foreign electronic equipment companies through its direct sales organization and outside sales representatives. The company was incorporated in 1928 and is based in Saratoga Springs, New York."}, {"name": "Evolution Petroleum Corporation", "sector": "Energy", "description": "Evolution Petroleum Corporation, an oil and natural gas company, engages in the development, production, ownership, and management of oil and gas properties in the United States. The company holds interests in a CO2 enhanced oil recovery project in Louisiana's Delhi field. Its Delhi Holt-Bryant Unit covers an area of 13,636 acres located in Northeast Louisiana. The company also holds interests in the Hamilton Dome field covering 5,908 acres located in Wyoming; and Barnett Shale field covering an area of 123,777 acres located in North Texas. Evolution Petroleum Corporation was founded in 2003 and is based in Houston, Texas."}, {"name": "Excellon Resources Inc.", "sector": "Basic Materials", "description": "Excellon Resources Inc., a silver mining and exploration company, acquires, explores, develops, and exploits mineral properties in Mexico and Canada. The company primarily explores for silver, lead, zinc, and gold deposits. It holds 100% interests in the Platosa property covering an area of approximately 11,000 hectares located in Durango State, Mexico; the Evolución property that covers an area of 45,000 hectares situated in the states of Durango and Zacatecas, Mexico; and the Silver City Project totaling an area of 164 square kilometers in Saxony, Germany. It also holds 100% interests in the Kilgore Project that covers an area of 6,788 located in Clark County, Southeastern Idaho; and the Oakley Project covering an area of 2,833 hectares in Oakley, Idaho. The company was incorporated in 1987 and is based in Toronto, Canada."}, {"name": "First Trust Energy Income and Growth Fund", "sector": "Financial Services", "description": "First Trust Energy Income and Growth Fund is a closed-ended equity mutual fund launched and managed by First Trust Advisors L.P. It is co-managed by Energy Income Partners, LLC. The fund invests in the public equity markets of the United States. It seeks to invest in stocks of companies operating in the energy sector, including companies in the business of transporting, processing, storing, distributing, or marketing natural gas, natural gas liquids (including propane), crude oil, refined petroleum products, coal or electricity, or exploring, developing, managing or producing such commodities or products, or in supplying energy-related products and services. The fund primarily invests in growth stocks of companies, energy sector MLPs, and MLP-related entities. It employs a combination of fundamental and quantitative analysis, focusing on such factors as debt to cash flows, coverage ratios, incentive structure, management team, track record of distribution, and dividend growth to create its portfolio. The fund benchmarks the performance of its portfolio against the S&P 500 Index, Barclays Capital U.S. Credit Index of Corporate Bonds, Alerian MLP Total Return Index, Wells Fargo Midstream MLP Total Return Index, and composite index comprised of 50% Alerian MLP Total Return Index and 50% Wells Fargo Midstream MLP Total Return Index. It was formerly known as Energy Income & Growth Fund. First Trust Energy Income and Growth Fund was formed on March 25, 2004 and is domiciled in the United States."}, {"name": "Flanigan's Enterprises, Inc.", "sector": "Consumer Cyclical", "description": "Flanigan's Enterprises, Inc., together with its subsidiaries, operates a chain of full-service restaurants and package liquor stores in South Florida. It operates in two segments, Package Stores and Restaurants. The company operates package liquor stores under the Big Daddy's Liquors name, which offer private label liquors, beer, and wines; and restaurants under the Flanigan's Seafood Bar and Grill service mark that provide alcoholic beverages and full food services. As of October 2, 2021, it operated 27 units consisting of restaurants, package liquor stores, and combination restaurants/package liquor stores; and franchised 5 units comprising 2 restaurants and 3 combination restaurants/package liquor stores. Flanigan's Enterprises, Inc. was incorporated in 1959 and is headquartered in Fort Lauderdale, Florida."}, {"name": "Franklin Limited Duration Income Trust", "sector": "Financial Services", "description": "Franklin Limited Duration Income Trust is a closed-ended fixed income mutual fund launched by Franklin Resources, Inc. The fund is managed by Franklin Advisers, Inc. It invests in the fixed income markets of the United States. The fund primarily invests in mortgage-backed securities, asset-backed securities, floating rate bank loans, and high yield corporate bonds. It employs fundamental analysis with a combination of top-down and bottom-up security selection process to create its portfolio. The fund was formerly known as Franklin Templeton Limited Duration Income Trust. Franklin Limited Duration Income Trust was formed on August 27, 2003 and is domiciled in the United States."}, {"name": "Fresh Vine Wine, Inc.", "sector": "Consumer Defensive", "description": "Fresh Vine Wine, Inc. produces and sells low-carb and low-calorie wines in the United States and Puerto Rico. Its wine varietals include cabernet sauvignon, pinot noir, chardonnay, and rose. The company offers its products through wholesale, retail, and direct-to-consumer channels. Fresh Vine Wine, Inc. was founded in 2019 and is based in Plymouth, Minnesota."}, {"name": "Fury Gold Mines Limited", "sector": "Basic Materials", "description": "Fury Gold Mines Limited operates as an exploration and development company in Canada. It primarily explores for gold properties. The company's flagship properties include the Eau Claire project that consists of map-designated claims totaling approximately 23,000 hectares located in the Eeyou Istchee James Bay Region of Northern Quebec; and Committee Bay project, which comprise 57 crown leases and 190 mineral claims in six non-contiguous blocks totaling approximately 297,273 hectares situated in the Kitikmeot Region of Nunavut. It also explores for silver metals. The company was formerly known as Auryn Resources Inc. and changed its name to Fury Gold Mines Limited in October 2020. Fury Gold Mines Limited was incorporated in 2008 and is headquartered in Vancouver, Canada."}, {"name": "Flexible Solutions International, Inc.", "sector": "Basic Materials", "description": "Flexible Solutions International, Inc., together with its subsidiaries, develops, manufactures, and markets specialty chemicals that slow the evaporation of water in Canada, the United States, and internationally. The company operates in two segments, Energy and Water Conservation Products, and Biodegradable Polymers. The company offers thermal polyaspartates (TPAs) for oilfields to reduce scale and corrosion in various water systems; and for the agricultural industry to reduce fertilizer crystallization before, during, and after application, as well as to prevent crystal formation between fertilizer and minerals present in the soil. It also provides TPAs for irrigation to prevent early plugging of drip irrigation ports, reduce maintenance costs, and lengthen the life of equipment; and TPAs as additives for household laundry detergents, consumer care products, and pesticides. In addition, the company offers nitrogen conservation products for agriculture that slow down nitrogen loss from fields. Further, it provides HEATSAVR, a chemical product for use in swimming pools and spas that forms a thin and transparent layer on the water's surface; and WATERSAVR to reduce water evaporation in reservoirs, potable water storage tanks, livestock watering ponds, aqueducts, canals, and irrigation ditches, as well as for lawn and turf care, and potted and bedding plants. Flexible Solutions International, Inc. is headquartered in Taber, Canada."}, {"name": "Franklin Street Properties Corp.", "sector": "Real Estate", "description": "Franklin Street Properties Corp., based in Wakefield, Massachusetts, is focused on infill and central business district (CBD) office properties in the U.S. Sunbelt and Mountain West, as well as select opportunistic markets. FSP seeks value-oriented investments with an eye towards long-term growth and appreciation, as well as current income. FSP is a Maryland corporation that operates in a manner intended to qualify as a real estate investment trust (REIT) for federal income tax purposes."}, {"name": "Friedman Industries, Incorporated", "sector": "Basic Materials", "description": "Friedman Industries, Incorporated engages in steel processing, pipe manufacturing and processing, and the steel and pipe distribution businesses the United States. It operates in two segments, Coil and Tubular. The Coil segment is involved in the conversion of steel coils into flat sheet and plate steel cut to customer specifications and reselling steel coils. This segment also processes customer-owned coils on a fee basis. The company sells coil products and processing services to approximately 200 customers located primarily in the midwestern, southwestern and southeastern regions of the United States. Its principal customers for these products and services are steel distributors and customers manufacturing steel products, such as steel buildings, railroad cars, barges, tanks and containers, trailers, component parts and other fabricated steel products. The Tubular segment manufactures line and oil country pipes, as well as pipes for structural applications. This segment sells its tubular products principally to steel and pipe distributors through its own sales force. The company was incorporated in 1965 and is headquartered in Longview, Texas."}, {"name": "GAMCO Global Gold, Natural Resources & Income Trust", "sector": "Financial Services", "description": "GAMCO Global Gold, Natural Resources & Income Trust is a closed ended equity mutual fund launched by GAMCO Investors, Inc. The fund is managed by Gabelli Funds, LLC. It invests in the public equity markets across the globe. The fund invests in stocks of companies principally engaged in the gold and natural resources industries including companies principally engaged in the exploration, mining, fabrication, processing, distribution, or trading of gold, or the financing, managing and controlling, or operating of companies engaged in gold related activities. It also invests in equity securities of companies principally engaged in the exploration, production, or distribution of natural resources, such as gas and oil, paper, food and agriculture, forestry products, metals, and minerals as well as related transportation companies and equipment manufacturers. The fund makes its investments using call options. It benchmarks the performance of its portfolio against the CBOE S&P 500 Buy/Write Index, Philadelphia Gold & Silver Index, Energy Select Sector Index, and Barclays Government/Credit Bond Index. The fund was formerly known as GAMCO Global Gold, Natural Resources & Income Trust by Gabelli. GAMCO Global Gold, Natural Resources & Income Trust was formed on January 4, 2005 and is domiciled in United States."}, {"name": "Galiano Gold Inc.", "sector": "Basic Materials", "description": "Galiano Gold Inc. engages in the exploration, development, and production of gold properties. The company's primary asset is the Asanko Gold Mine located in Ghana, West Africa. The company was formerly known as Asanko Gold Inc. and changed its name to Galiano Gold Inc. in May 2020. Galiano Gold Inc. was incorporated in 1999 and is headquartered in Vancouver, Canada."}, {"name": "Genius Group Limited", "sector": "Consumer Defensive", "description": "Genius Group Limited, through its subsidiaries, provides entrepreneur education system business development tools and management consultancy services to entrepreneurs and entrepreneur resorts. Its courses, products, and services form a full entrepreneur education curriculum together with a full suite of tools for students. The company also owns entrepreneur resorts in Bali and South Africa, which run entrepreneur retreats and workshops; and Genius Café, an entrepreneur beach club in Bali, as well as Genius Central, an entrepreneur co-working hub in Singapore. In addition, it offers home childcare and investment education services; operates entrepreneur education campus that provides a range of programs from pre-primary through primary school, secondary school, and vocational college; and provides career-focused on-campus and online programs at the Master's, Bachelor's, and Associate degree level, as well as certificate and continuing education programs. The company was founded in 2002 and is based in Singapore."}, {"name": "Globalstar, Inc.", "sector": "Communication Services", "description": "Globalstar, Inc. provides mobile satellite services worldwide. The company offers duplex two-way voice and data products, including mobile voice and data satellite communications services and equipment for remote business continuity, recreational usage, safety, emergency preparedness and response, and other applications; fixed voice and data satellite communications services and equipment at industrial, commercial, and residential sites, as well as rural villages and ships; and data modem services and equipment. It also provides SPOT consumer retail products, such as SPOT satellite GPS messenger for personal tracking, emergency location, and messaging solutions; and SPOT Trace, an anti-theft and asset tracking device. In addition, the company offers commercial Internet of Things one-way transmission products to track cargo containers and rail cars, as well as to monitor utility meters, and oil and gas assets. Further, it sells wholesale minutes to independent gateway operators (IGOs); and provides engineering services, such as hardware and software designs to develop specific applications; and installation of gateways and antennas. The company distributes its products directly, as well as through independent agents, dealers and resellers, retailers, IGOs, and sales force and e-commerce Website. As of December 31, 2020, it had approximately 745,000 subscribers. The company primarily serves recreation and personal, government, public safety and disaster relief, oil and gas, maritime and fishing, construction, utilities, and transportation, as well as natural resources, mining, and forestry markets. Globalstar, Inc. has a strategic alliance with XCOM Labs to jointly commercialize XCOM's capacity-multiplying technology with Globalstar's Band n53 for 5G deployments in the United States and other countries where Globalstar has terrestrial rights. The company was founded in 1993 and is headquartered in Covington, Louisiana."}, {"name": "Gold Resource Corporation", "sector": "Basic Materials", "description": "Gold Resource Corporation engages in the exploration, development, and production of gold and silver projects in Mexico and the United States. The company also explores for copper, lead, and zinc deposits. Its principal asset is the 100% owned Back Forty project covering approximately 1,304 hectares located in Menominee county, Michigan. The company was founded in 1998 and is headquartered in Denver, Colorado."}, {"name": "Gold Standard Ventures Corp", "sector": "Basic Materials", "description": "Gold Standard Ventures Corp., an exploration stage company, engages in the development of district-scale and other gold-bearing mineral resource properties in Nevada, the United States. Its flagship property is the Railroad-Pinion project covering an area of approximately 53,570 acres located in the Elko County, Nevada. The company was incorporated in 2004 and is headquartered in Vancouver, Canada."}, {"name": "Golden Minerals Company", "sector": "Basic Materials", "description": "Golden Minerals Company, a precious metals exploration company, mines, constructs, and explores for mineral properties containing precious metals. It explores for gold, silver, zinc, lead, and other minerals. The company holds a 100% interest in the Rodeo gold mine situated in Durango State, Mexico; and a 100% interest in the Velardeña and Chicago gold-silver mining properties and associated oxide and sulfide processing plants located in the State of Durango, Mexico. It also holds a 100% interest in the El Quevar advanced exploration silver property situated in the province of Salta, Argentina; and diversified portfolio of precious metals and other mineral exploration properties located in Argentina, Nevada, and Mexico. The company was formerly known as Apex Silver Mines Limited and changed its name to Golden Minerals Company in March 2009. Golden Minerals Company was founded in 1996 and is headquartered in Golden, Colorado."}, {"name": "Gran Tierra Energy Inc.", "sector": "Energy", "description": "Gran Tierra Energy Inc., together with its subsidiaries, engages in the exploration and production of oil and gas properties in Colombia and Ecuador. As of December 31, 2021, it had total proved undeveloped reserves of 24.8 million barrels of oil equivalent in Colombia. The company was incorporated in 2003 and is headquartered in Calgary, Canada."}, {"name": "GigCapital5, Inc.", "sector": "Financial Services", "description": "GigCapital5, Inc. is a blank check company. The company was incorporated in 2021 and is based in Palo Alto, California."}, {"name": "GEE Group, Inc.", "sector": "Industrials", "description": "GEE Group, Inc. provides permanent and temporary professional and industrial staffing and placement services in the United States. The company operates through two segments, Industrial Staffing Services and Professional Staffing Services. It offers placement of information technology, accounting, finance, office, engineering, and medical professionals for direct hire and contract staffing services; and temporary staffing services for light industrial clients. The company also provides medical scribes, who offer electronic medical record services for emergency departments, specialty physician practices, and clinics. It offers professional and commercial staffing services under the names of Access Data Consulting, Agile Resources, Ashley Ellis, GEE Group, Omni One, Paladin Consulting, and Triad; medical staffing services under the Scribe Solutions brand; and contract and direct hire professional staffing services under the Accounting Now, Staffing Now, SNI Banking, SNI Certes, SNI Energy, SNI Financial, and SNI Technology brands. The company was formerly known as General Employment Enterprises, Inc. and changed its name to GEE Group, Inc. in July 2016. GEE Group, Inc. was founded in 1893 and is based in Jacksonville, Florida."}, {"name": "The Gabelli Global Utility & Income Trust", "sector": "Financial Services", "description": "The Gabelli Global Utility & Income Trust is a closed-ended equity mutual fund launched by GAMCO Investors, Inc. It is managed by Gabelli Funds, LLC. The fund invests in public equity markets across the globe. It primarily invests in stocks of companies involved to a substantial extent in providing products, services, or equipment for the generation or distribution of electricity, gas, or water and infrastructure operations, and in equity securities including preferred securities of companies in other industries, in each case in such securities that are expected to pay periodic dividends. The fund also invests in income producing securities such as governments. It invests in stocks of companies across market capitalizations. The fund benchmarks the performance of its portfolio against the S&P 500 Utilities Index, Lipper Utility Fund Average, and S&P 500 Index. The Gabelli Global Utility & Income Trust was formed on May 28, 2004 and is based in United States."}, {"name": "Galata Acquisition Corp.", "sector": "Financial Services", "description": "Galata Acquisition Corp. does not have significant operations. The company focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or other business combination with one or more businesses or entities. It intends to focus on technology-enabled financial services businesses. The company was incorporated in 2021 and is based in Washington, the District of Columbia."}, {"name": "Gold Royalty Corp.", "sector": "Basic Materials", "description": "Gold Royalty Corp., a precious metals-focused royalty company, provides financing solutions to the metals and mining industry. It focuses on acquiring royalties, streams, and similar interests at varying stages of the mine life cycle to build a portfolio offering near, medium, and longer-term attractive returns for its investors. The company's portfolio consists of net smelter return royalties ranging from 0.5% to 2.0% on 17 gold properties located in the Americas. Gold Royalty Corp. was incorporated in 2020 and is headquartered in Vancouver, Canada."}, {"name": "GoldMining Inc.", "sector": "Basic Materials", "description": "GoldMining Inc., a mineral exploration company, focuses on the acquisition, exploration, and development of gold assets in the Americas. It also operates a diversified portfolio of resource-stage gold and gold-copper projects in Canada, the United States, Brazil, Colombia, and Peru. The company's principal projects include La Mina Gold Project and Titiribi Gold-Copper Project located in Colombia; Whistler Gold-Copper Project located in Alaska, United States; and São Jorge Gold Project located in the State of Pará, northeastern Brazil. The company was formerly known as Brazil Resources Inc. and changed its name to GoldMining Inc. in December 2016. GoldMining Inc. was incorporated in 2009 and is headquartered in Vancouver, Canada."}, {"name": "Golden Star Resources Ltd.", "sector": "Basic Materials", "description": "Golden Star Resources Ltd. operates as a gold mining and exploration company. The company owns and operates the Wassa open-pit gold mine, the Wassa underground mine, and a carbon-in-leach processing plant located to the northeast of the town of Tarkwa, Ghana; and the Bogoso gold mining and processing operation, the Prestea open-pit mining operations, and the Prestea underground mine located near the town of Prestea, Ghana. It also holds and manages interests in various gold exploration properties in Ghana and Brazil. The company was incorporated in 1992 and is headquartered in Toronto, Canada."}, {"name": "Great Panther Mining Limited", "sector": "Basic Materials", "description": "Great Panther Mining Limited operates as a precious metals mining and exploration company. It explores for gold, silver, copper, lead, and zinc ores. The company operates three mines, including the Tucano gold mine in Amapá State, Brazil; and the Guanajuato mine complex and the Topia mine in Mexico, as well as Coricancha mine complex in the central Andes, Peru. Its exploration properties also include the El Horcón, Santa Rosa, and Plomo projects in Mexico. The company was formerly known as Great Panther Silver Limited and changed its name to Great Panther Mining Limited in March 2019. Great Panther Mining Limited was incorporated in 1965 and is headquartered in Vancouver, Canada."}, {"name": "HEXO Corp.", "sector": "Healthcare", "description": "HEXO Corp., through its subsidiaries, produces, markets, and sells cannabis in Canada. The company offers its adult-use and medical products under the HEXO brand name. It also provides cannabis beverages under the Little Victory, House of Terpenes, Mollo, Veryvell, and XMG brands; and cannabis products under UP Cannabis, Original Stash, and Up brand names. HEXO Corp. has a strategic alliance with Tilray Brands, Inc. The company was formerly known as The Hydropothecary Corporation and changed its name to HEXO Corp. in August 2018. HEXO Corp. was founded in 2013 and is headquartered in Gatineau, Canada."}, {"name": "Houston American Energy Corp.", "sector": "Energy", "description": "Houston American Energy Corp., an independent oil and gas company, engages in the exploration, development, and production of natural gas, crude oil, and condensate in the United States. Its oil and gas properties are located primarily in the Texas Permian Basin, the onshore Texas and Louisiana Gulf Coast region, and in the South American country of Colombia. As of December 31, 2021, the company owned interests in four gross wells. Houston American Energy Corp. was incorporated in 2001 and is based in Houston, Texas."}, {"name": "HNR Acquisition Corp", "sector": "Financial Services", "description": "HNR Acquisition Corp. does not have significant operations. It focuses on effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses. HNR Acquisition Corp. was incorporated in 2020 and is based in Houston, Texas."}, {"name": "Hilton Grand Vacations Inc.", "sector": "Consumer Cyclical", "description": "Hilton Grand Vacations Inc., a timeshare company, develops, markets, sells, and manages vacation ownership resorts primarily under the Hilton Grand Vacations brand. The company operates in two segments, Real Estate Sales and Financing, and Resort Operations and Club Management. It sells vacation ownership intervals and vacation ownership interests; manages resorts and clubs; operates points-based vacation clubs and resort amenities; and finances and services loans provided to consumers for their timeshare purchases. The company also manages and operates the points-based Hilton Grand Vacations Club and Hilton Club exchange programs, and Diamond Clubs, which provide exchange, leisure travel, and reservation services to approximately 333,000 members, as well as engages in the rental of inventory made available due to ownership exchanges through its club programs. As of December 31, 2021, it had 154 properties located in the United States. The company was founded in 1992 and is headquartered in Orlando, Florida."}, {"name": "Idaho Strategic Resources, Inc.", "sector": "Basic Materials", "description": "Idaho Strategic Resources, Inc. engages in the exploring, developing, and extracting gold, silver, and base metal mineral resources in the Greater Coeur d'Alene Mining District of North Idaho and Western Montana. It owns 100% interest in the Golden Chest Mine that consists of 25 patented mining claims covering an area of 280 acres and 90 unpatented claims mine covering an area of 1,390 acres located in Murray, Idaho. The company was founded in 1996 and is headquartered in Coeur d'Alene, Idaho."}, {"name": "Impac Mortgage Holdings, Inc.", "sector": "Financial Services", "description": "Impac Mortgage Holdings, Inc. operates as a residential mortgage lender in the United States. It operates through three segments: Mortgage Lending, Real Estate Services, and Long-Term Mortgage Portfolio. The Mortgage Lending segment provides mortgage lending products through three lending channels, such as retail, wholesale, and correspondent and opportunistically retain mortgage servicing rights. The Real Estate Services segment provides loss mitigation and real estate services primarily on its long-term mortgage portfolio, including default surveillance, loan modification, short sale, and real estate owned surveillance and disposition services, as well as monitoring, reconciling, and reporting services for residential and multifamily mortgage portfolios. This segment provides services to investors, servicers, and individual borrowers primarily focusing on loss mitigation and performance. The Long-Term Mortgage Portfolio segment consists of residual interests in the securitization trusts reflected as trust assets and liabilities in its consolidated balance sheets. Impac Mortgage Holdings, Inc. was incorporated in 1995 and is based in Irvine, California."}, {"name": "Income Opportunity Realty Investors, Inc.", "sector": "Financial Services", "description": "Income Opportunity Realty Investors, Inc., a Dallas-based real estate investment company, holds a portfolio of equity real estate in Texas, including undeveloped land. The Company invests in real estate through direct equity ownership and partnerships. For more information, visit the Company's website at www.incomeopp-realty.com."}, {"name": "Indonesia Energy Corporation Limited", "sector": "Energy", "description": "Indonesia Energy Corporation Limited operates as an oil and gas exploration and production company in Indonesia. It holds interests in the Kruh Block, a producing block covering an area of 258 square kilometers with net crude oil proved reserves of 1.52 million barrels located to the northwest of Pendopo, Pali, South Sumatra; and the Citarum Block, an exploration block covering an area of 3,924.67 square kilometers located onshore in West Java. The company was incorporated in 2018 and is headquartered in Jakarta, Indonesia. Indonesia Energy Corporation Limited is a subsidiary of Maderic Holding Limited."}, {"name": "InnSuites Hospitality Trust", "sector": "Real Estate", "description": "InnSuites Hospitality Trust (NYSE American symbol: IHT) first listed on the NYSE in 1971 is headquartered in Phoenix, Arizona is an unincorporated Ohio Business. Trust that owns and manages hotels under the InnSuites Hotels name. InnSuites® Hotels and Suites has owned real estate and hotels and provided hotel services including management, branding, and reservations to hotels under the brand name \u0093InnSuites\u0094 trademarked and owned by IHT over 40 years by being innovators for guest needs and recognizing hotel membership demands."}, {"name": "Intellicheck, Inc.", "sector": "Technology", "description": "Intellicheck, Inc., a technology company, develops, integrates, and markets threat identification and identity authentication solutions for bank and retail fraud prevention, law enforcement threat identification, and mobile and handheld access control and security systems primarily in the United States. It provides identity systems products, including commercial identification products, such as Intellicheck Platform, an identity solution that checks whether an ID is valid, matches the ID to the person presenting it, and provides a risk score to determine the risk of doing business with that person; IDN-Portal that provides the ability to scan an ID using a mobile phone; IDN-Portal+ that uses a retail scanner to validate an ID, and get additional data for analytics and analysis; IDN-Direct that provides access to additional data and the ability to use the platform's Risk Score capability to help with decision-making; and Intellicheck mobile app, which provides the ability to login and scan an ID. The company also offers State Aware Software solution, which provides or restricts information that is electronically scanned from an ID based on the electronic reading laws according to the state in which the ID is scanned; data collection devices that enable its software applications to be used on a variety of commercially available credit card terminals, PDAs, tablets, laptops, desktops, mobile phones, and point-of-sale terminals; and instant credit application kiosk software applications. It serves government, military, and commercial markets. The company was formerly known as Intellicheck Mobilisa, Inc. and changed its name to Intellicheck, Inc. in May 2017. Intellicheck, Inc. was incorporated in 1994 and is headquartered in Melville, New York."}, {"name": "International Tower Hill Mines Ltd.", "sector": "Basic Materials", "description": "International Tower Hill Mines Ltd., a mineral exploration company, engages in the acquisition, exploration, and development of mineral properties. It holds or has rights to acquire interests in the Livengood gold project covering an area of approximately 19,546 hectares located to the northwest of Fairbanks, Alaska. The company was formerly known as Tower Hill Mines Ltd. and changed its name to International Tower Hill Mines Ltd. in March 1991. International Tower Hill Mines Ltd. was incorporated in 1978 and is headquartered in Vancouver, Canada."}, {"name": "Invesco Advantage Municipal Income Trust II", "sector": "Financial Services", "description": "Invesco Advantage Municipal Income Trust II is a closed-ended fixed income mutual fund launched by Invesco Ltd. The fund is co-managed by Invesco Advisers, Inc, INVESCO Asset Management (Japan) Limited, INVESCO Asset Management Deutschland GmbH, INVESCO Asset Management Limited, Invesco Canada Ltd., Invesco Hong Kong Limited, and INVESCO Senior Secured Management, Inc. It invests in the fixed income markets of the United States. The fund primarily invests in investment grade municipal securities which include municipal bonds, municipal notes, municipal commercial paper, and lease obligations. It employs fundamental analysis with a bottom-up security selection approach to create its portfolio. The fund was formerly known as Invesco Van Kampen Advantage Municipal Income Trust II. Invesco Advantage Municipal Income Trust II was formed on August 27, 1993 and is domiciled in the United States."}, {"name": "Blue Water Vaccines, Inc.", "sector": "Healthcare", "description": "Blue Water Vaccines, Inc., a biotechnology company, engages in the research and development of vaccines to prevent infectious diseases worldwide. The company's lead vaccine programs that are under preclinical development include BWV-101, an influenza vaccine; and BWV-102, a H1 pre-pandemic vaccine. It also has other pipeline under preclinical development comprising BWV-201, a streptococcus pneumoniae induced acute otitis media vaccine program; BWV-301, a norovirus-rotavirus vaccine program; and BWV-302, a norovirus-malaria vaccine program. The company was incorporated in 2018 and is based in Cincinnati, Ohio."}, {"name": "Belong Acquisition Corp.", "sector": "Financial Services", "description": "Belong Acquisition Corp. does not have significant operations. The company intends to effect a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses or entities. It intends to focus its search on companies in technology and tech-enabled businesses in e-commerce, software, and digital media sectors. The company was incorporated in 2020 and is based in Brookline, Massachusetts."}, {"name": "Isoray, Inc.", "sector": "Healthcare", "description": "Isoray, Inc., through its subsidiary, IsoRay Medical, Inc., develops, manufactures, and sells isotope-based medical products and devices for the treatment of cancer and other malignant diseases in the United States and internationally. The company offers CS-1 Cesium-131 brachytherapy seeds for the treatment of prostate, brain, lung, head and neck, gynecological, pelvic/abdominal, and colorectal cancers. It sells its products to facilities or physician practices that utilize various surgical facilities. Isoray, Inc. was founded in 1998 and is based in Richland, Washington."}, {"name": "IDW Media Holdings, Inc.", "sector": "Communication Services", "description": "IDW Media Holdings, Inc., a diversified media company, engages in the publishing and television entertainment businesses worldwide. It operates through IDW Publishing and IDW Entertainment segments. The IDW Publishing segment publishes comic books, graphic novels, and digital content through its imprints IDW, Top Shelf Productions, Artist's Editions, and The Library of American Comics. The IDW Entertainment segment develops, produces, and distributes content in various formats, including film and television. The company was formerly known as CTM Media Holdings, Inc. and changed its name to IDW Media Holdings, Inc. in July 2015. IDW Media Holdings, Inc. was incorporated in 2009 and is headquartered in Newark, New Jersey."}, {"name": "Concord Acquisition Corp II", "sector": "Financial Services", "description": "Concord Acquisition Corp II does not have significant operations. It focuses on effecting a merger, stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses. The company was incorporated in 2021 and is based in New York, New York."}, {"name": "IT Tech Packaging, Inc.", "sector": "Basic Materials", "description": "IT Tech Packaging, Inc., through its subsidiaries, engages in the production and distribution of paper products in the People's Republic of China. The company offers corrugating medium papers to companies making corrugating cardboards; and offset printing papers to printing companies. It also provides tissue paper products, including toilet papers, boxed and soft-packed tissues, handkerchief tissues, and paper napkins, as well as bathroom and kitchen paper towels under the Dongfang Paper brand. In addition, the company produces and sells non-medical single-use face masks, and medical face masks. The company was formerly known as Orient Paper, Inc. and changed its name to IT Tech Packaging, Inc. in August 2018. IT Tech Packaging, Inc. was founded in 1996 and is headquartered in Baoding, the People's' Republic of China."}, {"name": "Imperial Oil Limited", "sector": "Energy", "description": "Imperial Oil Limited engages in exploration, production, and sale of crude oil and natural gas in Canada. The company operates through three segments: Upstream, Downstream and Chemical segments. The Upstream segment explores for, and produces crude oil, natural gas, synthetic oil, and bitumen. As of December 31, 2021, this segment had 386 million oil-equivalent barrels of proved undeveloped reserves. The Downstream segment is involved in the transportation and refining of crude oil, blending of refined products and the distribution, and marketing of refined products. It also transports crude oil to refineries by contracted pipelines, common carrier pipelines, and rail; maintains a distribution system to move petroleum products to market by pipeline, tanker, rail, and road transport; and owns and operates fuel terminals, natural gas liquids, and products pipelines in Alberta, Manitoba, and Ontario. In addition, this segment markets and supplies petroleum products to motoring public through approximately 2,400 Esso and Mobil-branded sites. Further, it sells petroleum products, including fuel, asphalt, and lubricants for industrial and transportation customers, independent marketers, and resellers, as well as other refiners serving the agriculture, residential heating, and commercial markets through branded fuel and lubricant resellers. The Chemical segment manufactures and markets various petrochemicals, benzene, aromatic and aliphatic solvents, plasticizer intermediates, and polyethylene resin. Imperial Oil Limited has a strategic agreement with E3 Metals Corp. to advance a lithium-extraction pilot in Alberta. The company was incorporated in 1880 and is headquartered in Calgary, Canada. Imperial Oil Limited is a subsidiary of Exxon Mobil Corporation."}, {"name": "India Globalization Capital, Inc.", "sector": "Industrials", "description": "India Globalization Capital, Inc. purchases and resells physical infrastructure commodities. It operates through two segments, Infrastructure and Life Sciences. The company rents heavy construction equipment, including motor grader and rollers; and undertakes highway construction contracts. It also develops cannabinoid-based products and therapies, such as hemp-based tinctures to treat anxiety, and enhance the lifestyle of patients suffering from Alzheimer's under the Hyalolex brand name; CBD based tinctures, capsules, and topical analgesic creams to treat pain under the Holief brand name; CBD powered beauty and skincare products under the Herbo brand name; and CBD infused beverages under the Sunday Seltzer brand. The company also engages in the wholesale of hemp extract under the Holi Hemp brand; production of products, such as lotions, creams, and oils, as well as white labeling support services; and extraction and distillation of crude oil into hemp extracts. It operates in the United States, India, Colombia, and Hong Kong. The company was incorporated in 2005 and is headquartered in Potomac, Maryland."}, {"name": "InfuSystem Holdings, Inc.", "sector": "Healthcare", "description": "InfuSystem Holdings, Inc., through its subsidiaries, provides infusion pumps, and related products and services in the United States and Canada. The company operates in two segments, Integrated Therapy Services (ITS) and Durable Medical Equipment Services (DME Services). It supplies electronic ambulatory infusion pumps and associated disposable supply kits to oncology, infusion, and hospital outpatient chemotherapy clinics for the treatment of various cancers, including colorectal cancer, pain management, and other disease states. The company also sells, rents, and leases new and pre-owned pole-mounted and ambulatory infusion pumps, and other durable medical equipment; sells treatment-related consumables; and provides biomedical recertification, maintenance, and repair services for oncology practices, as well as other alternate site settings comprising home care and home infusion providers, skilled nursing facilities, pain centers, hospital market, and others. In addition, it offers local and field-based customer support, as well as operates pump service and repair centers. The company was incorporated in 2005 and is headquartered in Rochester Hills, Michigan."}, {"name": "InspireMD, Inc.", "sector": "Healthcare", "description": "InspireMD, Inc., a medical device company, focuses on the development and commercialization of proprietary MicroNet stent platform technology for the treatment of vascular and coronary diseases in Europe, Latin America, the Middle East, and Asia Pacific. The company offers CGuard carotid embolic prevention system for use in carotid artery applications; and MGuard Prime embolic protection systems for use in patients with acute coronary syndromes, notably acute myocardial infarction, and saphenous vein graft coronary interventions, as well as bypass surgery. It is also developing PVGuard, a MicroNet mesh sleeve and self-expandable stent for use in peripheral vascular applications. The company sells its products through local distributors. InspireMD, Inc. was founded in 2005 and is headquartered in Tel Aviv-Yafo, Israel."}, {"name": "Integra Resources Corp.", "sector": "Basic Materials", "description": "Integra Resources Corp., a mineral resources company, engages in the acquisition, exploration, and development of mineral properties in the Americas. It primarily focuses on the development of DeLamar project that consists of DeLamar and Florida Mountain gold and silver deposits comprising 790 unpatented lode, placer, and millsite claims, as well as 16 tax parcels covering an area of approximately 8,673 hectares located in the Owyhee County, south western Idaho. The company was formerly known as Mag Copper Limited and changed its name to Integra Resources Corp. in August 2017. Integra Resources Corp. was incorporated in 1997 and is headquartered in Vancouver, Canada."}, {"name": "Inuvo, Inc.", "sector": "Communication Services", "description": "Inuvo, Inc., a technology company, develops and sells information technology solutions in the United States. The company's platforms identify and message online audiences for various products or services across devices, formats, and channels, including video, mobile, connected TV, linear TV, display, social, search, and native. Its platforms optimizes the purchase and placement of advertising in real time. The company's products and services include ValidClick that provides marketing and advertising services, as well as collection of data, analytics, software, and publishing gets used to align merchant advertising messages with anonymous consumers across various websites online; and IntentKey, an artificial intelligence-based consumer intent recognition system designed to reach targeted mobile and desktop in-market audiences. It also operates a collection of websites under the Bonfire Publishing brand, which creates content across a range of topics, including health, finance, travel, careers, auto, education, and lifestyle categories. The company's marketing channels consist of websites, social media, blogs, public relations, trade shows, and conferences. Inuvo, Inc. was incorporated in 1987 and is headquartered in Little Rock, Arkansas."}, {"name": "Issuer Direct Corporation", "sector": "Technology", "description": "Issuer Direct Corporation provides shareholder communications and compliance platforms, technologies, and services in the United States and internationally. The company provides Platform id., a platform that manages the events of customers to distribute their messages to constituents, investors, markets, and regulatory systems; whistleblower hotline, which delivers secure notifications and basic incident workflow management processes that align with a company's corporate governance whistleblower policy; proxy module, a real-time voting platform for customers and their shareholders of record; and stock transfer module, a cloud-based platform, which provides access to real-time information about their shareholders, stock ledgers, and reports, as well as issues new shares. It also offers ACCESSWIRE, a news dissemination and media outreach service; and VisualWebcaster Platform, a cloud-based webcast, webinar, and virtual meeting platform that delivers live and on-demand streaming of events to audiences of various sizes, as well as allows customers to create, produce, and deliver events. In addition, the company provides investor relations content network, a series of data feeds, which include news feeds, stock feeds, fundamentals, regulatory filings, corporate governance, and other components; and professional conference and events software, a mobile app that offers organizers, issuers, and investors to register, request, and approve one-on-one meetings, as well as manage schedules, perform event promotion and sponsorship, print attendee badges, and manage lodging. It serves individuals, corporate issuers, public and private companies, law firms, brokerage firms, investment banks, and mutual funds; and professional firms, such as investor relations and public relations firms, as well as the accounting and legal communities. Issuer Direct Corporation was incorporated in 1988 and is headquartered in Raleigh, North Carolina."}, {"name": "KULR Technology Group, Inc.", "sector": "Technology", "description": "KULR Technology Group, Inc., through its subsidiary, KULR Technology Corporation, develops and commercializes thermal management technologies for batteries, electronics, and other components applications in the United States. It offers lithium-ion battery thermal runaway shields; fiber thermal interface materials; phase change material heatsinks; internal short circuit device; KULR battery cell screening and testing automation system and tech safe case; cellcheck; and CRUX cathodes. The company's technologies are used in electric vehicles, energy storage, battery recycling transportation, cloud computing, and 5G communication devices. It sells its products for applications, such as lithium-ion battery energy storage, electric vehicles, 5G communication, cloud computer infrastructure, consumer, and industrial devices. The company was formerly known as KT High-Tech Marketing Inc. and changed its name to KULR Technology Group, Inc. in August 2018. KULR Technology Group, Inc. was founded in 2013 and is based in San Diego, California."}, {"name": "Kelso Technologies Inc.", "sector": "Industrials", "description": "Kelso Technologies Inc. develops, produces, and distributes proprietary equipment used in transportation applications in the United States and Canada. The company offers railway equipment, such as bottom outlet, pressure relief, vacuum relief, and check valves, as well as one-bolt manways, pressure cars, pressure differential parts, tank gauges, laboratory test equipment, and wheel cleaners; emergency response kits; and fueling valves. It also provides trucking components, including one-bolt manways and pressure/vacuum safety valves for tank trailers; and suspension systems for fleet vehicles to access wilderness worksites. The company was formerly known as Kelso Resources Ltd. and changed its name to Kelso Technologies Inc. in July 1994. Kelso Technologies Inc. was incorporated in 1987 and is headquartered in Surrey, Canada."}, {"name": "Kaleyra, Inc.", "sector": "Technology", "description": "Kaleyra Inc., through its subsidiaries, provides mobile communication services to financial institutions, e-commerce players, over the tops (OTTs), software companies, logistic enablers, healthcare providers and retailers, and other organizations. Through its platform and Application Programming Interface (APIs), it manages multi-channel integrated communication services globally consisting of messaging, push notifications, e-mail, voice services, video capabilities, and chatbots. Its technology enables partners to manage billions of messages monthly with 1600 operator connections in 190 countries. Its customer portfolio includes approximately 3800 companies globally. Kaleyra, Inc. was founded in 1999 and is headquartered in Milan, Italy."}, {"name": "The LGL Group, Inc.", "sector": "Technology", "description": "The LGL Group, Inc., together with its subsidiaries, engages in the design, manufacture, and marketing of frequency and spectrum control products in the United States and internationally. The company operates through two segments, Electronic Components and Electronic Instruments. The Electronic Components segment offers clock oscillators, VCXO, TCXO OCXO, and DOCXO devices; and radio frequency, microwave and millimeter wave filters, diplexers, and solid-state power amplifiers. It also provides filter devices, which includes crystal, ceramic, LC, tubular, combline, cavity, interdigital, and metal insert waveguide, as well as digital, analog and mechanical tunable filters, switched filter arrays, and RF subsystems. This segment's products are used in infrastructure equipment for the telecommunications and network equipment industries; and electronic systems for applications in defense, aerospace, earth-orbiting satellites, down-hole drilling, medical devices, instrumentation, industrial devices, and global positioning systems. The Electronic Instruments segment designs and manufactures frequency and time reference standards, distribution amplifiers, redundancy auto switches, and NTP servers for timing and synchronization in various applications. Its products are used in computer networking, satellite ground stations, electric utilities, broadcasting, and telecommunication systems. The company was formerly known as Lynch Corporation and changed its name to The LGL Group, Inc. The LGL Group, Inc. was founded in 1917 and is based in Orlando, Florida."}, {"name": "Laird Superfood, Inc.", "sector": "Consumer Defensive", "description": "Laird Superfood, Inc. manufactures and markets plant-based natural and functional food in the United States. It offers powdered and liquid coffee creamers, and hydration and beverage enhancing supplements; hydrate coconut water products, activate daily jumpstart products, activate prebiotic daily greens, renew plant-based proteins, and performance mushroom supplements; coffee, tea, hot chocolate products; and Pili nuts and Harvest dates. The company provides its products through wholesale channels, its own website, as well as third-party online channels. Laird Superfood, Inc. was incorporated in 2015 and is headquartered in Sisters, Oregon."}, {"name": "Lineage Cell Therapeutics, Inc.", "sector": "Healthcare", "description": "Lineage Cell Therapeutics, Inc., a clinical-stage biotechnology company, develops novel cell therapies for the treatment of degenerative diseases in the United States and internationally. The company develops OpRegen, a retinal pigment epithelium cell replacement therapy, which is in Phase I/IIa clinical trial for the treatment of the dry age-related macular degeneration; OPC1, an oligodendrocyte progenitor cell therapy that is in Phase I/IIa multicenter clinical trial for the treatment of acute spinal cord injuries; and VAC2, an allogeneic cancer immunotherapy of antigen-presenting dendritic cells, which is in Phase I clinical trial to treat non-small cell lung cancer. It also offers Renevia, a facial aesthetics product. In addition, the company engages in the research and development of therapeutic products for retinal diseases, neurological diseases, and disorders and oncology. Lineage Cell Therapeutics, Inc. has a collaboration with Orbit Biomedical, Ltd. The company was formerly known as BioTime, Inc. and changed its name to Lineage Cell Therapeutics, Inc. in August 2019. Lineage Cell Therapeutics, Inc. was incorporated in 1990 and is headquartered in Carlsbad, California."}, {"name": "MAG Silver Corp.", "sector": "Basic Materials", "description": "MAG Silver Corp. engages in the exploration and development of precious metal mining properties. The company explores for silver, gold, lead, and zinc deposits. It primarily holds 44% interest in the Juanicipio project located in the Fresnillo District, Zacatecas State, Mexico. The company is headquartered in Vancouver, Canada."}, {"name": "Matinas BioPharma Holdings, Inc.", "sector": "Healthcare", "description": "Matinas BioPharma Holdings, Inc., a clinical-stage biopharmaceutical company, focuses on the discovery and development of various product candidates. It develops products using its lipid nanocrystal (LNC) platform technology. The company's LNC delivery technology platform utilizes lipid nano-crystals for the delivery of small molecules, nucleic acids, gene therapies, vaccines, proteins, and peptides. Its lead product candidate is LYPDISO, a prescription-only omega-3 free fatty acid-based composition intended for the treatment of cardiovascular and metabolic conditions. The company also offers MAT2203, an oral formulation of amphotericin B that is in Phase II clinical trials for the prevention of invasive fungal infections due to immunosuppressive therapy in patients. In addition, it provides MAT2501, an orally administered formulation of the broad-spectrum aminoglycoside antibiotic amikacin that has completed Phase I clinical trials to treat various types of multidrug-resistant bacteria, including non-tuberculous mycobacterium infections, as well as various multidrug-resistant gram negative and intracellular bacterial infections. Matinas BioPharma Holdings, Inc. has a research collaboration with the National Institute of Allergy and Infectious Diseases for the development of Gilead's antiviral remdesivir; and a feasibility collaboration with Genentech, Inc. for the development of oral formulations. The company was incorporated in 2013 and is based in Bedminster, New Jersey."}, {"name": "Mega Matrix Corp.", "sector": "Industrials", "description": "Mega Matrix Corp., together with its subsidiaries, engages in the GameFi business in the metaverse ecosystem. It also provides aircraft advisory and management services. The company was formerly known as AeroCentury Corp. and changed its name to Mega Matrix Corp. in March 2022. Mega Matrix Corp. was incorporated in 1997 and is headquartered in Palo Alto, California."}, {"name": "Metalla Royalty & Streaming Ltd.", "sector": "Basic Materials", "description": "Metalla Royalty & Streaming Ltd., a precious metals royalty and streaming company, engages in the acquisition and management of precious metal royalties, streams, and related production-based interests in Canada, Australia, Argentina, Mexico, and the United States. It focuses on gold and silver streams and royalties. The company was formerly known as Excalibur Resources Ltd. and changed its name to Metalla Royalty & Streaming Ltd. in December 2016. Metalla Royalty & Streaming Ltd. was incorporated in 1983 and is headquartered in Vancouver, Canada."}, {"name": "Micron Solutions, Inc.", "sector": "Healthcare", "description": "Micron Solutions, Inc. operates as a contract manufacturer for the medical device, defense, and life sciences markets. It offers precision machining, thermoplastic injection molding, mold making products; sensors; orthopedic implants and devices; and diagnostic test kits. The company provides solutions for medical, orthopedics, consumer, and automotive industries. Micron Solutions, Inc. was founded in 1978 and is based in Fitchburg, Massachusetts."}, {"name": "Monument Circle Acquisition Corp.", "sector": "Financial Services", "description": "Monument Circle Acquisition Corp. does not have significant operations. The company focuses on effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses. It intends to focus on businesses in the media, technology, sports and entertainment sectors, and related industries. The company was incorporated in 2020 and is based in Indianapolis, Indiana."}, {"name": "Myomo, Inc.", "sector": "Healthcare", "description": "Myomo, Inc., a wearable medical robotics company, designs, develops, and produces myoelectric orthotics for people with neuromuscular disorders in the United States. The company offers MyoPro, a myoelectric-controlled upper limb brace or orthosis product used for supporting a patient's weak or paralyzed arm to enable and improve functional activities of daily living. Its products are designed to help improve function in adults and adolescents with neuromuscular conditions due to brachial plexus injury, stroke, traumatic brain injury, spinal cord injury, and other neurological disorders. The company sells its products to orthotics and prosthetics providers, the Veterans Health Administration, and rehabilitation hospitals, as well as through distributors. Myomo, Inc. was incorporated in 2004 and is headquartered in Boston, Massachusetts."}, {"name": "The Marygold Companies, Inc.", "sector": "Financial Services", "description": "The Marygold Companies Inc., through its subsidiaries, engages in investment fund management, beauty products, food products, and security alarm systems businesses in the United States, New Zealand, Australia, and Canada. It also operates as an investment advisor to exchange traded funds and exchange traded products organized as limited partnerships or investment trusts. In addition, the company manufactures and distributes meat pies and related bakery confections to groceries, gasoline convenience stores, and independent retailers, as well as prints specialty wrappers for the food industry; and sells and installs commercial and residential alarm monitoring systems under the Brigadier Security Systems and Elite Security names. Further, it engages in the formulation and wholesale distribution of hair and skin care products under the Original Sprout brand to salons, resorts, grocery stores, health food stores, e-tail sites, and online shopping carts. Additionally, the company engages in the development of a Fintech software application to provide an enhanced mobile banking experience. The company was formerly known as Concierge Technologies, Inc. and changed its name to The Marygold Companies Inc. in March 2022. The Marygold Companies Inc. was founded in 1996 and is headquartered in San Clemente, California."}, {"name": "Mastech Digital, Inc.", "sector": "Industrials", "description": "Mastech Digital, Inc., together with its subsidiaries, provides digital transformation IT services to large, medium-sized, and small companies in the United States. It operates through two segments, Data and Analytics Services, and IT Staffing Services. The company offers data management and analytics services, including project-based consulting services in the areas of master data management, enterprise data integration, big data and analytics, and digital transformation by using onsite and offshore resources. It also provides a range of IT staffing services in the areas of data management and analytics, cloud, mobility, social, automation, business intelligence/data warehousing, web services, enterprise resource planning and customer resource management, and e-business solutions. In addition, the company offers digital transformation services, such as digital learning services; and cloud-based enterprise application across sales, marketing, and customer service organizations. It provides its services across various industry verticals, including financial services, government, healthcare, manufacturing, retail, technology, telecommunications, and transportation. The company was formerly known as Mastech Holdings, Inc. and changed its name to Mastech Digital, Inc. in September 2016. Mastech Digital, Inc. was founded in 1986 and is headquartered in Pittsburgh, Pennsylvania."}, {"name": "Maverix Metals Inc.", "sector": "Basic Materials", "description": "Maverix Metals Inc., together with its subsidiaries, operates as a precious metals royalty and streaming company in Canada. The company explores for gold, silver, lead, zinc, copper, nickel, and other metals. It has a portfolio of over 100 royalties and streams in the Americas and Australia. The company was incorporated in 2016 and is headquartered in Vancouver, Canada."}, {"name": "Mexco Energy Corporation", "sector": "Energy", "description": "Mexco Energy Corporation, an independent oil and gas company, engages in the acquisition, exploration, development, and production of natural gas, crude oil, condensate, and natural gas liquids in the United States. It owns partial interests in approximately 6,300 gross producing wells located in the states of Texas, New Mexico, Oklahoma, Louisiana, Alabama, Mississippi, Arkansas, Wyoming, Kansas, Colorado, Montana, Virginia, North Dakota, and Ohio. As of March 31, 2022, the company's total estimated proved reserves were approximately 1.616 million barrels of oil equivalent. It also owned leasehold mineral, royalty, and other interests in approximately 2,970 net acres. The company was formerly known as Miller Oil Company and changed its name to Mexco Energy Corporation in April 1980. Mexco Energy Corporation was incorporated in 1972 and is based in Midland, Texas."}, {"name": "Milestone Scientific Inc.", "sector": "Healthcare", "description": "Milestone Scientific Inc. designs, develops, and commercializes diagnostic and therapeutic injection technologies, and devices for medical, dental, and cosmetic use in the United States, China, and internationally. The company operates in two segments, Dental and Medical. Its products include CompuDent and STA Single Tooth Anesthesia System that are used for all dental procedures that require local anesthetic. The company also offers CompuFlo, a computer-controlled drug delivery system for the painless delivery of drugs, anesthetics, and other medicaments, as well as for the aspiration of bodily fluids or previously injected substances; and disposable injection handpiece for the tactile control during the injection. In addition, it provides CompuFlo Epidural, a computer controlled anesthesia system for use in various medical applications. Further, the company offers CompuMed for use in various medical procedures performed in plastic, hair restoration, and colorectal surgery, as well as podiatry, dermatology, orthopedics, and various other disciplines. Milestone Scientific Inc. was incorporated in 1989 and is headquartered in Livingston, New Jersey."}, {"name": "Moving iMage Technologies, Inc.", "sector": "Technology", "description": "Moving iMage Technologies, Inc., a digital cinema company, designs, manufactures, integrates, installs, and distributes proprietary and custom designed equipment, and other off the shelf cinema products for cinema requirements in the United States and internationally. Its products and services focus on the integration needs associated with the building, modernization, and equipping of motion picture exhibition theatres. The company provides automation systems for digital cinema applications; proprietary rack mount pedestals; in-house designed and assembled suite of products to support boothless theatre designs and alternative auditorium configurations; and in-house designed and assembled lighting products and dimmers, as well as distributes digital cinema projectors and servers. It also offers premium sound systems and enclosures; demand controlled ventilation systems that automatically shuts down projector exhaust fans; and reclining seats and armrests, concession tables and trays, tablet arms, cup holders, and step and aisle lighting products for theaters and other public venues. In addition, the company provides software solutions, such as CineQC, a cinema presence management and remote-control system. Further, it offers custom engineering, systems design, integration and installation, and digital technology services, as well as software solutions for 3D, digital cinema, and audio visual integration; project management and systems design services for theatre upgrades and new theatre builds; furniture, fixture, and equipment services to commercial cinema exhibitors for new construction and remodels; and cinema equipment installations and after-sale maintenance services. The company was founded in 2003 and is based in Fountain Valley, California."}, {"name": "NanoViricides, Inc.", "sector": "Healthcare", "description": "NanoViricides, Inc., a nano-biopharmaceutical research and development company, discovers, develops, and commercializes drugs for the treatment of viral infections. The company develops Human Coronavirus Program for COVID-19 seasonal coronavirus affliction; HerpeCide Dermal Topical and Eye Drops for the treatment of shingles, PHN, chickenpox, herpes, recurrent herpes labialis, genital herpes, and ocular herpes keratitis; and HerpeCide IntraOcular Injection for viral acute retinal necrosis The company also develops FluCide Broad-Spectrum Anti-Influenza nanoviricide, which is injectable for hospitalized patients and oral for outpatients; Nanoviricide eye drops for viral diseases of the external eye; DengueCide for treatment of various types of Dengue viruses; and HIVCide, an escape-resistant anti-HIV nanoviricide. In addition, it develops other nanoviricides drug projects for treatment of different viruses and indications; and HerpeCide program expansion drug projects for different herpes viruses for different indications. NanoViricides, Inc. was founded in 2005 and is based in Shelton, Connecticut."}, {"name": "National HealthCare Corporation", "sector": "Healthcare", "description": "National HealthCare Corporation operates, manages, and provides services to skilled nursing facilities, assisted living facilities, independent living facilities, homecare and hospice agencies, and a behavioral health hospital. Its skilled nursing facilities offer licensed therapy services, nutrition services, social services, activities, and housekeeping and laundry services, as well as medical services prescribed by physicians; and rehabilitative services, such as physical, speech, respiratory, and occupational therapy for patients recovering from strokes, heart attacks, orthopedic conditions, neurological illnesses, or other illnesses, injuries, or disabilities. The company's medical specialty units comprise memory care units and sub-cute nursing units that provide specialized care and programs for persons with Alzheimer's or related disorders; and assisted living centers offer personal care services and assistance with general activities of daily living, such as dressing, bathing, meal preparation, and medication management. It also offers behavioral health services to both adults and geriatric patients with psychiatric, emotional, and addictive disorders. In addition, it provides health care programs that offer skilled services, such as infusion, wound care and physical, occupational, and speech therapies; hospice care services; operates pharmacies; offers management, accounting, financial, and insurance services; and leases its properties to third party operators. As of February 18, 2022, the company operated 75 skilled nursing facilities with 9,473 beds, 24 assisted living facilities, five independent living facilities, one behavioral health hospital, 34 homecare agencies, and 28 hospice agencies. National HealthCare Corporation was founded in 1971 and is based in Murfreesboro, Tennessee."}, {"name": "Network-1 Technologies, Inc.", "sector": "Industrials", "description": "Network-1 Technologies, Inc. develops, licenses, and protects intellectual property assets. The company owns 95 patents, including the Cox patent portfolio relating to enabling technology for identifying media content on the Internet; M2M/IoT patent portfolio related to enabling technology for authenticating, provisioning, and using embedded sim cards in next generation IoT, machine-to-machine, and other mobile devices, including smartphones, tablets, and computers; and HFT patent portfolio covering technologies relating to high frequency trading that addresses technological problems associated with speed and latency, and provide critical latency gains in trading systems. Its patents also comprise the Mirror Worlds patent portfolio relating to foundational technologies that enable unified search and indexing, displaying, and archiving of documents in a computer system; and the remote power patent covering the delivery of power over Ethernet cables for the purpose of remotely powering network devices, such as wireless access ports, IP phones, and network-based cameras. The company was formerly known as Network-1 Security Solutions, Inc. and changed its name to Network-1 Technologies, Inc. in October 2013. Network-1 Technologies, Inc. was incorporated in 1990 and is headquartered in New Canaan, Connecticut."}, {"name": "Neuberger Berman High Yield Strategies Fund Inc.", "sector": "Financial Services", "description": "Neuberger Berman High Yield Strategies Fund Inc. is a closed-ended fixed income mutual fund launched by Neuberger Berman LLC. The fund is managed by Neuberger Berman Investment Advisers LLC. It invests in fixed income markets across the globe. The fund typically invests in high yield debt securities of various sectors, such as auto parts and equipment, airlines, automotive, electronics, health services, packaging, telecom-integrated/services, gaming, and gas distribution. It was formerly known as Neuberger Berman High Yield Strategies Fund. Neuberger Berman High Yield Strategies Fund Inc. was formed on July 28, 2003 and is domiciled in the United States."}, {"name": "Neuberger Berman Municipal Fund Inc.", "sector": "Financial Services", "description": "Neuberger Berman Intermediate Municipal Fund Inc. is a closed-ended fixed income mutual fund launched and managed by Neuberger Berman LLC. The fund is co-managed by Neuberger Berman Management LLC. It invests in the fixed income markets of the United States. The fund primarily invests in municipal bonds which have income that is exempt from federal income tax and have remaining maturities of less than 15 years. It seeks to invest in securities rated in the four highest categories by a nationally recognized statistical rating organization. The fund seeks to maintain a weighted average duration of between three and eight years. Neuberger Berman Intermediate Municipal Fund Inc. was formed on July 29, 2002 and is domiciled in the United States."}, {"name": "Neuberger Berman Real Estate Securities Income Fund Inc.", "sector": "Financial Services", "description": "Neuberger Berman Real Estate Securities Income Fund, Inc. is a closed-ended equity mutual fund launched and managed by Neuberger Berman LLC. It is co-managed by Neuberger Berman Management LLC. The fund invests in the public equity markets of the United States. It typically invests in stocks of companies operating in the real estate sector including real estate investment trusts. The fund invests in growth stocks of companies operating across all market capitalizations. It employs a fundamental analysis including direct real estate analysis, on-site real estate analysis, and frequent meetings with company management to make its investments. The fund benchmarks the performance of its portfolio against the NAREIT Equity Index and S&P 500 Index. Neuberger Berman Real Estate Securities Income Fund, Inc was formed on October 28, 2003 and is domiciled in the United States."}, {"name": "New Concept Energy, Inc.", "sector": "Real Estate", "description": "New Concept Energy, Inc. engages in real estate rental business. The company owns approximately 190 acres of land located in Parkersburg West Virginia. It also provides advisory and management services for an independent oil and gas company. The company was formerly known as CabelTel International Corporation and changed its name to New Concept Energy, Inc. in May 2008. New Concept Energy, Inc. was founded in 1978 and is based in Dallas, Texas. New Concept Energy, Inc. is a former subsidiary of Arcadian Energy, Inc."}, {"name": "New Found Gold Corp.", "sector": "Basic Materials", "description": "New Found Gold Corp., a mineral exploration company, engages in the identification, acquisition, and exploration of mineral properties in the Provinces of Newfoundland and Labrador, and Ontario. The company primarily explores for gold deposit. It holds 100% interests in the Queensway project that includes 86 mineral licenses and 6,041 claims covering an area of 151,030 hectares of land located near Gander, Newfoundland; and the Lucky Strike project comprising 11,684 hectares located in Kirkland Lake, Ontario. The company was formerly known as Palisade Resources Corp. and changed its name to New Found Gold Corp. in June 2017. New Found Gold Corp. was incorporated in 2016 and is headquartered in Vancouver, Canada."}, {"name": "New Pacific Metals Corp.", "sector": "Basic Materials", "description": "New Pacific Metals Corp., together with its subsidiaries, engages in the exploration and development of mineral properties in Bolivia and Canada. It explores for silver, gold, lead, and zinc deposits. The company's flagship property is the Silver Sand property, which cover an area of 5.42 square kilometers located in the Potosí Department, Bolivia. It also owns Silverstrike property located in southwest of La Paz, Bolivia; and Carangas property located in La Ruta de la Plata. The company was formerly known as New Pacific Holdings Corp. and changed its name to New Pacific Metals Corp. in July 2017. New Pacific Metals Corp. is headquartered in Vancouver, Canada."}, {"name": "NightHawk Biosciences, Inc.", "sector": "Healthcare", "description": "NightHawk Biosciences, Inc., an integrated biopharmaceutical company, engages in the development of immune therapies and vaccines. The company's therapies are used to modulate the immune system against various diseases, including cancer and infectious diseases. Its gp96 platform, including ImPACT, an allogenic cell-based, T-cell-stimulating platform that functions as an immune activator to stimulate and expand T-cells; and ComPACT, which delivers antigen driven T-cell activation and specific co-stimulation in a single product. The company develops HS-110, which has completed enrollment in a Phase II clinical trial to treat patients with advanced non-small cell lung cancer; and HS-130 that is in Phase I clinical trial for the treatment of advanced solid tumors. Its products also include PTX-35, a novel T-cell co-stimulator agonist antibody targeting DR3/TNFRSF25 that is in Phase I clinical trial; DR3/TNFRSF25 for various immunotherapy approaches; and COVID-19 vaccine, which is in preclinical stage. The company has a collaboration with Dr. James Shapiro at University of Alberta to manufacture surrogate mouse version of PTX-35. The company was formerly known as Heat Biologics, Inc. and changed its name to NightHawk Biosciences, Inc. in May 2022. NightHawk Biosciences, Inc. was incorporated in 2008 and is headquartered in Morrisville, North Carolina."}, {"name": "Northern Dynasty Minerals Ltd.", "sector": "Basic Materials", "description": "Northern Dynasty Minerals Ltd. engages in the exploration of mineral properties in the United States. Its principal mineral property is the Pebble Copper-Gold-Molybdenum-Silver-Rhenium project comprising 1,840 mineral claims that covers an area of approximately 274 square miles located in southwest Alaska, 17 miles from the villages of Iliamna and Newhalen, and approximately 200 miles southwest of the city of Anchorage. The company was formerly known as Northern Dynasty Explorations Ltd. and changed its name to Northern Dynasty Minerals Ltd. in October 1997. Northern Dynasty Minerals Ltd. was incorporated in 1983 and is headquartered in Vancouver, Canada."}, {"name": "NovaBay Pharmaceuticals, Inc.", "sector": "Healthcare", "description": "NovaBay Pharmaceuticals, Inc., a pharmaceutical company, develops and sells eyecare and skincare products in the United States and internationally. It offers Avenova, a solution for removing foreign materials, including microorganisms and debris from skin around the eye, such as the eyelid; and wound care products under the NeutroPhase and PhaseOne brands. The company also provides dermatological solutions to address skincare concerns comprising keratosis pilaris, rosacea and eczema, anti-aging, SPF, hyperhidrosis, excessive hair, and acne under the DERMAdoctor brand. It sells its products through retailers, digital beauty channels, and distributors, as well as online. The company was formerly known as NovaCal Pharmaceuticals, Inc. and changed its name to NovaBay Pharmaceuticals, Inc. in February 2007. NovaBay Pharmaceuticals, Inc. was incorporated in 2000 and is headquartered in Emeryville, California."}, {"name": "NovaGold Resources Inc.", "sector": "Basic Materials", "description": "NovaGold Resources Inc. explores for and develops gold mineral properties in the United States. Its principal asset is the Donlin Gold project consisting of 493 mining claims covering an area of approximately 29,008 hectares located in the Kuskokwim region of southwestern Alaska. The company was formerly known as NovaCan Mining Resources (1985) Limited and changed its name to NovaGold Resources Inc. in March 1987. NovaGold Resources Inc. was incorporated in 1984 and is based in Vancouver, Canada."}, {"name": "Navidea Biopharmaceuticals, Inc.", "sector": "Healthcare", "description": "Navidea Biopharmaceuticals, Inc., a biopharmaceutical company, focuses on the development and commercialization of precision immunodiagnostic agents and immunotherapeutics. It operates through two segments, Diagnostic Substances and Therapeutic Development Programs. The company develops Manocept platform to target the CD206 mannose receptor expressed on activated macrophages for a range of diagnostic modalities, including single photon emission computed tomography, positron emission tomography (PET), gamma-scanning, and intra-operative and/or optical-fluorescence detection, as well as delivery of therapeutic compounds that target macrophages, and immune-and inflammation-involved diseases. It develops NAV3-31, which has completed Phase IIb clinical trials for evaluating imaging repeatability, reproducibility, and stability, as well as the capacity of Tc99m tilmanocept imaging for treatment of anti-tumor necrosis factor alpha therapy in patients with moderate to severe rheumatoid arthritis (RA); NAV3-35 that is in a Phase IIb clinical trial for RA imaging; NAV3-33, which is in Phase III clinical trial for RA; and NAV3-32, which is Phase 2b trial for RA-involved joints. The company is also developing Tc99m tilmanocept for cardiovascular, kaposi's sarcoma, tuberculosis, and other immunotherapeutic applications. The company was formerly known as Neoprobe Corporation and changed its name to Navidea Biopharmaceuticals, Inc. in January 2012. Navidea Biopharmaceuticals, Inc. was incorporated in 1983 and is headquartered in Dublin, Ohio."}, {"name": "Neuberger Berman California Municipal Fund Inc.", "sector": "Financial Services", "description": "Neuberger Berman California Intermediate Municipal Fund Inc. is a closed-ended fixed income mutual fund launched and managed by Neuberger Berman LLC. The fund is co-managed by Neuberger Berman Management LLC. It invests in the fixed income markets of the United States. The fund primarily invests in municipal bonds which have income that is exempt from federal income tax and California state personal tax. It invests in securities with remaining maturities of less than 15 years. The fund seeks to maintain a weighted average duration of between three and eight years. It invests in securities rated in the four highest categories by a nationally recognized statistical rating organization. Neuberger Berman California Intermediate Municipal Fund Inc. was formed on July 29, 2002 and is domiciled in the United States."}, {"name": "Neuberger Berman MLP and Energy Income Fund Inc.", "sector": "Financial Services", "description": "Neuberger Berman MLP and Energy Income Fund Inc. is a closed ended fund of fund launched and managed by Neuberger Berman Management LLC. It is co-managed by Neuberger Berman LLC. The fund invests in the public equity markets. It primarily invests in master limited partnerships and limited liability companies. It was formerly known as Neuberger Berman MLP Income Fund Inc. Neuberger Berman MLP and Energy Income Fund Inc. was formed on November 16, 2012 and is domiciled in the United States."}, {"name": "Neuberger Berman New York Municipal Fund, Inc.", "sector": "Financial Services", "description": "Neuberger Berman New York Municipal Fund, Inc. is a closed-ended fixed income mutual fund launched and managed by Neuberger Berman Management LLC. The fund is co-managed by Neuberger Berman LLC. It invests in the fixed income markets of the United States. The fund primarily invests in tax-exempt municipal bonds with remaining maturities of less than 15 years. It seeks to invest in securities that are rated in the four highest categories by a statistical rating organization. The fund benchmarks the performance of its portfolio against the Barclays 10-Year Municipal Bond Index. It was formerly known as Neuberger Berman California Intermediate Municipal Fund Inc. Neuberger Berman New York Municipal Fund, Inc. was formed on September 24, 2002 and is domiciled in the United States."}, {"name": "New England Realty Associates Limited Partnership", "sector": "Real Estate", "description": "New England Realty Associates Limited Partnership engages in acquiring, developing, holding for investment, operating, and selling real estate properties in the United States. It owns and operates various residential apartments, condominium units, and commercial properties located in Massachusetts and New Hampshire. As of February 1, 2022, the company owned 2,892 residential apartment units in 25 residential and mixed-use complexes, and 19 condominium units in a residential condominium complex located primarily in the metropolitan Boston area of Massachusetts. In addition, it owned a commercial shopping center in Framingham, Massachusetts; one commercial building in Newton and one in Brookline, Massachusetts; commercial space in mixed-use buildings in Boston, Brockton and Newton, and Massachusetts; and 40% to 50% ownership interest in seven residential and mixed use complexes with a total of 688 residential units, one commercial unit, and a 50 car parking lot. NewReal, Inc. serves as the general partner of the company. New England Realty Associates Limited Partnership was incorporated in 1977 and is headquartered in Allston, Massachusetts."}, {"name": "New Gold Inc.", "sector": "Basic Materials", "description": "New Gold Inc., an intermediate gold mining company, engages in the exploration, development, and operation of mineral properties. It primarily explores for gold, silver, and copper deposits. The company's principal operating properties include 100% interests in the Rainy River mine located in Ontario, Canada; and New Afton mine situated in British Columbia, Canada. It also operates the Cerro San Pedro mine in San Luis Potosí, Mexico. The company was incorporated in 1980 and is headquartered in Toronto, Canada."}, {"name": "NexGen Energy Ltd.", "sector": "Energy", "description": "NexGen Energy Ltd., an exploration and development stage company, engages in the acquisition, exploration, and evaluation and development of uranium properties in Canada. Its principal asset is the Rook I project comprising 32 contiguous mineral claims totaling an area of 35,065 hectares located in the southwestern Athabasca Basin of Saskatchewan. The company is headquartered in Vancouver, Canada."}, {"name": "Cue Health Inc.", "sector": "Healthcare", "description": "Cue Health Inc., a healthcare technology company, designs and develops diagnostic platform for diagnostic tests for individuals, enterprises, healthcare providers and payors, and public health agencies. The company offers Cue Integrated Care platform comprising hardware and software components, such as Cue Health Monitoring System consisting of Cue Reader, a portable and reusable reader, Cue Cartridge, a single-use test cartridge, and Cue Wand, a sample collection wand; Cue Data and Innovation Layer, a solution with cloud-based data and analytics capability; Cue Virtual Care Delivery Apps, which include Cue Health App and Cue Enterprise Dashboard; and Cue Ecosystem Integrations and Apps, a solution that allows integrations with third-party applications and sensors. It also provides COVID-19 testing kits for the Cue Health Monitoring System The company was formerly known as Cue Inc and changed its name to Cue Health Inc. in December 2017. Cue Health Inc. was incorporated in 2010 and is headquartered in San Diego, California."}, {"name": "Northern Oil and Gas, Inc.", "sector": "Energy", "description": "Northern Oil and Gas, Inc., an independent energy company, engages in the acquisition, exploration, exploitation, development, and production of crude oil and natural gas properties in the United States. The company primarily holds interests in the Williston Basin, the Appalachian Basin, and the Permian Basin in the United States. As of December 31, 2021, it owned working interests in 7,436 gross producing wells; and had proved reserves of 287,682 million barrels of oil equivalent. The company is based in Minnetonka, Minnesota."}, {"name": "Novonix Limited", "sector": "Industrials", "description": "Novonix Limited develops and supplies battery materials, equipment, and services to the lithium-ion battery market in North America. It operates through three segments: Graphite Exploration and Mining, Battery Technology, and Battery Materials. The Graphite Exploration and Mining segment explores for graphite in Australia. The Battery Technology segment develops battery cell testing equipment and batteries, and consulting services. The Battery Materials segment develops and manufactures battery anode materials. The company is also involved in the investment and battery testing activities. Novonix Limited has strategic alliance with Harper International Corporation to develop specialized furnace technology that would enhance Novonix's synthetic graphite manufacturing process; and partnership with Emera Technologies to develop and manufacture energy storage systems for community microgrids. The company was formerly known as Graphitecorp Limited and changed its name to Novonix Limited in July 2017. Novonix Limited was incorporated in 2012 and is headquartered in Brisbane, Australia."}, {"name": "Oblong, Inc.", "sector": "Technology", "description": "Oblong Inc., together with its subsidiaries, provides multi-stream collaboration technologies and managed services for video collaboration and network applications in the United States and internationally. The company operates in two segments, Collaboration Products and Managed Services. Its flagship product is Mezzanine that enables visual collaboration across multi-users, multi-screens, multi-devices, and multi-locations for video telepresence, laptop and application sharing, and whiteboard sharing and slides applications. The company also provides managed videoconferencing services; and remote service management, which provides an overlay to enterprise information technology and channel partner support organizations, as well as support and management services for customer video environments. In addition, it offers network services comprising Cloud Connect: Video that allows its customers to outsource the management of their video traffic to them and provides the customer's office locations with a secure, dedicated video network connection to the Oblong Cloud for video communications; Cloud Connect: Converge, which offers customized multiprotocol label switching solutions; and Cloud Connect: Cross Connect that allows the customer to leverage existing carrier for the extension of a Layer 2 private line to its data center. Further, it provides professional services, such as software development, visual and interaction design, engineering, and project support services; and resells video equipment to its customers. Oblong Inc. is based in Conifer, Colorado."}, {"name": "Ocean Power Technologies, Inc.", "sector": "Industrials", "description": "Ocean Power Technologies, Inc. develops and commercializes proprietary systems that generate electricity by harnessing the renewable energy of ocean waves in North America, South America, Europe, and Asia. It offers PB3 PowerBuoy system that generates power for use independent of the power grid in offshore locations. The company also provides hybrid PowerBuoy products; subsea battery systems; and software, controls, sensors, integration services, and marine installation services. In addition, it offers distributed offshore power and communications for remote surface and subsea applications in markets, such as defense and security, offshore oil and gas, science and research, and offshore wind. Further, the company provides Wave Adaptive Modular Vessel (WAM-V) technology, which enables roaming capabilities for uncrewed maritime systems in waters; leases WAM-V robotics and access information; maritime domain awareness solutions; and strategic consulting services. Additionally, it offers offshore data collection, integration, analytics, and real time communication for various applications. The company serves public and private entities, and agencies that require remote offshore power. Ocean Power Technologies, Inc. was incorporated in 1984 and is headquartered in Monroe Township, New Jersey."}, {"name": "Ondas Holdings Inc.", "sector": "Technology", "description": "Ondas Holdings Inc., through its subsidiaries, provides private wireless, drone, and automated data solutions. The company operates in two segments, Ondas Networks and American Robotics. The company designs, develops, manufactures, sells, and supports FullMAX, a software defined radio (SDR) platform for wide-area broadband networks. Its FullMAX SDR platform enables secure and reliable industrial-grade connectivity for truly mission-critical applications. The company also offers Scout Drone, an AI-powered drone with imaging payloads; the ScoutBase, a ruggedized base station for housing, charging, data processing, and cloud transfer; and ScoutView, an American robotics analytics and user interface software package. It serves users in rail, energy, mining, agriculture, and critical infrastructure markets in the United States and internationally. The company is headquartered in Waltham, Massachusetts."}, {"name": "Obsidian Energy Ltd.", "sector": "Energy", "description": "Obsidian Energy Ltd. primarily focuses on the exploration, production, and development of oil and natural gas properties in the Western Canada Sedimentary Basin. The company was formerly known as Penn West Petroleum Ltd. and changed its name to Obsidian Energy Ltd. in June 2017. Obsidian Energy Ltd. is headquartered in Calgary, Canada."}, {"name": "OncoCyte Corporation", "sector": "Healthcare", "description": "OncoCyte Corporation, a molecular diagnostics company, researches, develops, and commercializes proprietary laboratory-developed tests for the detection of cancer in the United States and internationally. The company offers DetermaRx, a molecular test for early-stage adenocarcinoma of the lung; and DetermaIO, a proprietary gene expression assay. It also provides biomarker discovery testing, assay design and development, and clinical trial support services, as well as various biomarker tests for pharmaceutical companies. The company has a collaboration agreement with Life Technologies Corporation to develop and collaborate in the commercialization of Oncomine Comprehensive Assay Plus and Determa IO assay for use with Ion Torrent Genexus integrated sequencer and purification system. OncoCyte Corporation was incorporated in 2009 and is based in Irvine, California."}, {"name": "Oragenics, Inc.", "sector": "Healthcare", "description": "Oragenics, Inc. develops antibiotics for infectious diseases in the United States. The company engages in the development and commercialization of NT-CoV2-1, an intranasal vaccine candidate that provides immunity from the novel severe acute respiratory syndrome coronavirus; and Terra CoV-2, an intramuscular vaccine candidate that provides immunity from the novel severe acute respiratory syndrome coronavirus. The company's product candidates also comprise LPT3-04, a weight loss candidate; and SMaRT Replacement Therapy, a topical treatment to prevent dental carries. It has a license agreement with Noachis Terra Inc. for licensing of certain specified patent rights and biological materials relating to the use of pre-fusion coronavirus spike proteins; and a collaboration agreement with Precigen, Inc. and ILH Holdings, Inc. for the development and commercialization of MU1140 and related homologs. The company was formerly known as Oragen, Inc. Oragenics, Inc. was incorporated in 1996 and is headquartered in Tampa, Florida."}, {"name": "Orla Mining Ltd.", "sector": "Basic Materials", "description": "Orla Mining Ltd. acquires, explores for, and develops mineral properties. The company explores for gold, silver, zinc, lead, and copper deposits. It owns 100% interests in the Camino Rojo project that consists of seven concessions covering an area of 163,129 hectares located in Zacatecas, Mexico; and Cerro Quema project totaling an area of 14,800 hectares located in the Azuero Peninsula, Panama. The company was formerly known as Red Mile Minerals Corp. and changed its name to Orla Mining Ltd. in June 2015. Orla Mining Ltd. was incorporated in 2007 and is headquartered in Vancouver, Canada."}, {"name": "PARTS iD, Inc.", "sector": "Consumer Cyclical", "description": "PARTS iD, Inc., a digital commerce company, primarily sells automotive parts and accessories through its proprietary platforms. The company offers automobile accessories, wheels and tires, performance parts, and lighting and repair parts, as well as parts and accessories for semi-trucks, motorcycles, powersports, RVs/campers, boats, outdoor sports and camping gear, and tools. It sells private label and branded products through various platforms, including www.carid.com, www.truckid.com, www.motorcycleid.com, www.powersportsid.com, www.camperid.com, www.boatid.com, www.recreationid.com, and www.toolsid.com. The company was founded in 2008 and is based in Cranbury, New Jersey."}, {"name": "Palatin Technologies, Inc.", "sector": "Healthcare", "description": "Palatin Technologies, Inc., a biopharmaceutical company, develops targeted receptor-specific therapeutics for the treatment of various diseases in the United States. The company's lead product is Vyleesi, a melanocortin receptor (MCr) agonist for the treatment of premenopausal women with hypoactive sexual desire disorder. It is also developing oral PL8177, a selective MC1r agonist peptide that has completed Phase I clinical trial for the treatment of inflammatory bowel diseases. In addition, the company engages in the development of PL9643, a peptide melanocortin agonist active at multiple MCrs, including MC1r and MC5r for anti-inflammatory ocular indications, such as dry eye disease; and melanocortin peptides for diabetic retinopathy. Further, it is developing PL3994, a natriuretic peptide receptor (NPR)-A agonist and synthetic mimetic of the endogenous neuropeptide hormone atrial natriuretic peptide for cardiovascular indications; and PL5028, an NPR-A and NPR-binder to treat cardiovascular and fibrotic diseases, including reducing cardiac hypertrophy and fibrosis. The company was incorporated in 1986 and is based in Cranbury, New Jersey."}, {"name": "Park National Corporation", "sector": "Financial Services", "description": "Park National Corporation operates as the bank holding company for Park National Bank that provides commercial banking and trust services in small and medium population areas. The company offers deposits for demand, savings, and time accounts; trust and wealth management services; cash management services; safe deposit operations; electronic funds transfers; Internet and mobile banking solutions with bill pay service; credit cards; and various additional banking-related services for individual customers. It also provides commercial loans, including financing for industrial and commercial properties, financing for equipment, inventory and accounts receivable, acquisition financing, and commercial leasing, as well as for consumer finance companies; commercial real estate loans comprising mortgage loans to developers and owners of commercial real estate; consumer loans, such as automobile loans and leases; consumer finance services; home equity lines of credit; and residential real estate and construction loans, as well as installment loans and commercial loans. In addition, the company offers aircraft financing and asset management services. As of December 31, 2021, it operated 96 financial service offices and a network of 116 automated teller machines in 26 Ohio counties, 1 Kentucky county, 3 North Carolina counties, and 4 South Carolina counties. The company was founded in 1908 and is headquartered in Newark, Ohio."}, {"name": "Pioneer Diversified High Income Fund, Inc.", "sector": "Financial Services", "description": "Pioneer Diversified High Income Fund, Inc. is a closed ended fixed income mutual fund launched and managed by Pioneer Investment Management, Inc. It invests in the fixed income markets across the globe. The fund seeks to invest in higher yielding asset classes, including high yield bonds, leveraged bank loans, and event-linked bonds .It employs a combination of fundamental and quantitative analysis to create its portfolio. The fund benchmarks the performance of its portfolio against a composite benchmark comprising of 50% Bank of America Merrill Lynch Global High Yield, Emerging Markets Plus Index and 50% the Credit Suisse Leveraged Loan Index. Pioneer Diversified High Income Fund, Inc. was formed on January 30, 2007 and is domiciled in the United States."}, {"name": "Platinum Group Metals Ltd.", "sector": "Basic Materials", "description": "Platinum Group Metals Ltd. engages in the exploration and development of platinum and palladium properties. It explores for palladium, platinum, gold, copper, nickel, and rhodium deposits. The company holds 50.02% interest in the Waterberg project located on the Northern Limb of the Western Bushveld complex, South Africa. It also develops next-generation battery technology using platinum and palladium. Platinum Group Metals Ltd. was incorporated in 2000 and is headquartered in Vancouver, Canada."}, {"name": "PolyMet Mining Corp.", "sector": "Basic Materials", "description": "PolyMet Mining Corp., through its subsidiary, Poly Met Mining, Inc., engages in the exploration and development of natural resource properties. Its primary mineral property is the NorthMet project, a polymetallic project that hosts copper, nickel, cobalt, gold, silver, and platinum group metal mineralization covering an area of approximately 4,300 acres located in northeastern Minnesota, the United States. The company was formerly known as Fleck Resources Ltd. and changed its name to PolyMet Mining Corp. in June 1998. PolyMet Mining Corp. was incorporated in 1981 and is headquartered in Saint Paul, Minnesota."}, {"name": "Future Science Holdings Inc.", "sector": "Financial Services", "description": "Future Science Holdings Inc. does not have significant operations. Previously, the company was engaged in the exploration and development of titanium deposits or reserves in Chile. Future Science Holdings Inc. was incorporated in 1998 and is headquartered in Santiago, Chile."}, {"name": "PEDEVCO Corp.", "sector": "Energy", "description": "PEDEVCO Corp., an oil and gas company, focuses on the acquisition, development, and production of oil and natural gas assets in the United States. As of December 31, 2021, the company held approximately 32,870 net Permian Basin acres located in Chaves and Roosevelt Counties, New Mexico; and approximately 11,580 net Denver-Julesberg (D-J) Basin acres located in Weld and Morgan Counties, Colorado. It had interests in 385 net wells in Permian Basin Asset; and 78 net wells in (D-J) Basin Asset. The company is headquartered in Houston, Texas. PEDEVCO Corp. is a subsidiary of SK Energy LLC."}, {"name": "Paramount Gold Nevada Corp.", "sector": "Basic Materials", "description": "Paramount Gold Nevada Corp., together with its subsidiaries, engages in the acquisition, exploration, and development of precious metal properties in the United States. The company primarily explores for gold and silver ores. It holds principal interest in the Sleeper gold project with 2,322 unpatented mining claims totaling approximately 38,300 acres located in Humbolt County, Nevada. The company also holds 100% interest in the Grassy Mountain gold project with 442 federal mining claims and 3 patented lode claims covering approximately 9,300 acres located in Malheur County, Oregon. Paramount Gold Nevada Corp. was founded in 1992 and is headquartered in Winnemucca, Nevada."}, {"name": "Planet Green Holdings Corp.", "sector": "Consumer Defensive", "description": "Planet Green Holdings Corp., through its subsidiaries, grows, manufactures, and distributes brick, black, and green tea products in China and internationally. It also imports and distributes beef products; and engages in the research, development, manufacture, and sale of chemical products, including formaldehyde, urea formaldehyde adhesive, methylal, ethanol fuel, fuel additives, and clean fuel. In addition, the company researches, develops, and manufactures skid-mounted refueling and LNG cryogenic equipment, as well as oil storage tanks. Further, it operates an online demand-side platform, a system that allows buyers of digital advertising inventory to manage multiple advertisement exchange and data exchange. The company was formerly known as American Lorain Corporation and changed its name to Planet Green Holdings Corp. in September 2018. Planet Green Holdings Corp. was incorporated in 1986 and is headquartered in Flushing, New York."}, {"name": "Plymouth Industrial REIT, Inc.", "sector": "Real Estate", "description": "Plymouth Industrial REIT, Inc. is a vertically integrated and self-managed real estate investment trust focused on the acquisition and operation of single and multi-tenant industrial properties located in secondary and select primary markets across the United States. The Company seeks to acquire properties that provide income and growth that enable the Company to leverage its real estate operating expertise to enhance shareholder value through active asset management, prudent property re-positioning and disciplined capital deployment."}, {"name": "Power REIT", "sector": "Real Estate", "description": "Power REIT is a real estate investment trust (REIT) that owns real estate related to infrastructure assets including properties for Controlled Environment Agriculture, Renewable Energy and Transportation. Power REIT is actively seeking to expand its real estate portfolio related to Controlled Environment Agriculture."}, {"name": "Protalix BioTherapeutics, Inc.", "sector": "Healthcare", "description": "Protalix BioTherapeutics, Inc., a biopharmaceutical company, focuses on the development and commercialization of recombinant therapeutic proteins based on its proprietary ProCellEx plant cell-based protein expression system in the United States, Australia, Canada, Israel, Brazil, Russia, Turkey, and internationally. The company offers Elelyso for the treatment of Gaucher disease. Its product pipeline comprises PRX-102, a therapeutic protein candidate, which is in the last stage of clinical trials for the treatment of Fabry diseases; PRX-110, a proprietary plant cell recombinant form of human deoxyribonuclease I that has completed phase IIa clinical trials for the treatment of cystic fibrosis; PRX-115, a plant cell-expressed recombinant PEGylated Uricase for the treatment of gout; and PRX-119, a plant cell-expressed PEGylated recombinant human DNase I product candidate for the treatment of NETs-related diseases. The company has agreements and partnerships with Pfizer; Fundação Oswaldo Cruz (Fiocruz); and Chiesi Farmaceutici S.p.A. The company was founded in 1993 and is based in Hackensack, New Jersey."}, {"name": "RENN Fund, Inc.", "sector": "Financial Services", "description": "RENN Fund, Inc. is a closed ended equity mutual fund launched by RENN Capital Group, Inc. The fund is co-managed by Horizon Kinetics Asset Management LLC. It invests in the public equity markets of the United States. The fund seeks to invest in stocks of companies operating across diversified sectors. It seeks to invest in stocks of small-cap and mid-cap companies. The fund employs a fundamental analysis with a bottom-up stock picking approach to create its portfolio. It was formerly known as RENN Global Entrepreneurs Fund, Inc. RENN Fund, Inc. was formed on January 20, 1994 and is domiciled in the United States."}, {"name": "Ra Medical Systems, Inc.", "sector": "Healthcare", "description": "Ra Medical Systems, Inc., a medical device company, develops, manufactures, and markets excimer lasers for use in the treatment of vascular immune-mediated inflammatory diseases. It offers destruction of arteriosclerotic blockages by laser radiation ablation, a minimally invasive excimer laser and single-use catheter system that is used by physicians in the endovascular treatment of vascular blockages resulting from lower extremity vascular disease. The company sells its products primarily through distributors in the United States. Ra Medical Systems, Inc. was incorporated in 2002 and is headquartered in Carlsbad, California."}, {"name": "Rafael Holdings, Inc.", "sector": "Real Estate", "description": "Rafael Holdings, Inc. holds interests in clinical and early stage pharmaceutical companies, and commercial real estate assets in the United States and Israel. The company operates in two segments, Pharmaceuticals and Real Estate. It engages in the leasing of a commercial office building, as well as an associated 800-car public garage; and development and commercialization of therapies that exploit the metabolic differences between normal cells and cancer cells. The company's lead drug candidate is CPI-613 (devimistat), which is being evaluated in various clinical studies, including two Phase III registrational clinical trials for the treatment of metastatic pancreatic cancer and r/r acute myeloid leukemia. Rafael Holdings, Inc. is headquartered in Newark, New Jersey."}, {"name": "Regencell Bioscience Holdings Limited", "sector": "Healthcare", "description": "Regencell Bioscience Holdings Limited operates a Traditional Chinese medicine (TCM) bioscience company. It focuses on the research, development, and commercialization of TCM for the treatment of neurocognitive disorders and degeneration, primarily attention deficit hyperactivity disorder and autism spectrum disorder. The company was incorporated in 2014 and is headquartered in Causeway Bay, Hong Kong."}, {"name": "Renovacor, Inc.", "sector": "Healthcare", "description": "Renovacor, Inc., a biotechnology company, focuses on delivering various precision therapies to enhance the lives of patients and families battling genetically-driven cardiovascular and mechanistically-related diseases. It primarily focuses on the treatment of BCL2-associated athanogene 3 (BAG3) mutation-associated dilated cardiomyopathy (DCM). The company's lead product candidate is REN-001, a recombinant adeno-associated virus 9-based gene therapy designed to deliver a functional BAG3 gene to augment BAG3 protein levels in cardiomyocytes, and slow or halt progression of BAG3 DCM. It is also developing a pipeline of BAG3-associated gene therapies for diseases with high unmet medical need associated with mutations in the BAG3 gene and mechanistically linked to BAG3's expression and function. The company was founded in 2013 and is based in Greenwich, Connecticut."}, {"name": "Retractable Technologies, Inc.", "sector": "Healthcare", "description": "Retractable Technologies, Inc. designs, develops, manufactures, and markets safety syringes and other safety medical products for the healthcare profession in the United States, rest of North and South America, and internationally. It offers VanishPoint insulin syringes; tuberculin, insulin, and allergy antigen syringes; small diameter tube adapters; blood collection tube holders; allergy trays; IV safety catheters; Patient Safe syringes and Luer Caps; VanishPoint blood collection sets; EasyPoint needles; and VanishPoint autodisable syringes. The company distributes its products through general line and specialty distributors, as well as through international distributors; and a direct marketing network. Retractable Technologies, Inc. was incorporated in 1994 and is headquartered in Little Elm, Texas."}, {"name": "Riley Exploration Permian, Inc.", "sector": "Energy", "description": "Riley Exploration Permian, Inc., an independent oil and natural gas company, engages in the acquisition, exploration, development, and production of oil, natural gas, and natural gas liquids in Texas and New Mexico. The company's activities are primarily focused on the San Andres Formation, a shelf margin deposit on the Central Basin Platform and Northwest Shelf. Its acreage is primarily located on contiguous blocks in Yoakum County, Texas; and Lea and Roosevelt Counties, New Mexico. As of September 30, 2021, the company had approximately 31,352 net acres and a total of 77 net producing wells. Riley Exploration Permian, Inc. is headquartered in Oklahoma City, Oklahoma."}, {"name": "Radiant Logistics, Inc.", "sector": "Industrials", "description": "Radiant Logistics, Inc., a third-party logistics company, provides multi-modal transportation and logistics services primarily in the United States and Canada. The company offers domestic and international air and ocean freight forwarding services; and freight brokerage services, including truckload, less than truckload, and intermodal services. It also provides other value-added supply chain services, including materials management and distribution services, as well as customs house brokerage services. The company serves consumer goods, food and beverage, manufacturing, and retail customers through a network of company-owned and strategic operating partner locations under the Radiant, Radiant Canada, Clipper, Airgroup, Adcom, DBA, and Service By Air brands. Radiant Logistics, Inc. was incorporated in 2001 and is headquartered in Renton, Washington."}, {"name": "Reaves Utility Income Fund", "sector": "Financial Services", "description": "Reaves Utility Income Fund is a closed ended balanced mutual fund launched and managed by W. H. Reaves & Company, Inc. The fund invests in public equity and fixed income markets of the United States. It seeks to invest in securities of companies operating in the Utilities sector. The fund primarily invests in dividend paying stocks and debt instruments of companies operating across all market capitalizations. It employs a combination of quantitative and fundamental analysis with bottom-up stock picking approach to create its portfolio. Reaves Utility Income Fund was formed on September 15, 2003 and is domiciled in the United States."}, {"name": "Regional Health Properties, Inc.", "sector": "Healthcare", "description": "Regional Health Properties, Inc., through its subsidiaries, operates as a self-managed real estate investment company that invests primarily in real estate purposed for long-term care and senior living. Its business principally consists of leasing and subleasing such facilities to third-party tenants, which operate the facilities. The company's facilities provide a range of healthcare services to patients and residents, including skilled nursing and assisted living services, social services, various therapy services, and other rehabilitative and healthcare services for long-term and short-stay patients and residents. As of December 31, 2021, it owned, leased, or managed 24 facilities primarily in the Southeastern United States of America. The company was incorporated in 1991 and is headquartered in Suwanee, Georgia."}, {"name": "Ring Energy, Inc.", "sector": "Energy", "description": "Ring Energy, Inc., an exploration and production company, engages in the acquisition, exploration, development, and production of oil and natural gas in Texas and New Mexico. As of December 31, 2021, the company's proved reserves consisted of approximately 77.8 million barrel of oil equivalent. It also had interests in 18,882 net developed acres and 1,406 net undeveloped acres in Andrews and Gaines counties, Texas; 18,437 net developed acres in Culberson and Reeves counties, Texas; and 13,662 net developed acres and 11,993 net undeveloped acres in Yoakum, Runnels, and Coke Counties, Texas and Lea County, New Mexico. Ring Energy, Inc. primarily sells its oil and natural gas production to end users, marketers, and other purchasers. The company was formerly known as Transglobal Mining Corp. and changed its name to Ring Energy, Inc. in March 2008. Ring Energy, Inc. was incorporated in 2004 and is headquartered in The Woodlands, Texas."}, {"name": "SCVX Corp.", "sector": "Financial Services", "description": "SCVX Corp. does not have significant operations. The company intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or related business combination with one or more businesses. in the cybersecurity sector. It intends to focus its search for a business in the cybersecurity sector. The company was incorporated in 2019 and is based in Washington, the District of Columbia."}, {"name": "Sachem Capital Corp.", "sector": "Real Estate", "description": "Sachem Capital Corp. operates as a real estate finance company. The company is involved in the originating, underwriting, funding, servicing, and managing a portfolio of short-term loans secured by first mortgage liens on real property located primarily in Northeastern United States and Florida. It offers loans to real estate investors and owners to fund their acquisition, renovation, rehabilitation, development, and/or improvement of residential or commercial properties. The company has elected to be taxed as a real estate investment trust (REIT) and would not be subject to federal income taxes if it distributes at least 90% of its taxable income each year to its stockholders. Sachem Capital Corp. was founded in 2010 and is based in Branford, Connecticut."}, {"name": "Seaboard Corporation", "sector": "Industrials", "description": "Seaboard Corporation operates as an agribusiness and transportation company worldwide. It operates through six segments: Pork, Commodity Trading and Milling (CT&M), Marine, Sugar and Alcohol, Power, and Turkey. The Pork segment produces and sells fresh and frozen pork products to further processors, foodservice operators, grocery stores, and distributors; hogs; and biodiesel. The CT&M segment sources, transports, and markets wheat, corn, soybeans, soybean meal, and other commodities; and produces wheat flour, maize meal, manufactured feed, and oilseed crush commodities. The Marine segment provides cargo shipping services in the United States, as well as in 26 countries in the Caribbean, and Central and South America; dry, refrigerated, and specialized containers, as well as other related equipment; and operates a terminal and an off-port warehouse for cargo consolidation and temporary storage. As of December 31, 2021, this segment operated through a fleet of 20 chartered and 4 owned vessels. The Sugar and Alcohol segment produces and sells sugar and alcohol; and generates and sells energy through its 51-megawatt cogeneration power plant that is fueled by sugarcane by-products, natural gas, and other biomass. The Power segment operates as an independent power producer that generates electricity for the power grid in the Dominican Republic. The Turkey segment produces and processes organic turkey products to retail stores, foodservice outlets, and industrial entities, as well as exports products to Mexico and internationally. The company also processes and sells jalapeño peppers. Seaboard Corporation was founded in 1918 and is headquartered in Merriam, Kansas."}, {"name": "Sierra Metals Inc.", "sector": "Basic Materials", "description": "Sierra Metals Inc., together with its subsidiaries, focuses on the production, exploration, and development of precious and base metals in Peru and Mexico. It primarily focuses on exploration of silver, copper, lead, zinc, and gold deposits. The company's flagship property is the 81.84% owned polymetallic Yauricocha Mine covering an area of 18,778 hectares located in the Yauyos province in Peru. It also holds 100% interest in the Bolivar mine, comprising of 12 mining concessions covering an area 15,217 hectares; and Cusi Mines that comprises of 73 concessions covering 11,977 hectares in Mexico. The company was formerly known as Dia Bras Exploration Inc. and changed its name to Sierra Metals Inc. in December 2012. Sierra Metals Inc. was incorporated in 1996 and is headquartered in Toronto, Canada."}, {"name": "Silvercorp Metals Inc.", "sector": "Basic Materials", "description": "Silvercorp Metals Inc., together with its subsidiaries, engages in the acquisition, exploration, development, and mining of mineral properties in China and Mexico. The company primarily explores for silver, gold, lead, and zinc metals. It holds interests in the Ying project located in the Ying Mining District in Henan Province, China; Gaocheng (GC) mine located in Guangdong Province, China; Kuanping project located in Sanmenxia City, Shanzhou District, Henan Province, China; and La Yesca project located in northwest of Guadalajara, Mexico. The company was formerly known as SKN Resources Ltd. and changed its name to Silvercorp Metals Inc. in May 2005. Silvercorp Metals Inc. is headquartered in Vancouver, Canada."}, {"name": "Solitario Zinc Corp.", "sector": "Basic Materials", "description": "Solitario Zinc Corp., an exploration stage company, engages in the acquisition and exploration of zinc and other base metal properties in North and South America. The company holds a 50% operating interest in the Lik zinc-lead-silver property located in Northwest Alaska; 39% interest in the Florida Canyon zinc project located in northern Peru; and 85% interest in the Chambara exploration project located in Peru. It also holds interest in the Golden Crest project located in western South Dakota, Lawrence County. The company was formerly known as Solitario Exploration & Royalty Corp. and changed its name to Solitario Zinc Corp. in July 2017. Solitario Zinc Corp. was incorporated in 1984 and is based in Wheat Ridge, Colorado."}, {"name": "Splash Beverage Group, Inc.", "sector": "Consumer Defensive", "description": "Splash Beverage Group, Inc. engages in the manufacturing, distribution, marketing, and sale of various beverages in the United States. Its products include flavored tequilas under the SALT Naturally Flavored Tequila name; hydration and recovery isotonic sport drink under the TapouT Performance name; wine under the Copa di Vino name; and Pulpoloco Sangria. The company also sells beverages and groceries online through qplash.com. Splash Beverage Group, Inc. is based in Fort Lauderdale, Florida."}, {"name": "Stereotaxis, Inc.", "sector": "Healthcare", "description": "Stereotaxis, Inc. designs, manufactures, and markets robotic systems, instruments, and information systems for the interventional laboratory in the United States and internationally. Its robotic magnetic navigation (RMN) systems include the Genesis RMN and Niobe systems, which enable physicians to complete complex interventional procedures by providing image-guided delivery of catheters and guidewires through the blood vessels and chambers of the heart to treatment sites. The company also provides Odyssey, a real-time information solution to manage, control, record, and share procedures across networks; and Stereotaxis Imaging Model S X-ray system, a single-plane full-power x-ray system, including c-arm, powered table, motorized boom, and large high-definition monitors for a robotic interventional operating room. In addition, it offers disposables and other accessories, such as QuikCAS automated catheter advancement disposables for the remote advancement of electrophysiology catheters; and CARTO RMT navigation and ablation system, CELSIUS RMT, NAVISTAR RMT, NAVISTAR RMT DS, NAVISTAR RMT THERMOCOOL, and CELSIUS RMT THERMOCOOL irrigated tip diagnostic/ablation steerable tip catheters. Further, the company provides Vdrive, a system that offers navigation and stability for the diagnostic and therapeutic devices designed to improve interventional procedures; and V-Loop, V-Sono, and V-CAS disposable components. Stereotaxis, Inc. markets its products through direct sales force, distributors, and sales agents. The company has a strategic collaboration with Osypka AG to develop a magnetic ablation catheter using Stereotaxis' robotic technology. Stereotaxis, Inc. was incorporated in 1990 and is headquartered in Saint Louis, Missouri."}, {"name": "SunLink Health Systems, Inc.", "sector": "Healthcare", "description": "SunLink Health Systems, Inc., through its subsidiaries, provides healthcare products and services in the southeastern United States. It operates through two segments, Healthcare Services and Pharmacy. The Healthcare Services segment owns and operates an 84-bed community hospital, which includes an 18-bed geriatric psychiatry unit; and a 66-bed extended care and rehabilitation center. This segment also provides information technology services; and owns unimproved lands. The Pharmacy segment offers institutional and non-institutional pharmacy services; and durable medical equipment products and services, including the sale and rental of products for institutional clients or to patients in institutional settings and patient-administered home care, as well as retails pharmacy products and services. SunLink Health Systems, Inc. was incorporated in 1959 and is based in Atlanta, Georgia."}, {"name": "Sandstorm Gold Ltd.", "sector": "Basic Materials", "description": "Sandstorm Gold Ltd. operates as a gold royalty company. The company focuses on acquiring royalties and gold and other metals purchase agreements (streams) from companies that have advanced stage development projects or operating mines. It offers upfront payments for companies to acquire a stream or royalty and receives the right to purchase a percentage of a mine's production for the life of the mine at a fixed price per unit or at a fixed percentage of the spot price. The company has a portfolio of 230 streams and royalties. It primarily has operations in Canada, Mexico, the United States, Mongolia, Burkina Faso, Ecuador, South Africa, Ghana, Botswana, Cote D'Ivoire, Argentina, Brazil, Chile, Peru, Egypt, Ethiopia, Guyana, Paraguay, French Guiana, Turkey, Sweden, Fiji, and Australia. The company was formerly known as Sandstorm Resources Ltd. and changed its name to Sandstorm Gold Ltd. in February 2011. Sandstorm Gold Ltd. was incorporated in 2007 and is headquartered in Vancouver, Canada."}, {"name": "Senseonics Holdings, Inc.", "sector": "Healthcare", "description": "Senseonics Holdings, Inc., a medical technology company, develops and commercializes continuous glucose monitoring (CGM) systems for people with diabetes in the United States, Europe, the Middle East, and Africa. The company's products include Eversense and Eversense XL, which are implantable CGM systems to measure glucose levels in people with diabetes through an under-the-skin sensor, a removable and rechargeable smart transmitter, and a convenient app for real-time diabetes monitoring and management for a period of up to six months. It serves healthcare providers and patients through a network of distributors and strategic fulfillment partners. The company has a collaboration agreement with the University Hospitals Accountable Care Organization. Senseonics Holdings, Inc. was founded in 1996 and is headquartered in Germantown, Maryland."}, {"name": "Servotronics, Inc.", "sector": "Industrials", "description": "Servotronics, Inc. designs, manufactures, and markets control components and consumer products in the United States and internationally. It operates in two segments, Advanced Technology Group (ATG) and Consumer Products Group (CPG). The ATG segment provides servo-control components to the commercial aerospace, aircraft, and government related industries; and medical and industrial markets. This segment's principal components include torque motors, electromagnetic actuators, hydraulic and pneumatic valves, and related devices that convert an electrical current into a mechanical force or movement, and other products. It also offers metallic seals of various cross-sectional configurations to close tolerances from standard and special alloy steels. This segment markets and sells its products to the United States Government, government prime contractors, government subcontractors, commercial manufacturers, and end-users. The CPG segment provides cutlery products, including steak, carving, bread, butcher, and paring knives for household use, as well as for use in restaurants, institutions, and the private industry; fixed and folding knives for hunting, fishing, and camping; and machetes, bayonets, axes, strap cutters, and other tools primarily for military and rescue/first-responder use, as well as for commercial markets. It also offers various specialty tools, putty knives, linoleum sheet cutters, field knives, scalpels, and micro-spatulas; and plastic and metal fabrication, as well as engineering, design, and OEM/white-label manufacturing services to customers in the consumer and commercial industries. This segment markets its products through its sales resources and independent manufacturers' representatives to big box, hardware, supermarket, variety, department, discount, gift, drug, outdoor, and sporting stores, as well as through electronic commerce. The company was incorporated in 1959 and is headquartered in Elma, New York."}, {"name": "SIFCO Industries, Inc.", "sector": "Industrials", "description": "SIFCO Industries, Inc. produces and sells forgings and machined components primarily for the aerospace and energy markets in North America and Europe. The company's processes and services include forging, heat-treating, and machining. It offers original equipment manufacturer and aftermarket components for aircraft and industrial gas turbine engines; steam turbine blades; structural airframe components; aircraft landing gear components; aircraft wheels and brakes; rotating components for helicopters; and commercial/industrial products. The company also provides heat-treatment, surface-treatment, non-destructive testing, and select machining and sub-assembly of forged components. SIFCO Industries, Inc. was founded in 1913 and is based in Cleveland, Ohio."}, {"name": "SilverCrest Metals Inc.", "sector": "Basic Materials", "description": "SilverCrest Metals Inc. explores for and develops precious metal properties in Mexico. The company primarily explores for silver and gold properties. Its principal property includes the Las Chispas project that consists of 28 concessions totaling of approximately 1,401 hectares located in Sonora, Mexico. The company was incorporated in 2015 and is headquartered in Vancouver, Canada."}, {"name": "Sky Harbour Group Corporation", "sector": "Industrials", "description": "Sky Harbour Group Corporation operates as an aviation infrastructure development company in the United States. It develops, leases, and manages general aviation hangars for business aircraft. The company was founded in 2017 and is based in White Plains, New York."}, {"name": "System1, Inc.", "sector": "Industrials", "description": "System1, Inc. develops technology and data science to operate responsive acquisition marketing platform. The company also operates a real-time coupon code search engine and directory that offers coupon destinations for online shoppers. It serves customers in the areas of health, subscription, finance, insurance, business and technology, travel, auto, and other direct-to-consumer businesses. The company was founded in 2013 and is based in Los Angeles, California."}, {"name": "Sprott Physical Gold and Silver Trust", "sector": "Financial Services", "description": "Sprott Physical Gold and Silver Trust is an exchange traded commodity launched and managed by Sprott Asset Management, LP. The fund invests in commodity markets. It invests in London Good Delivery physical gold and silver bullion. Sprott Physical Gold and Silver Trust was formed on October 26, 2017 and is domiciled in Canada."}, {"name": "Standard Lithium Ltd.", "sector": "Basic Materials", "description": "Standard Lithium Ltd. explores for, develops, and processes lithium brine properties in the United States. Its flagship project is the Lanxess project with approximately 150,000 acres of brine leases located in south-western Arkansas. The company was formerly known as Patriot Petroleum Corp. and changed its name to Standard Lithium Ltd. in December 2016. Standard Lithium Ltd. was incorporated in 1998 and is headquartered in Vancouver, Canada."}, {"name": "Superior Drilling Products, Inc.", "sector": "Energy", "description": "Superior Drilling Products, Inc., a drilling and completion tool technology company, innovates, designs, engineers, manufactures, sells, rents, and repairs drilling and completion tools in the United States, Canada, the Middle East, and Eastern Europe. Its drilling solutions include Drill-N-Ream, a dual-section wellbore conditioning tool; Strider, a drill string oscillation system technology; and V-Stream, an advanced conditioning system. The company also engages in the manufacture and refurbishment of polycrystalline diamond compact drill bits for an oil field services company. It serves oil and natural gas drilling industry. The company was formerly known as SD Company, Inc. and changed its name to Superior Drilling Products, Inc. in May 2014. Superior Drilling Products, Inc. was founded in 1993 and is headquartered in Vernal, Utah."}, {"name": "Synthetic Biologics, Inc.", "sector": "Healthcare", "description": "Synthetic Biologics, Inc., a clinical-stage company, develops therapeutics to treat diseases in areas of high unmet need. The company's lead product candidates include SYN-004 designed to degrade various commonly used intravenous beta-lactam antibiotics in gastrointestinal (GI) tract for the prevention of microbiome damage, clostridium difficile infection (CDI), overgrowth of pathogenic organisms, the emergence of antimicrobial resistance (AMR), and acute graft-versus-host-disease (aGVHD) in allogeneic hematopoietic cell transplant recipients; and SYN-020, a recombinant oral formulation for the enzyme intestinal alkaline phosphatase to treat both local GI and systemic diseases. It also develops VCN-01 for the treatment of patients with pancreatic cancer, head and neck squamous cell carcinoma, colorectal cancer, and retinoblastoma. In addition, the company develops clinical stage products, such as SYN-006 to prevent aGVHD and infection by carbapenem resistant enterococci; SYN-007 for preventing antibiotic associated diarrhea with oral ß-lactam antibiotics; SYN-005 for the prevention and treatment of pertussis; and VCN-11 to treat cancer. It has collaborations with Intrexon Corporation, The University of Texas at Austin, and Cedars-Sinai Medical Center; and a clinical trial agreement with Washington University School of Medicine in St. Louis to conduct a Phase 1b/2a clinical trial of SYN-004. Synthetic Biologics, Inc. is headquartered in Rockville, Maryland."}, {"name": "TRX Gold Corporation", "sector": "Basic Materials", "description": "TRX Gold Corporation engages in the acquisition, financing, exploration, and development of mineral property interests in the United Republic of Tanzania. The company primarily explores for gold deposits. It holds interests in the Buckreef gold project located in north-central Tanzania. The company was formerly known as Tanzanian Gold Corporation and changed its name to TRX Gold Corporation in May 2022. TRX Gold Corporation was incorporated in 1990 and is based in Toronto, Canada."}, {"name": "Taseko Mines Limited", "sector": "Basic Materials", "description": "Taseko Mines Limited, a mining company, acquires, develops, and operates mineral properties. The company explores for copper, molybdenum, gold, niobium, and silver deposits. It holds 75% interest in the Gibraltar mine located in British Columbia. It also holds 100% interest in Yellowhead copper project, the Aley niobium project, and the New Prosperity gold and copper project located in British Columbia; and the Florence copper project located in Arizona. The company was incorporated in 1966 and is headquartered in Vancouver, Canada."}, {"name": "Timber Pharmaceuticals, Inc.", "sector": "Healthcare", "description": "Timber Pharmaceuticals LLC, a clinical-stage biopharmaceutical company, engages in the development and commercialization of treatments for orphan dermatologic diseases. The company's lead product candidates include TMB-001, a patented topical formulation of isotretinoin that has completed Phase 2b clinical trial for the treatment of moderate to severe subtypes of CI, a group of rare genetic keratinization disorders; and TMB-002, a proprietary topical formulation of rapamycin, which is in Phase 2b clinical trial for the treatment of facial angiofibroma in tuberous sclerosis complex, a multisystem genetic disorder resulting in the growth of hamartomas in multiple organs. It is also involved in the development of TMB-003, a proprietary formulation of Sitaxsentan, which is a selective endothelin-A receptor antagonist that is in preclinical development for the treatment of sclerotic skin diseases. In addition, the company engages in the development of BPX-01, which is in Phase 3 topical minocycline for the treatment of inflammatory lesions of acne vulgaris; and BPX-04 that is a Phase 3 ready topical minocycline for the treatment of papulopustular rosacea. It has license agreement with AFT Pharmaceuticals Limited. The company was founded in 2019 and is headquartered in Basking Ridge, New Jersey."}, {"name": "Tompkins Financial Corporation", "sector": "Financial Services", "description": "Tompkins Financial Corporation, a financial holding company, provides commercial and consumer banking, leasing, trust and investment management, financial planning and wealth management, and insurance services. The company operates in three segments: Banking, Insurance, and Wealth Management. It accepts various deposit products, including checking accounts, savings accounts, time deposits, and IRA products, as well as brokered, reciprocal, and municipal money market deposits. The company also offers loans for various business purposes, including real estate financing, construction, equipment financing, accounts receivable financing, and commercial leasing; residential mortgage loans; personal loans; residential real estate loans; home equity loans; commercial and industrial loans; commercial real estate loans; agriculture loans; and consumer loans, such as personal installment loans, direct and indirect automobile financing, and overdraft lines of credit. In addition, it provides letters of credit and sweep accounts; credit and debit cards; and deposit and cash management, internet-based account, remote deposit, safe deposit, voice response, ATM, and mobile and internet banking services. Further, the company offers investment management, trust and estate, and financial and tax planning services; property and casualty, medical, life, disability, and long-term care insurance services; employee benefit consulting services; and insurance planning services. It primarily serves individuals, corporate executives, small business owners, and high net worth individuals. The company operates through a network of 63 banking offices, including 43 offices in New York and 20 offices in Pennsylvania. Tompkins Financial Corporation was founded in 1836 and is headquartered in Ithaca, New York."}, {"name": "Trinity Place Holdings Inc.", "sector": "Real Estate", "description": "Trinity Place Holdings Inc. operates as a real estate holding, investment, development, and asset management company in the United States. The company's principal asset is located at 77 Greenwich Street in Lower Manhattan. It also owns a property occupied by a retail tenant in Paramus, New Jersey. The company also controls various intellectual property assets focused on the consumer sector, including FilenesBasement.com, its rights to the Stanley Blacker brand, as well as the intellectual property associated with the running of the Brides event and An Educated Consumer. Trinity Place Holdings Inc. was founded in 1959 and is headquartered in New York, New York."}, {"name": "Takung Art Co., Ltd.", "sector": "Consumer Cyclical", "description": "Takung Art Co., Ltd., through its subsidiaries, operates an electronic online platform for artists, art dealers, and art investors to offer and trade in artwork in the form of non-fungible token (NFT) primarily in the People's Republic of China. The company's electronic online platform www.nftoeo.com offers online listing and trading services that allow artists/art dealers/owners to access art trading market where they can engage with a range of investors, as well as invests in artwork. Its platform offers and trades in various artwork, such as calligraphy, paintings, sculptures, crafts, jade, jewelry, metal ware, ceramics, and antique furniture. The company also provides NFT consulting services. It serves traders, original owners, and offering agents. Takung Art Co., Ltd. is based in Hong Kong."}, {"name": "Tellurian Inc.", "sector": "Energy", "description": "Tellurian Inc. engages in the natural gas business worldwide. The company is developing a portfolio of natural gas production, liquefied natural gas (LNG) marketing, and infrastructure assets that includes an approximately 27.6 million tons per annum LNG export facility and an associated pipeline. It owns interests in 11,060 net acres of natural gas assets and 78 producing wells located in the Haynesville Shale trend of northern Louisiana. The company was founded in 2016 and is headquartered in Houston, Texas."}, {"name": "Trilogy Metals Inc.", "sector": "Basic Materials", "description": "Trilogy Metals Inc., a base metals exploration company, explores for and develops mineral properties in the United States. It principally holds interests in the Upper Kobuk mineral projects that include the Arctic, which contains polymetallic volcanogenic massive sulfide deposits; and Bornite that contains carbonate-hosted copper - cobalt deposits covering an area of approximately 426,690 acres located in the Ambler mining district in Northwest Alaska. The company was formerly known as NovaCopper Inc. and changed its name to Trilogy Metals Inc. in September 2016. Trilogy Metals Inc. was founded in 2004 and is headquartered in Vancouver, Canada."}, {"name": "Trio-Tech International", "sector": "Technology", "description": "Trio-Tech International, together with its subsidiaries, provides manufacturing, testing, and distribution services to the semiconductor industry. The company's Testing Services segment offers stabilization bake, thermal shock, temperature cycling, mechanical shock, constant acceleration, gross and fine leak, electrical, static and dynamic burn-in, and vibration testing, as well as reliability lab and microprocessor equipment contract cleaning services. This segment also provides qualification testing services that test small samples of output from manufacturers for qualification of their processes and devices. Its Manufacturing segment manufactures front-end semiconductor test equipment, such as artic temperature-controlled wafer chucks used for test, characterization, and failure analysis of semiconductor wafers and other components; and wet process stations for cleaning, rinsing, and drying semiconductor wafers, flat panel display magnetic disks, and other microelectronic substrates. This segment also manufactures back-end products comprising autoclaves and highly accelerated stress test equipment; burn-in equipment and boards; and component centrifuges and leak detection equipment. The company's Distribution segment distributes complementary products, including environmental chambers, handlers, interface systems, vibration systems, shaker systems, solderability testers, and other semiconductor equipment, as well as components, such as connectors, sockets, LCD display panels, and touch-screen panels. Its Real Estate segment invests in and rents real estate properties. The company primarily serves semiconductor chip manufacturers or testing facilities that purchase testing equipment. The company operates in the United States, Singapore, Malaysia, Thailand, and China. Trio-Tech International was incorporated in 1958 and is headquartered in Van Nuys, California."}, {"name": "Unique Fabricating, Inc.", "sector": "Consumer Cyclical", "description": "Unique Fabricating, Inc. engineers and manufactures multi-material foam, rubber, and plastic components utilized in noise, vibration, harshness, acoustical management, water and air sealing, decorative, and other functional applications. The company offers die cut products comprising noise, vibration, and harshness (NVH) pads for lining internal panels; buzz, squeak, and rattle felts and flocks; foam blocks; and gaskets, seals, insulation, and attachment tapes. In addition, it offers thermoformed molded products, including TwinShape foam air ducts; heating, ventilation, and air conditioning (HVAC) evaporator liners; and console bin mats, fender insulators, and molded seat undercovers. Further, the company provides fusion molded products comprising exterior mirror seals, cowl-to-hood seals, and cowl-to-fender seals, as well as other NVH management and sealing applications, such as fillers, spacers, and gaskets; and reaction injection molded products, including rigid foam, integral-skin, viscoelastic, energy absorbing, and high resilience. Unique Fabricating, Inc. sells its products to transportation, appliance, medical, and consumer off-road markets in North America. The company was founded in 1975 and is headquartered in Auburn Hills, Michigan."}, {"name": "Universal Security Instruments, Inc.", "sector": "Industrials", "description": "Universal Security Instruments, Inc., together with its subsidiary, designs, markets, and distributes safety and security products for use in homes and businesses in the United States and internationally. It offers a line of safety alarms, including units powered by replaceable batteries, sealed batteries, and battery backup alarms; and smoke alarms, which include hearing impaired and heat alarms, as well as carbon monoxide alarms, door chimes, ventilation products, ground fault circuit interrupters, and other electrical devices under the UNIVERSAL and USI Electric trade names. The company provides its products to wholesale distributors; chain, discount, and television retailers; home center stores; catalog and mail order companies; electrical and lighting distributors, and manufactured housing companies; and other distributors. It also sells its products through independent sales organizations and sales representatives, as well as through its own sales catalogs and brochures, and website. The company was incorporated in 1969 and is headquartered in Owings Mills, Maryland."}, {"name": "Uranium Energy Corp.", "sector": "Energy", "description": "Uranium Energy Corp., together with its subsidiaries, engages in exploration, pre-extraction, extraction, and processing uranium and titanium concentrates in the United States, Canada, and Paraguay. It owns interests in the Palangana mine, Goliad, Burke Hollow, Longhorn, and Salvo projects located in Texas; Anderson, Workman Creek, and Los Cuatros projects situated in Arizona; Slick Rock project in Colorado; Reno Creek project in Wyoming; Diabase project located in Canada; and Yuty, Oviedo, and Alto Paraná titanium projects in Paraguay. The company was formerly known as Carlin Gold Inc. and changed its name to Uranium Energy Corp. in January 2005. Uranium Energy Corp. was incorporated in 2003 and is based in Corpus Christi, Texas."}, {"name": "United States Antimony Corporation", "sector": "Basic Materials", "description": "United States Antimony Corporation produces and sells antimony, silver, gold, and zeolite products in the United States and Canada. The company's Antimony division offers antimony oxide that is primarily used in conjunction with a halogen to form a synergistic flame retardant system for plastics, rubber, fiberglass, textile goods, paints, coatings, and paper. Its antimony oxide is also used as a color fastener in paints; as a catalyst for the production of polyester resins for fibers and films; as a catalyst for the production of polyethelene pthalate in plastic bottles; as a phosphorescent agent in fluorescent light bulbs; and as an opacifier for porcelains. In addition, this division offers sodium antimonite; and antimony metal for use in bearings, storage batteries, and ordnance; and precious metals. The company's Zeolite division provides zeolite deposits for soil amendment and fertilizer, water filtration, sewage treatment, nuclear waste and other environmental cleanup, odor control, gas separation, and animal nutrition applications. Its zeolite products also have applications in catalysts, petroleum refining, concrete, solar energy and heat exchange, desiccants, pellet binding, horse and kitty litter, and floor cleaners, as well as carriers for insecticides, pesticides, and herbicides. United States Antimony Corporation was founded in 1968 and is based in Thompson Falls, Montana."}, {"name": "Ur-Energy Inc.", "sector": "Energy", "description": "Ur-Energy Inc. engages in the acquisition, exploration, development, and operation of uranium mineral properties. The company holds interests in 12 projects located in the United States. Its flagship property is the Lost Creek project comprising a total of approximately 1,800 unpatented mining claims and three Wyoming mineral leases covering an area of approximately 48,000 acres located in the Great Divide Basin, Wyoming. The company was incorporated in 2004 and is headquartered in Littleton, Colorado."}, {"name": "VirnetX Holding Corp", "sector": "Technology", "description": "VirnetX Holding Corporation, through its subsidiary VirnetX, Inc., operates as an Internet security software and technology company primarily in the United States. The company develops software and technology solutions, including secure domain name registry and GABRIEL Connection Technology that are designed to secure communications over the Internet using zero trust network access. It also offers a portfolio of licenses and services, such as VirnetX One, a security-as-a-service platform that protects enterprise applications, services, and infrastructure from cyber-attacks; GABRIEL Connection Technology software development kit to assist with rapid integration of its techniques into existing software implementations; and War Room software that offers safe and secure video conferencing meeting environment where sensitive communications and data is invisible to those not authorized to view it. In addition, the company provides GABRIEL Collaboration Suite that enables seamless and secure cross-platform communications between users' devices. It serves domain infrastructure and communication service providers, and system integrators; and enterprise customers, developers, and original equipment manufacturers of chips, servers, desktops, smart phones, tablets, laptops, net books, and other devices in the IP-telephony, mobility, fixed-mobile convergence, and unified communications markets. The company was incorporated in 2005 and is headquartered in Zephyr Cove, Nevada."}, {"name": "Vista Gold Corp.", "sector": "Basic Materials", "description": "Vista Gold Corp., together with its subsidiaries, engages in the evaluation, acquisition, exploration, and advancement of gold exploration and development projects primarily in Australia. The company's flagship asset is the Mt Todd gold project located in Northern Territory. Vista Gold Corp. was founded in 1983 and is headquartered in Littleton, Colorado."}, {"name": "Vizsla Silver Corp.", "sector": "Basic Materials", "description": "Vizsla Silver Corp. engages in the acquisition, exploration, and development of precious and base metal assets. The company explores for gold, silver, and coper deposits. Its flagship project is the Panuco-Copala silver gold district located in Sinaloa, Mexico. The company was formerly known as Vizsla Resources Corp. and changed its name to Vizsla Silver Corp. in February 2021. Vizsla Silver Corp. was incorporated in 2017 and is headquartered in Vancouver, Canada."}, {"name": "Viveon Health Acquisition Corp.", "sector": "Financial Services", "description": "Viveon Health Acquisition Corp. does not have significant operations. It intends to effect a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization, or similar business combination with one or more businesses in the healthcare industry in North America. The company was incorporated in 2020 and is based in Norcross, Georgia."}, {"name": "VolitionRx Limited", "sector": "Healthcare", "description": "VolitionRx Limited, a multi-national epigenetics company, engages in the development of blood tests to help diagnose a range of cancers and other diseases worldwide. It sells Nu.Q that detect cancer; Nu.Q Nets, monitoring the immune system; Nu.Q Vet cancer screening test for veterinary applications; Nu.Q Capture capturing and concentrating samples for more accurate diagnosis; and Nu.Q Discover, a solution to profiling nucleosomes. The company operates Nucleosomics a technology platform for blood test. VolitionRx Limited is based in Austin, Texas."}, {"name": "Westwater Resources, Inc.", "sector": "Basic Materials", "description": "Westwater Resources, Inc. operates as an energy materials developer. The company holds interests in Coosa graphite project covering an area of approximately 41,965 acres situated in Coosa County, Alabama. The company was formerly known as Uranium Resources, Inc. and changed its name to Westwater Resources, Inc. in August 2017. Westwater Resources, Inc. was incorporated in 1977 and is based in Centennial, Colorado."}, {"name": "WidePoint Corporation", "sector": "Technology", "description": "WidePoint Corporation provides technology management as a service (TMaaS) to the government and business enterprises in North America and Europe. It offers TMaaS solutions through a federal government certified proprietary portal to manage, analyze, and protect communications assets, as well as deploy identity management solutions that provide secured virtual and physical access to restricted environments. The company provides telecom lifecycle management, mobile and identity management, and digital billing and analytics solutions. It also offers information technology as a service, including cybersecurity, cloud, network operation, and professional services. WidePoint Corporation was founded in 1991 and is headquartered in Fairfax, Virginia."}, {"name": "Winc, Inc.", "sector": "Consumer Defensive", "description": "Winc, Inc. engages in sourcing, bottling, labeling, and distributing wine under its own winery license in the United States and internationally. It operates through DTC and Wholesale segments. The company offers wines and non-alcoholic wines under the Summer Water, Wonderful Wine Company, Lost Poet, Folly of the Beast, Chop Shop, and Cherries and Rainbows brand names; and ready to drink cocktails, and spirits and beers. It sells its products through direct-to-consumer model, wholesale distribution channels, retailers, and restaurants, as well as online. The company was formerly known as Club W, Inc. and changed its name to Winc, Inc. in September 2016. Winc, Inc. was incorporated in 2011 and is based in Santa Monica, California."}, {"name": "Western Copper and Gold Corporation", "sector": "Basic Materials", "description": "Western Copper and Gold Corporation, an exploration stage company, engages in the exploration and development of mineral properties in Canada. The company explores for gold, copper, silver, and molybdenum deposits. Its principal property is the Casino mineral property that comprise 1,136 full and partial quartz claims, and 55 placer claims located in Yukon, Canada. The company was formerly known as Western Copper Corporation and changed its name to Western Copper and Gold Corporation in October 2011. Western Copper and Gold Corporation was incorporated in 2006 and is headquartered in Vancouver, Canada."}, {"name": "Williams Industrial Services Group Inc.", "sector": "Industrials", "description": "Williams Industrial Services Group Inc. provides construction, maintenance, and support services to customers in the energy, power, and industrial end markets in the United States and Canada. It offers maintenance, modification, repair, and other capital project services to extend life cycles of nuclear, paper, chemical, fossil fuel, industrial gas, hydro power, natural gas, municipal water and wastewater, and other facilities. The company also provides cleaning, surface preparation, coatings application, quality control, and inspection testing services for nuclear and fossil fuel power plants, industrial facilities, and petrochemical plants; industrial insulation services, primarily in power generation installations; and abatement services for the removal of asbestos and heavy metal-based coatings, such as lead paint. In addition, it offers services to convert analog control systems to digital control systems of operating plants; nuclear decommissioning services; and nuclear power plant construction services. Further, the company installs, maintains, and modifies water and wastewater systems, including piping, pumping, storage tanks, and other related facilities; and replaces, repairs, and upgrades industrial facility roofing systems, principally at pulp and paper manufacturing facilities and nuclear power plant locations. It markets its services through sales and marketing personnel, as well as its on-site operations personnel. The company was formerly known as Global Power Equipment Group Inc. and changed its name to Williams Industrial Services Group Inc. in June 2018. Williams Industrial Services Group Inc. was founded in 1958 and is headquartered in Atlanta, Georgia."}, {"name": "Wireless Telecom Group, Inc.", "sector": "Technology", "description": "Wireless Telecom Group, Inc., together with its subsidiaries, designs, develops, manufactures, and markets radio frequency (RF) and microwave devices in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company also engages in development, testing, and deployment of wireless technology. In addition, it offers power meters and sensors, voltmeters, and audio and modulation analyzers for radar, avionics, electronic warfare, electromagnetic interference compatibility, and satellite and wireless communications applications; and noise generation instruments, calibrated noise sources, noise modules, and diodes. Further, the company provides phase noise analyzers and signal generators; embedded signal processing and radio frequency modules; and long-term evolution physical layer and stack software for mobile network and related applications. It serves wireless carriers, aerospace and defense companies, military and government agencies, satellite communication companies, network equipment manufacturers, semiconductor companies, system integrators, tower companies, neutral host providers, medical device manufacturers, and other technology companies. The company markets its products under the Boonton, Noisecom, Holzworth, and CommAgility brands through its in-house sales force, manufacturers' representatives, and distributors. Wireless Telecom Group, Inc. was incorporated in 1985 and is headquartered in Parsippany, New Jersey."}, {"name": "Xtant Medical Holdings, Inc.", "sector": "Healthcare", "description": "Xtant Medical Holdings, Inc. develops, manufactures, and markets regenerative medicine products and medical devices for orthopedic and neurological surgeons in the United States and internationally. Its biomaterial products include OsteoSponge that provides a natural scaffold for cellular in-growth and exposes bone-forming proteins to the healing environment; OsteoSponge SC that fills bony defects in the subchondral region of joints; OsteoSelect DBM Putty for osteoinductive bone growth; OsteoSelect PLUS DBM Putty for use as a bone void filler and bone graft substitute in the pelvis, extremities, and posterolateral spine; OsteoFactor, which contains various proteins and peptides that support bone formation and remodeling; OsteoWrap; and OsteoVive Plus, a growth factor enriched cellular bone matrix. The company also provides 3Demin, a family of allografts that maximizes osteoconductivity and the osteoinductive potential of human bone. In addition, it processes and distributes sports allografts for anterior and posterior cruciate ligament repairs, anterior cruciate ligament reconstruction, and meniscal repair; milled spinal allografts for cortical bone milled to desired shapes and dimensions; and traditional allografts for orthopedics, neurology, podiatry, oral/maxillofacial, genitourinary, and plastic/reconstructive applications. Further, the company offers Certex spinal fixation, Spider cervical plating, Axle interspinous fusion, Silex Sacroiliac joint fusion, Xpress minimally invasive pedicle screw, and Fortex Pedicle screw systems. Additionally, it provides Calix for cervical and thoracolumbar applications, Axle-X interspinous fusion system, Irix-C cervical integrated fusion system, and Irix-A Lumbar integrated fusion system. The company was formerly known as Bacterin International Holdings, Inc. and changed its name to Xtant Medical Holdings, Inc. in July 2015. Xtant Medical Holdings, Inc. is headquartered in Belgrade, Montana."}, {"name": "Zedge, Inc.", "sector": "Communication Services", "description": "Zedge, Inc. operates a digital publishing and content platform worldwide. Its platform enables consumers to personalize their mobile devices with ringtones, home screen app icons, wallpapers, widgets, and notification sounds. The company was incorporated in 2008 and is based in New York, New York."}, {"name": "Zomedica Corp.", "sector": "Healthcare", "description": "Zomedica Corp., a veterinary health company, focuses on the unmet needs of clinical veterinarians by developing products for companion animals. The company engages in the development and commercialization of TRUFORMA platform, which offers point-of-care diagnostic products for disease states in dogs and cats; and PulseVet, provides for treatment of various musculoskeletal issues, such as broken bones, tendonitis, and torn ligaments in horses and small animals. It has collaboration agreements with Celsee, Inc. for the development and commercialization of liquid biopsy assays and related consumables for the detection of cancer in companion animals; and Seraph Biosciences, Inc. for development and markets a novel pathogen detection system. The company was formerly known as Zomedica Pharmaceuticals Corp. and changed its name to Zomedica Corp. in October 2020. Zomedica Corp. was founded in 2015 and is headquartered in Ann Arbor, Michigan."}]