[{"name": "ATRESMEDIA CORP DE MEDIOS DE", "ticker": "A3M.mc", "sector": "Communication Services", "description": "Atresmedia Corporación de Medios de Comunicación, S.A., an audiovisual company, engages in the television, digital and multimedia development, advertising, cinema, radio, cinema, and events organization businesses in Spain and internationally. The company is involved in the production, distribution, and sale of TV series; and management of music rights, as well as produces and distributes channels on pay-TV platforms; and operates Atresplayer, an on-line video platform. It operates under the Antena 3, La Sexta, Onda Cero, Europa FM, etc. brands. The company was formerly known as Antena 3 de Televisión, S.A. Atresmedia Corporación de Medios de Comunicación, S.A. was incorporated in 1988 and is based in Madrid, Spain."}, {"name": "ABENGOA SA -CL A", "ticker": "ABG.mc", "sector": "Industrials", "description": "Abengoa, S.A., together with its subsidiaries, provides technology solutions for the energy and water sectors in Spain and rest of Europe, North America, Brazil and rest of South America, Europe, Africa, and the Middle East. It operates through two segments, Engineering and Construction, and Concession-Type Infrastructures. The Engineering and Construction segment offers engineering services, including turnkey projects for thermo-solar plants, solar-gas hybrid plants, conventional generation plants, biofuels plants, and water infrastructures, as well as large-scale desalination plants and transmission lines, and others. It is also involved in the development of solar thermal and water management technologies; and technological business activities, such as hydrogen or the management of energy crops. The Concession-Type Infrastructure segment undertakes take-or-pay contracts or power purchase agreements comprising the operation of electric energy generation plants that include solar, cogeneration, or wind, as well as desalination plants and transmission lines. Abengoa, S.A. was founded in 1941 and is headquartered in Seville, Spain."}, {"name": "ACS ACTIVIDADES CONS Y SERV", "ticker": "ACS.mc", "sector": "Industrials", "description": "ACS, Actividades de Construcción y Servicios, S.A. provides construction and related services in Spain and internationally. The company undertakes construction activities related to development of highways, railways, maritime, airport works, hydraulic infrastructures, coasts, ports, civil engineering, educational and sports facilities, residential, and social infrastructures and facilities; undertakes contracts for the provision of mining services and infrastructure required for mining activities; and offers maintenance services for buildings, public places, and organizations. It also engages in the operation and maintenance activities, and development of real estate infrastructures; design, development, construction, and operation of infrastructure projects, real estates, and facilities; and promotion and development of transport and public facilities, as well as management of different public-private collaboration models. In addition, the company offers services for people, such as care for elderly citizens, dependent people, disabled people, and children aged up until the age of three; and manages playschools and collective restoration. Further, it provides services for building, such as maintenance, energy efficiency, cleaning, security, and logistics and auxiliary services; and services for public spaces comprising managing public lighting, which includes investing in changing light fittings, environmental services, and airport services. ACS, Actividades de Construcción y Servicios, S.A. was founded in 1997 and is based in Madrid, Spain."}, {"name": "ACERINOX SA", "ticker": "ACX.mc", "sector": "Basic Materials", "description": "Acerinox, S.A., through its subsidiaries, manufactures, transforms, and markets stainless steel products in Spain, the Americas, Africa, Asia, Oceania, and Europe. The company offers flat products, including coil cold rollings, hot rolled and black coils, teardrop steel or coils, and hot and cold rolled sheets, as well as roughing materials, discs, billets, and plates. It also provides long products, which include steel and color coated wires, corrugated wires, hexagonal wire rods, bars, hot and cold rebars, decorticated bars, black bars, steel profiles, and corrugated hot rolls. The company was incorporated in 1970 and is headquartered in Madrid, Spain."}, {"name": "ADL BIONATUR SOLUTIONS SA", "ticker": "ADL.mc", "sector": "Healthcare", "description": "ADL Bionatur Solutions, S.A. engages in the research, development, manufacturing, and commercialization of products in biotech and pharmaceutical industry in Spain. It provides solutions in health, nutrition, cosmetics, and materials. The company was founded in 1954 and is headquartered in Cádiz, Spain."}, {"name": "AUDAX RENOVABLES SA", "ticker": "ADX.mc", "sector": "Utilities", "description": "Audax Renovables, S.A. engages in the generation and supplying of renewable electricity and gas in Spain, Portugal, Italy, Poland, Germany, the Netherlands, Polonia, France, and Panama. The company generates electricity primarily through wind and solar energy. It runs a portfolio of operating wind farms of 91 MW. The company was incorporated in 2000 and is based in Badalona, Spain."}, {"name": "ADOLFO DOMINGUEZ", "ticker": "ADZ.mc", "sector": "Consumer Cyclical", "description": "Adolfo Domínguez, S.A. engages in the design, manufacture, acquisition, sale, marketing, retail, import, and export of ready-made clothing, footwear, handbags and accessories, home clothes, furniture products, and decorative objects. It offers its products through physical stores and online sales channels under the Adolfo Domínguez brand. As of February 28, 2021, the company operated 342 points of sales; and 4 stores under direct management and 3 corners through a permanent establishment in Portugal. It operates in Europe, Mexico, Japan, and internationally. The company was formerly known as Nuevas Franquicias, S.A. and changed its name to Adolfo Domínguez, S.A. in November 1996. Adolfo Domínguez, S.A. was founded in 1973 and is based in Ourense, Spain."}, {"name": "AENA SME SA", "ticker": "AENA.mc", "sector": "Industrials", "description": "Aena S.M.E., S.A., together with its subsidiaries, engages in the operation, maintenance, management, and administration of airport infrastructures and heliports in Spain, Brazil, the United Kingdom, Mexico, and Colombia. The company operates through Airports, Real Estate Services, International, and SCAIRM segments. It also manages commercial spaces in airport terminals and car parks network; and rents areas in airport terminals for duty-free shops, specialty shops, food and beverage establishments, commercial operations, and advertising, as well as financial services. In addition, the company leases office buildings, warehouses, hangars, and cargo storage facilities to airlines, air cargo operators, handling agents, and other airport service providers. It manages 46 airports in Spain; 12 airports in Mexico; 2 airports in Colombia; 1 airport in the United Kingdom; and 6 airports in Brazil. The company was formerly known as Aena, S.A. and changed its name to Aena S.M.E., S.A. in April 2017. The company was founded in 2010 and is headquartered in Madrid, Spain. Aena S.M.E., S.A. is a subsidiary of ENAIRE."}, {"name": "AGILE CONTENT SA", "ticker": "AGIL.mc", "sector": "Technology", "description": "Agile Content, S.A. engages in the information technology (IT) consulting services in Spain and internationally. It offers Agile Content Management suite that include the applications and solutions to manage changing catalogs of content; Agile Content Store, which provides mechanics to combine subscriptions of channels and VOD with transactional movie rentals, as well as analytics and insights on the performance of propositions and campaigns, and end-user purchasing behavior. The company also offers Agile Content Processing solution to process the television and video content that is delivered over the internet; and Agile Content Delivery solution to manage the scale of users and streams. In addition, it designs, develops, and commercializes software applications for the production and distribution of various interactive content and services in digital media; provides hosting services; leases hardware and software, as well as the integral management of maintenance and monitoring services; and consulting services. The company sells its solutions under the Agile TV, Edgeware, Fon, and WeTek brands. Agile Content, S.A. was incorporated in 2007 and is based in Bilbao, Spain."}, {"name": "AIRTIFICIAL INTELLIGENCE STR SA", "ticker": "AI.mc", "sector": "Industrials", "description": "Airtificial Intelligence Structures, S.A. provides design and manufacturing technology solutions for the automotive, aeronautics, infrastructure, and other industrial sectors in Spain and internationally. The company offers parts assembly and testing equipment for the automotive industry, including electric and electronic drive systems, seats and mechanisms, brakes, powertrain and thermal units, steering systems, and safety systems. It also provides angles, shovels, tubes and ducts, roof panels, window covers, fairings, VTP dorsal fin, winglets, ribs, fuel tank, topcovers, fan cowl omegas, belly fairing panels, and propellers; avionics comprising signal conditioners, flight control systems, cockpit indicators, and control units; commercial robots; and ground support equipment, including test systems, tooling, and unmanned systems. In addition, the company offers manufacturing engineering, mechanical design, ad-hoc electrical and electronic development, and software development services. Further, it undertakes water planning, managing water resources and watersheds, operating and maintaining large-scale infrastructure, and implementing and managing projects, as well as works for desalination, water supply, sanitation, purification and treatment, damming, and river channeling. Additionally, the company provides consultancy services in the areas of mining, geology, and hydrogeology; transportation infrastructure; and environment. The company was formerly known as Inypsa, Informes y Proyectos, S.A. and changed its name to Airtificial Intelligence Structures, S.A. in November 2018. Airtificial Intelligence Structures, S.A. was founded in 1970 and is based in Madrid, Spain."}, {"name": "AIRBUS SE", "ticker": "AIR.mc", "sector": "Industrials", "description": "Airbus SE engages in the designing, manufacturing, and delivering aerospace products, services, and solutions worldwide. It operates through three segments: Airbus, Airbus Helicopters, and Airbus Defence and Space. The Airbus segment develops, manufactures, markets, and sells commercial jet aircraft of approximately 100 seats; and regional turboprop aircraft and aircraft components, as well as provides aircraft conversion and related services. The Airbus Helicopters segment engages in the development, manufacturing, marketing, and sale of civil and military helicopters; and provision of helicopter related services. The Airbus Defence and Space segment designs, develops, delivers, and supports military aircraft, such as combat, mission, transport, tanker aircraft, and their associated services; and offers unmanned aerial systems. This segment also offers civil and defense space systems for telecommunications, earth observations, navigation, science, and orbital systems; missile systems; and space launcher systems, as well as services around data processing from platforms, secure communication, and cyber security. The company was formerly known as Airbus Group SE and changed its name to Airbus SE in April 2017. Airbus SE was incorporated in 1998 and is based in Leiden, the Netherlands."}, {"name": "CORPORACION FINANCIERA ALBA", "ticker": "ALB.mc", "sector": "Financial Services", "description": "Corporación Financiera Alba, S.A. is a private equity and venture capital firm specializing in early venture, mid venture, late venture, growth capital, and emerging growth financing in middle market and mature companies. The firm does listed equity investments, unlisted equity investments, and real estate assets. It prefers to invest in the following sectors: consumer discretionary which includes media, retailing, distributors; financials; Healthcare which includes pharmaceuticals; biotechnology and life sciences; industrials which includes capital goods, commercial and professional services which includes construction and engineering; commercial services and supplies which includes construction and engineering; industrial services, environment, Information Technology; Materials which includes construction materials and metals and mining, and telecommunication services. The firm seeks to make direct equity investments with a focus on Spanish quoted and unquoted companies. It seeks to take minority stake in public and private companies with a long term investment horizon. The firm prefers to have a Board position in its listed investments. Corporación Financiera Alba, S.A. was founded in 1986 and is headquartered in Madrid, Spain."}, {"name": "ALMIRALL SA", "ticker": "ALM.mc", "sector": "Healthcare", "description": "Almirall, S.A., a biopharmaceutical company, engages in the research, development, manufacture, and sale of skin-health related medicines in Europe, the United States, and internationally. The company offers its products for dermatological diseases comprising actinic keratosis, atopic dermatitis, androgenic alopecia, psoriasis, onychomycosis, oncodermatology, acne, and orphan indications, as well as for cardiovascular, musculo-skeletal, respiratory, and nervous system; alimentary tract and metabolism; antiinfectives for systemic use; genito urinary system and sex hormones; immunostimulants; and systematic hormonal preparations. Its products include Ilumetri, Solaraze, Actikerall, Ciclopoli, Skilarence, Aczone, Decoderm, Cordran Tape, Azelex, Klisyri, Tazorac, Seysara, Veltin, Almax, Ebastel, Sativex, Crestor, and Efficib/Tesavel. Almirall, S.A. has collaboration and partnership agreements with Tyris Therapeutics, BIOMAP, the University of Dundee, Kaken Pharmaceutical Co Ltd., Ichnos Sciences Inc., the University Carlos III Madrid and MEDINA Foundation, 23andMe, Inc., HitGen Ltd., WuXi Biologics, Eli Lilly and Company, and Athenex, Inc. The company was formerly known as Laboratorios Almirall, S.A. and changed its name to Almirall, S.A. in May 2009. Almirall, S.A. was founded in 1943 and is headquartered in Barcelona, Spain."}, {"name": "ALANTRA PARTNERS SA", "ticker": "ALNT.mc", "sector": "Financial Services", "description": "Alantra Partners, S.A., through its subsidiaries, provides investment banking and asset management services. It operates through Investment Banking, Credit Portfolio Advisory, Asset management, and Structural segments. The company's investment banking services include mergers and acquisitions, debt, restructuring, capital markets, and strategic advisory services, as well as investment analysis and intermediation services. It also provides advisory services to companies or institutions in corporate finance operations, as well as stock market brokerage services and analysis for institutional investors. In addition, the company provides asset management services for private equity, private debt, active management funds, infrastructure, energy transition, venture capital, etc. Further, it offers consultancy, and investment and associated services; administration and management of private equity firms, fund managers, and collective investment institutions; and administration and management of collective investment schemes. Additionally, the company engages in the acquisition, holding, leasing, operation, and disposal of real estate properties; and acts as a general partner for private equity investment firms and investment vehicles. The company operates in the United Kingdom, Italy, Germany, France, Greece, the Netherlands, Portugal, Belgium, Sweden, Ireland, Austria, Luxembourg, Switzerland, the United States, India, China, Mexico, and Chile. Alantra Partners, S.A. was incorporated in 1997 and is headquartered in Madrid, Spain."}, {"name": "AMPER SA", "ticker": "AMP.mc", "sector": "Technology", "description": "Amper, S.A. provides industrial and technological solutions in Madrid and internationally. The company offers deployments of the FTTH fiber optic and mobile networks. It is also involved in the provision of design, manufacture, and assembly of installations for the control of atmospheric pollution; development of security systems for signal intelligence, protection of critical infrastructures, and identification and certification; and design and manufacture of devices to connect to the Internet for various fields, such as the digital home, smart cities, industry, and logistics, as well as software development. In addition, the company offers emergencies and critical mission communication systems solutions comprising command, control, communications, computer, coordination, and intelligence applied to public security control centers and the smaller desk centers for local community management; and integrated solutions for the design, calculations, engineering, supply, construction, and assemble of big structures in various industrial areas. Amper, S.A. was founded in 1956 and is based in Madrid, Spain."}, {"name": "AMADEUS IT GROUP SA", "ticker": "AMS.mc", "sector": "Consumer Cyclical", "description": "Amadeus IT Group, S.A., together with its subsidiaries, operates as a transaction processor for the travel and tourism industry worldwide. The company operates through two segments, Distribution and IT Solutions. The company acts as an international network providing real-time search, pricing, booking, and ticketing services. It also offers travel providers a portfolio of technology solutions, which automate certain mission-critical business processes, such as reservations, inventory management, and departure control. In addition, the company is involved in the provision of software development and definition, distribution, regional support, data processing, intermediation, consulting, installation of industrial machinery and equipment, and information technology services; financial activities; and e-commerce business. It serves providers of travel products and services, such as airlines, airports, hotels, tour operators, insurance companies, road and sea transport companies, travel sellers and brokers, travel buyers, and ground handlers. The company was formerly known as Amadeus IT Holding, S.A. and changed its name to Amadeus IT Group, S.A. in August 2016. Amadeus IT Group, S.A. was founded in 1987 and is headquartered in Madrid, Spain."}, {"name": "ACCIONA SA", "ticker": "ANA.mc", "sector": "Industrials", "description": "Acciona, S.A., together with its subsidiaries, engages in the energy, infrastructure, and other businesses in Spain and internationally. The company develops, constructs, operates, and maintains wind, solar photovoltaic, solar thermal, hydro, and biomass plants. It also engages in designing, construction, maintenance, and management of infrastructure projects, including bridges, highways, motorways, roads, tunnels, railway, and metros and trams, as well as ports and water channels, airports, freight forwarding, data centers, substations, and transmission lines. In addition, the company offers event planning and management services, as well as designs, constructs, and operates drinking water treatment plants, reverse osmosis desalination plants, wastewater treatment plants, and tertiary treatment plants for water reuse; and constructs, operates, and manages health infrastructure, and academic institutions and student residences. Further, it provides museum and art center solutions; urban services; and shared electric motorcycles, as well as undertakes real estate projects; and projects for the urban and social regeneration of spaces. Additionally, the company facility, airport handling, waste collection and treatment, logistics, rail, and other services. It also engages in the fund management, stock broking, wine production, and other businesses. Acciona, S.A. is headquartered in Alcobendas, Spain."}, {"name": "APERAM", "ticker": "APAM.mc", "sector": "Basic Materials", "description": "Aperam S.A., together with its subsidiaries, engages in the production and sale of stainless and specialty steel products worldwide. It operates through three segments: Stainless & Electrical Steel; Services & Solutions; and Alloys & Specialties. The company offers range of stainless steel products, including grain oriented and non-grain oriented electrical steel products, and specialty alloys. It is also involved in the distribution of its products; and the provision of transformation services that include value added and customized steel solutions. In addition, the company designs, produces, and transforms various specialty alloys and other specific stainless steels in forms, such as bars, semis, cold-rolled strips, wire and wire rods, and plates in a range on grades. It serves customers in aerospace, automotive, catering, construction, household appliances, electrical engineering, industrial processes, medical, and oil and gas industries. The company distributes its products through a network of service centers, transformation facilities, and sales offices. Aperam S.A. was incorporated in 2010 and is headquartered in Luxembourg City, Luxembourg."}, {"name": "APPLUS SERVICES SA", "ticker": "APPS.mc", "sector": "Industrials", "description": "Applus Services, S.A., together with its subsidiaries, provides testing, inspection, and certification services. It operates through four segments: Applus+ Energy & lndustry, Applus+ Laboratories, Applus+ Automotive, and Applus+ IDIADA. The Applus+ Energy & lndustry segment offers non-destructive testing, quality control, and accreditation services, as well as project management, supplier inspection, facility inspection, and asset certification and integrity services. This segment also provides qualified staff recruitment and hiring services for the oil and gas, aircraft, energy, mining, telecommunications, and construction industries. The Applus+ Laboratories segment offers a range of laboratory testing, system certification, and product development services across various industries and electronic payment systems, including aerospace and industrial sectors. The Applus+ Automotive segment provides mandatory vehicle roadworthiness testing services, as well as verifies vehicles' compliance with safety and emissions regulations in force in various countries. The Applus+ IDIADA segment offers design, engineering, testing, and certification services primarily to car manufacturers. It operates in Spain, rest of Europe, the United States, Canada, the Asia Pacific, the Middle East, Africa, and Latin America. The company was formerly known as Applus Technologies Holding, S.L. and changed its name to Applus Services, S.A. in March 2014. Applus Services, S.A. was founded in 1996 and is headquartered in Madrid, Spain."}, {"name": "ATRYS HEALTH SA", "ticker": "ATRY.mc", "sector": "Healthcare", "description": "Atrys Health, S.A., a biomedical company, provides diagnostic services and medical treatments. The company offers diagnostic services in the fields of pathology, hematology, molecular pathology, and genetics; and diagnostic second opinion, test directory, and clinical trials and R&D services. It uses telemedicine to provide its services in the medical specialties of radiology, cardiology, ophthalmology, and dermatology. The company also provides radiotherapy; and develops therapeutic modalities and diagnostic tools. The company was formerly known as Althia Health, S.L. and changed its name to Atrys Health, S.A. in May 2016. Atrys Health, S.A. was incorporated in 2007 and is headquartered in Madrid, Spain."}, {"name": "AZKOYEN SA", "ticker": "AZK.mc", "sector": "Industrials", "description": "Azkoyen, S.A. designs, manufactures, and sells technological solutions in Spain and internationally. It operates through Time & Security, Coffee & Vending Systems, and Payment Technologies divisions. The Time & Security division offers solutions for access control and time recording, as well as security software and hardware systems; and consultancy services, including the design and planning of the security control measures. This segment serves airports, financial institutions, hospitals, and government or local authorities. The Vending Systems division segment offers vending machines and solutions to offices, companies, hoteliers, or public vending sites. The Payment Technologies division provides payment solutions for cash management, such as coins and banknotes, as well as connectivity and cashless systems. This segment serves gaming, vending, automation, and retail sectors. Azkoyen, S.A. was founded in 1945 and is based in Peralta, Spain."}, {"name": "BANCO BILBAO VIZCAYA ARGENTA", "ticker": "BBVA.mc", "sector": "Financial Services", "description": "Banco Bilbao Vizcaya Argentaria, S.A., together with its subsidiaries, provides retail banking, wholesale banking, and asset management services. It offers current accounts; and demand, savings, overnight, time, term, and subordinated deposits. The company also provides loan products; deals in securities; and manages pension and investment funds. In addition, it offers credit cards; corporate and investment banking services; insurance products and services; and real estate services. The company provides its products through online and mobile channels. As of December 31, 2021, it operated through a network of 6,083 branches and 29,148 ATMs. It operates in Spain, Mexico, South America, the United States, Turkey, Asia, and rest of Europe. Banco Bilbao Vizcaya Argentaria, S.A. was founded in 1857 and is headquartered in Bilbao, Spain."}, {"name": "BANKINTER SA", "ticker": "BKT.mc", "sector": "Financial Services", "description": "Bankinter, S.A. provides various banking products and services to individuals and corporate customers, and small- and medium-sized enterprises in Spain. It offers salary, non-salary, professional, basic, currency, pension, business, and current accounts, as well as deposit products; and mortgages and loan products, as well as financing services. The company also provides saving and investment products, including profiled funds, sustainable investment funds, other managers funds, pension funds, and themed funds, as well as funds for beginners; regular investment plans; and advisory, customized investment, wealth management, and alternative investment products and services. In addition, it offers accident, home, life, funeral, health, mortgage payment protection, property, personal, and motor insurance products, as well as business insurance products. Further, the company provides various services, such as estate administration, switch, asset management, accounts management, and transfer services, as well as real estate and brokerage services. The company also offers retail, personal, private, commercial, and corporate banking products, as well as remote banking services. As of December 31, 2021, it operated through a network of 446 branches and 379 agents. The company was formerly known as Banco Intercontinental Español, S.A. and changed its name to Bankinter, S.A. in July 1990. The company was founded in 1965 and is headquartered in Madrid, Spain."}, {"name": "CAIXABANK S.A", "ticker": "CABK.mc", "sector": "Financial Services", "description": "CaixaBank, S.A., together with its subsidiaries, provides various banking products and financial services in Spain and internationally. The company operates through Banking and Insurance, Equity Investments, and BPI segments. It also provides solutions related to security, protection, internationalization, and financing; traditional financial advice, independent advice, and broker services; asset management; liquidity management; capital markets, cash management, project finance, asset finance, and M&A services; and various financial services and solutions to public and private sector institutions, as well as distributes non-life and life risk insurance policies; and private banking services. In addition, the company is involved in the real estate business. As of September 30, 2021, it had 5,415 branches and 13,678 ATMs in Spain; and 316 branches and 1,440 ATMs in Portugal. CaixaBank, S.A. was founded in 1904 and is based in Valencia, Spain."}, {"name": "CONSTRUCC Y AUX DE FERROCARR", "ticker": "CAF.mc", "sector": "Industrials", "description": "Construcciones y Auxiliar de Ferrocarriles, S.A. designs, manufactures, and sells rolling stock and rail components worldwide. It offers high speed trains, regional trains, commuter trains, metros, LRV's and tram-trains, trams and light metros, and locomotives, as well as electric and hydrogen buses. The company also provides equipment and components, such as wheel sets, wheels, axles, and gear units, as well as after-sales services, including technological advice and inspection guidelines; and traction systems and converters, energy storage systems, and control and communication systems, as well as financing solutions. In addition, it designs, manufactures, supplies, and maintains railway signaling systems. Further, the company is involved in the provision of maintenance, and refurbishment and upgrading services; data compilation, storage, and processing and analysis services; management of spare parts and workshop equipment; and technical support and consultancy. Additionally, it develops turnkey solutions that cover a range of activities, such as viability studies, civil works, electrification and signaling, maintenance, and the operation of the system. The company was formerly known as Compañía Auxiliar de Ferrocarriles S.A. and changed its name to Construcciones y Auxiliar de Ferrocarriles, S.A. in 1971. Construcciones y Auxiliar de Ferrocarriles, S.A. was incorporated in 1917 and is headquartered in Beasain, Spain."}, {"name": "PROSEGUR CASH SA", "ticker": "CASH.mc", "sector": "Industrials", "description": "Prosegur Cash, S.A., together with its subsidiaries, provides cash cycle management solutions and automating payments in retail establishments, ATM management for financial institutions, business, government agencies, central banks, mints, and jewellery stores. The company offers national and international transport services, including collection, transport, custody, and deposit services for funds and other valuables that include jewellery, artworks, precious metals, electronic devices, voting ballots, and legal evidence. It also provides cash processing and automation services, such as counting, processing, and packaging, as well as coin recycling, cash flow control, and monitoring systems; ATM solutions comprising planning, loading, monitoring, first- and second-tier maintenance, and balancing services; and cash planning and forecasting services. In addition, the company offers self-service cash machines that provide cash deposit, recycling, bank notes and coins dispensing, and collection, payment management, invoice payments services; and added-value outsourcing services for banks, such as multiagency, cheque processing, and related administrative services, as well as teller outsourcing service. It serves in Spain, Portugal, Germany, Luxembourg, Argentina, Brazil, Chile, Peru, Uruguay, Paraguay, Colombia, the Philippines, Guatemala, El Salvador, Honduras, Nicaragua, Costa Rica, Ecuador, Mexico, India, Singapore, Indonesia, and Australia. The company was incorporated in 2016 and is headquartered in Madrid, Spain. Prosegur Cash, S.A. is a subsidiary of Prosegur Compañía de Seguridad, S.A."}, {"name": "CLINICA BAVIERA SA", "ticker": "CBAV.mc", "sector": "Healthcare", "description": "Clínica Baviera, S.A., a medical company, operates a network of ophthalmology clinics. The company is involved in the diagnosis, treatment, and monitoring of various types of visual disorders. Its clinics offers myopia, hyperopia, astigmatism, presbyopia, cataract, retina, pediatric ophthalmology, glaucoma, squint, cornea, neuroftalmología, vías lagrimales, and oculoplasty treatments. It operates approximately 90 centers in Spain, Germany, Austria, and Italy. The company is based in Madrid, Spain."}, {"name": "CIE AUTOMOTIVE SA", "ticker": "CIE.mc", "sector": "Consumer Cyclical", "description": "CIE Automotive, S.A. designs, manufactures, and sells automotive components and sub-assemblies worldwide. It offers roof systems, including opening roof, shading, and glazing systems; BIW, chassis, and steering products, such as body in white, hubs, outer rings and spindles, steering column brackets, EPS main housings and components, steering nuts, airbag frames, steering housings, brake boosters, steering column tubes, rear axles, and seat structures; and exterior/interior trim products comprising arm rests, storage compartments, central consoles, ashtrays, glove compartments, in mold decorations, trim parts, emblems, rear-view mirrors, crossbeams, and front covers. The company also provides axle beams and spindles, brake camshafts, axle shafts, rear axle assemblies, pistons, levers, air suspension brackets, spindles, stabilizer bars, and sector shafts; and engine products, including crankshafts, crankshaft caps, diesel and gasoline common rails, ladder frames, camshaft covers and bearings, camshaft bearings housings, valve guides, brackets, exhaust air duct tubes, air tanks, and oil pans. In addition, it offers transmission and gearbox products, such as mechanical and gearbox housings, clutch and transmission housings, pistons, gearbox components and oil pans, differential cases, planetary carriers, flanges, axle shafts, CVT and hybrid components, crowns, and forging parts for CV-joints. It offers its products to original equipment manufacturers and Tier-1 suppliers. CIE Automotive, S.A. was founded in 1996 and is headquartered in Bilbao, Spain."}, {"name": "CELLNEX TELECOM SAU", "ticker": "CLNX.mc", "sector": "Communication Services", "description": "Cellnex Telecom, S.A. operates infrastructure for wireless telecommunication in Austria, Denmark, Spain, France, Ireland, Italy, the Netherlands, Poland, Portugal, the United Kingdom, Sweden, and Switzerland. It operates through three segments: Telecom Infrastructure Services, Broadcasting Networks, and Network Services and Others. The company offers co-location services in its infrastructure for mobile operators to install telecommunications and wireless broadcasting equipment; distributed antenna system and small cells, a network of spatially separated antenna nodes connected to a common source through transport medium that provides wireless services. It also provides broadcasting network services, including digital terrestrial television (DTT), hybrid DTT, satellite DTT services, and premium DTT services; FM and digital radio services; and internet media services, such as online multiscreen video solutions, online business support solutions, and content distribution services. In addition, it offers data transportation services comprising satellite transportation, digital terrestrial circuits, Amazon direct connect, and internet throughput services; security and control services, which include security and emergency networks, terminals, forest fire early warning systems, and control centers; and smart communication networks, including wireless broadband, irrigation management services in rural settings, and Internet of Things services. Further, it offers smart services for city management; engineering/consulting, and operation and maintenance services; and constructs and operates optic fiber telecommunications. The company serves mobile network operators, broadcasters, and administrations. The company was formerly known as Abertis Telecom Terrestre, S.A.U. and changed its name to Cellnex Telecom, S.A. in April 2015. Cellnex Telecom, S.A. was incorporated in 2008 and is headquartered in Madrid, Spain."}, {"name": "INMOBILIARIA COLONIAL SOCIMI", "ticker": "COL.mc", "sector": "Real Estate", "description": "Colonial is a Spanish listed REIT company (SOCIMI), leader in the European Prime office market with presence in the main business areas of Barcelona, Madrid and Paris with a prime office portfolio of more than one million of sqm of GLA and assets under management with a value of more than \u008012bn."}, {"name": "CATENON SA", "ticker": "COM.mc", "sector": "Industrials", "description": "Catenon, S.A., a technology-based company, provides recruitment services in Europe, Asia, the United States, Oceania, Africa, and internationally. Its platform engages in searching, attracting, assessing, and introducing candidates to the clients, as well as presents the candidates to clients over the web through tools, such as the technical filmed interview. The company also provides real-time information services. Catenon, S.A. was incorporated in 2000 and is based in Madrid, Spain."}, {"name": "DISTRIBUIDORA INTERNACIONAL", "ticker": "DIA.mc", "sector": "Consumer Defensive", "description": "Distribuidora Internacional de Alimentación, S.A. engages in the retail sale of food products in Spain, Portugal, Brazil, and Argentina. Its stores offer food and household, and personal hygiene products. The company operated a network of 6,169 owned stores and 2,682 franchised stores under the names of DIA Market, DIA Maxi, La Plaza de DIA, Clarel, Minipreço, and DIA&go. The company was incorporated in 1966 and is headquartered in Madrid, Spain."}, {"name": "GLOBAL DOMINION ACCESS SA", "ticker": "DOM.mc", "sector": "Technology", "description": "Global Dominion Access, S.A. provides multi-technical services and specialized engineering solutions in Spain and internationally. The company engages in the provision of operation and maintenance services for industries, and infrastructures and businesses; industrial cleaning maintenance services; installation and maintenance of refractory linings; design, construction, and maintenance of tall structures, including towers, silos, domes, chimneys, stacks, and others; designing, building, and maintaining industrial structures, such as gas systems, tanks and vessels, industrial furnaces, and electrical systems; and management of logistics and warehouses. It also provides solutions for flexible production and automation; hospital waste incineration; telecommunication networks; technological projects and communication systems; renewable energy generation; and self-consumption and new energy systems. In addition, the company is involved in the implementation and integral management of the life cycle of distribution and transmission lines; installation and integration of the technological items at hospitals, including medical equipment and clinical furniture, as well as the IT system infrastructure and service management platforms; technology and services distribution for the household; and marketing of electricity, gas, mobile, fiber, insurance, and other services for the household. Further, it provides monitored operation management, a solution that implements and manages ICS platforms that use technology as a tool to guarantee and improve the system and process efficiency; digital transformation services; and maintenance and repair services for businesses and the household. It serves the telecommunications, industrial, energy, household, and infrastructure sectors. The company was incorporated in 1999 and is headquartered in Bilbao, Spain."}, {"name": "EBRO FOODS SA", "ticker": "EBRO.mc", "sector": "Consumer Defensive", "description": "Ebro Foods, S.A. produces and sells food products in Spain, rest of Europe, the United States, Canada, and internationally. The company produces and sells various rice varieties; ancient grains, such as quinoa, chia, and bulgur; organic food products; and vegetable protein products under various brands. It primarily serves food distributors, food multinationals, and restaurants. The company was formerly known as Ebro Puleva, S.A. and changed its name to Ebro Foods, S.A. in June 2010. Ebro Foods, S.A. was incorporated in 1998 and is based in Madrid, Spain."}, {"name": "ERCROS SA", "ticker": "ECR.mc", "sector": "Basic Materials", "description": "Ercros, S.A. manufactures and sells basic chemicals, intermediate chemicals, and pharmaceuticals in Spain. It operates through three segments: Chlorine Derivatives, Intermediate Chemicals, and Pharmacy. The Chlorine Derivatives segment produces ammonia, bioplastics, caustic potash and soda, chlorine, chloroisocyanurates, dicalcium phosphate, dichloroethane, hydrochloric acid, hydrogen peroxide, potassium carbonate, PVC compounds, sodium chlorate and chlorite, sodium hypochlorite, and vinyl chloride monomers. This segment's products are used as intermediates in other industrial processes to purify and treat drinking and waste water; treat and maintain swimming pool water; bleach fabrics and paper; produce solvents, detergents, and strippers; manufacture printing inks and coloring; to produce compound feed and in cooling equipment. The Intermediate Chemicals segment provides formaldehyde, glues and resins, molding powders, paraformaldehyde, pentaerythritol and dipentaerythritol, and sodium formate for manufacturing chipboards, and decorative laminates and plywoods, as well as resins, paints, and varnishes in the furniture and decoration industry; plugs and switches in the electrical components sector; and household, sanitary, and packaging materials in the textile tanning industry. The Pharmacy division engages in the production of raw materials and intermediate products from antibiotic, cholesterol-lowering, anti-ulcer, and anti-fungal agents. This segment's products include amlodipine besylate, azithromycin, clarithromycin, erythromycins, famotidine, calcium and sodium fosfomycin, fosfomycin trometamol, and fusidic acid. The company is also involved in exporting activities. Ercros, S.A. was founded in 1817 and is headquartered in Barcelona, Spain."}, {"name": "EDREAMS ODIGEO SL", "ticker": "EDR.mc", "sector": "Consumer Cyclical", "description": "eDreams ODIGEO S.A., together with its subsidiaries, operates as an online travel company in Europe. The company offers its online travel agency services under the eDreams, Go Voyages, Opodo, Travellink, and Liligo brands. It also provides marketing, admin and IT consulting, and metasearch services, as well as offers online advertising campaigns. Its customers access the deals in regular flights, low-cost airlines, hotels, cruises, car rental, dynamic packages, holiday packages, and travel insurance. eDreams ODIGEO S.A. was incorporated in 2011 and is based in Madrid, Spain."}, {"name": "ENDESA SA", "ticker": "ELE.mc", "sector": "Utilities", "description": "Endesa, S.A. engages in the generation, distribution, and sale of electricity primarily in Spain and Portugal. The company generates electricity from various energy sources, such as hydroelectric, nuclear, thermal, wind, and solar. As of December 31, 2021, it distributed electricity to approximately 21 million customers covering a total area of approximately 195,794 square kilometers. The company's distribution and transmission networks consist of 316,506 kilometers. It also sells energy, as well as provides energy related commercial services. In addition, the company engages in installation, maintenance, and repair of home electrical, heating, and air conditioning; trading operations; and investment holding business. Further, it is involved in the supply of electricity and gas to other European markets, including Germany, France, and the Netherlands. Additionally, the company engages in the electric mobility, demand management, and energy storage; exploitation of primary energy resources; provision of industrial services in the areas of telecommunications, water, and gas; electricity transmission business; management, operation, and administration of nuclear plants; issuance of debt instruments; and provision of consultancy and civil engineering services. The company was formerly known as Empresa Nacional de Electricidad, S.A. and changed its name to Endesa, S.A. in June 1997. The company was incorporated in 1944 and is headquartered in Madrid, Spain. Endesa, S.A. is a subsidiary of ENEL Iberia, S.L.U."}, {"name": "ENCE ENERGIA Y CELULOSA SA", "ticker": "ENC.mc", "sector": "Basic Materials", "description": "ENCE Energía y Celulosa, S.A., together with its subsidiaries, produces and sells eucalyptus pulp and renewable energy in Spain, Germany, Poland, Italy, France, the United Kingdom, Turkey, Sweden, Romania, Netherlands, Austria, and internationally. It offers bleached eucalyptus kraft pulp; and forest land management and forestry services, as well as produces renewable energy using forestry and agricultural biomass sources. The company also purchases and sells timber. It manages 61,631 hectares of forest. The company was formerly known as Grupo Empresarial ENCE, S.A. and changed its name to ENCE Energía y Celulosa, S.A. in April 2012. ENCE Energía y Celulosa, S.A. was founded in 1957 and is headquartered in Madrid, Spain."}, {"name": "ENAGAS SA", "ticker": "ENG.mc", "sector": "Utilities", "description": "Enagás, S.A. engages in the development, operation, and maintenance of gas infrastructures in Spain, Mexico, Chile, Peru, Albania, Greece, Italy, and the United States. It operates through Gas transmission, Regasification, and Storage of Gas segments. The company provides gas transmission services through primary and secondary transmission pipelines; natural gas regasification services; and operates underground storage facilities. It is also involved in the operation and technical management of the basic network and secondary transportation network for natural gas. In addition, the company engages in the financial management activities; development of industrial projects and activities relating to LNG terminals, and hydrogen production and transport infrastructures; development and implementation of facilities for the supply of natural gas as fuel for vehicles, including its design, construction, and maintenance; and provision of commercial services for the purpose of enhancing the daily operational management of gas shippers. Further, it is involved in the development and integrated management of energy projects for the production of renewable gases from organic matter; development of projects to promote the role of renewable gases in the energy transition; and production of solar electric energy. The company operates approximately 12,000 kilometers of gas pipelines, 20 compressor stations, and 6 international connections. Enagás, S.A. was founded in 1972 and is headquartered in Madrid, Spain."}, {"name": "ELECNOR  SA", "ticker": "ENO.mc", "sector": "Industrials", "description": "Elecnor, S.A. engages in the infrastructure and concessions businesses in Spain and internationally. The company operates power transport lines and transformation substations; generates power from wind farms, as well as solar, combined cycle, and hydroelectric plants; and provides gas related services covering gas pipeline transportation and distribution. It also develops telecommunications infrastructures and systems; carries out turnkey projects covering electrification, signaling, interlock, communications, and control systems for railways, subways, trams, and trolleybuses; and offers technical, commercial, and ancillary services, as well as maintenance services. In addition, the company is involved in civil and industrial works, construction, and edification business; hydrological planning activities; operating water transportation and distribution networks; treatment and reuse of waste and sewerage; and water purification activities; and waste management, forestry, maintenance of green areas, street cleaning, and the maintenance and infrastructure conservation activities, as well as provides electromechanical systems; and turnkey solutions through its waste treatment engineering developments. Further, it acts as an installation contractor for buildings, cultural and recreational centers, airport and railway terminal buildings, hotels and hospitals, industrial plants, cogeneration and trigeneration plants, etc.; and designs, engineers, and develops solutions and integration systems in aerospace industry, and information and telecommunications technologies. Additionally, the company operates as a turnkey developer and operator of wind power farms; invests and develops solar photovoltaic and thermoelectric solar energy projects; and constructs and operates wastewater treatment plants. Elecnor, S.A. was incorporated in 1958 and is based in Madrid, Spain. Elecnor, S.A. is a subsidiary of Cantiles XXI, S.L."}, {"name": "GRUPO EZENTIS SA", "ticker": "EZE.mc", "sector": "Industrials", "description": "Grupo Ezentis, S.A. operates telecommunications and energy infrastructures primarily in Latin America, Spain, and rest of The European Union. The company offers operation and maintenance services for fixed and mobile telecommunications infrastructure networks, such as evaluation, design and engineering for networks of optical fibre, multi-pair, and structured cabling; civil engineering work for pipes and fiber-optic cameras and multi-pair cables; remodeling and recovery services for customer premise equipment; maintains, installs, and constructs mobile radio base stations for mobile networks; manages multi-service networks; and develops OSS for telecoms operators. It also provides various energy services, such as installation and maintenance of transport and distribution lines, substations, and transformation centers; smart grids; high-voltage lines; civil and electromechanical works; construction and maintenance of public lighting networks; and water and waste supply and treatment systems. In addition, the company offers network engineering and implementation, network security and management, consultancy/PMO, and geographical information systems localization, as well as systems design, architecture, and development services; and alarm systems, access and presence control systems, security installations maintenance, protection against theft, closed circuit TV, fire detection systems, security audit, and customized security solutions. It serves telecommunications, electricity, water, gas, oil, and mining sectors. Grupo Ezentis, S.A. was incorporated in 1959 and is headquartered in Seville, Spain."}, {"name": "FACEPHI BIOMETRIA SA", "ticker": "FACE.mc", "sector": "Technology", "description": "Facephi Biometria, S.A. provides facial recognition technology solutions primarily for banking sector in Latin America, the United States, Asia, and internationally. The company's products include Selphi, a facial biometric solution to access and approve transactions with a selfie; SelphID, a digital onboarding solution with real time OCR in the market with facial liveness test; Look&Phi, an eye biometric solution to access or approve transactions with a look; PhiVox, a voiceprint biometric solution to give access or authenticate in the call center; inPhinite, a solution for digital onboarding, authentication, and security; and SignPhi, an electronic signature suite. The company was incorporated in 2012 and is headquartered in Alicante, Spain."}, {"name": "FAES FARMA SA", "ticker": "FAE.mc", "sector": "Healthcare", "description": "Faes Farma, S.A., a pharmaceutical company, researches, develops, produces, and commercializes pharmaceutical products and raw materials in Spain and internationally. The company's product portfolio includes prescription drugs, generic drugs, over-the-counter (OTC) drugs, food supplements, baby foods, and other health products. It offers Actimag, a magnesium pidolate; Bilaxten, an anti-allergic; Bronquidiazina CR, an anti-infective; Claversal for ulcerative colitis and Crohn's disease; Dezacor, a corticoid; Dolotren, an anti-inflammatory; Dolotren Gel; Dynamogen, an anti-anorexic; Ferroprotina, an anti-anaemic; Hidroferol; Lipofen; Positon for dermatitis; strength builder products, such as Potenciator and Surmenalit; Pruina, a laxative; Robaxisal Compuesto, a muscle relaxant and analgesic; Trausan, a citicoline; Venosmil, a venous vasoprotector; Venosmil Gel; and Yendol, an anti-flu. The company also provides Bilastine, an antihistamine molecule for the treatment of allergic rhino conjunctivitis and urticarial; Calcifediol for bone metabolism; Deflazacort to treat osteoarticular disease; Hidrosmin for venous insufficiency; and Mesalazine to treat digestion problems. It also exports its products. Faes Farma, S.A. was founded in 1933 and is headquartered in Leioa, Spain."}, {"name": "FOMENTO DE CONSTRUC Y CONTRA", "ticker": "FCC.mc", "sector": "Industrials", "description": "Fomento de Construcciones y Contratas, S.A., together with its subsidiaries, engages in the environmental services, water management, and infrastructure development businesses in Europe and internationally. The company offers services related to urban sanitation, industrial waste treatment and waste recycling, street cleansing, conservation of green areas, maintenance of sewerage networks, recovery of contaminated soils, and facility management. It also provides end-to-end water management services relating to the integrated water cycle, such as collection, purification and distribution of water for human consumption; sewage collection, filtration and purification; design, construction, and operation and maintenance of water infrastructure for municipal, industrial, agricultural services, etc. In addition, the company undertakes infrastructure works and building construction, such as motorways, roads, tunnels, bridges, hydraulic works, ports, airports, housing estates, housing, non-residential building, lighting, industrial climate control installations, environmental restoration, etc. Further, it is involved in the operation of quarries and mineral deposits; production of cement, limestone, plaster, and prefabricated by-products; and production of concrete. The company was founded in 1900 and is headquartered in Madrid, Spain. Fomento de Construcciones y Contratas, S.A. is a subsidiary of Control Empresarial de Capitales, S.A. de C.V."}, {"name": "FLUIDRA SA", "ticker": "FDR.mc", "sector": "Industrials", "description": "Fluidra, S.A., together with its subsidiaries, manufactures and markets accessories and machineries for swimming pools, irrigation, and water treatment and purification for private and public customers worldwide. The company manufactures and distributes various components required for the construction, renovation, improvement, and maintenance of residential and commercial pools; markets fluid handling products and pool materials; and provides financial advisory services in the acquisition of shares. It also engages in the design, distribution, installation, and project management of fountains and ponds; marketing of pool materials; marketing of pool, water treatment, and irrigation products; export and import of various types of swimming-pool products; manufacture and distribution of plastic materials and plastic injection molds, as well as plastic parts for valves; manufacture and distribution of automatic pool covers; sale of bathroom equipment, plastic products, rubber products, and electronic products and metal materials, as well as the import and export of goods and technology; manufacture of chemical products and specialty products; and purchase and sale of sports and leisure equipment and related accessories. Fluidra, S.A. sells its products primarily under the Jandy, AstralPool, Polaris, Cepex, Zodiac, CTX Professional, and Gre brand names in approximately 47 countries. The company was formerly known as Aquaria de Inv. Corp., S.L. and changed its name to Fluidra, S.A. in September 2007. Fluidra, S.A. was founded in 1969 and is headquartered in Sant Cugat del Vallés, Spain."}, {"name": "FERROVIAL SA", "ticker": "FER.mc", "sector": "Industrials", "description": "Ferrovial, S.A., together with its subsidiaries, operates as an infrastructure and mobility operator in the United States, Poland, Spain, the United Kingdom, Canada, and internationally. The company engages in the design and construction of various public and private works; and development, finance, and operation of toll roads. Its construction activities include highways, tunnels, railways, bridges and viaducts, airports, intelligent toll systems, port and airport infrastructures, buildings, energy restoration, aqueducts, water treatment plants, desalination plants, digesters, thermal drying plants, chimneys and silos, caissons, storage tanks, solar power towers, oil facilities, and other construction. The company is also involved in the operation and maintenance services of urban and industrial waste water treatment plants, and water treatment and desalination plants. In addition, it develops, manufactures, and markets asphalt and bitumen products; develops, finances, and operates airports; provides integrated solutions for the development and management of electrical transmission networks; provides mobility services, including ZITY, an electric carsharing service application; undertakes engineering works; and sells hydraulic equipment. The company was founded in 1952 and is based in Madrid, Spain."}, {"name": "GENERAL DE ALQUILER DE MAQUI", "ticker": "GALQ.mc", "sector": "Industrials", "description": "General de Alquiler de Maquinaria, S.A. primarily engages in the equipment rental business in Spain and internationally. It rents lifting equipment, energy equipment, handling equipment, earthmoving equipment, etc. for applications in various sectors, including metallurgical, automotive and aeronautics, port, renewable energy, chemical, transport and supply chain, food, food distribution, mining and extraction, paper, wood, cardboard, recycling, and logistics. The company also purchases and sells new and second hand machinery; and provides maintenance services for equipment and machinery. In addition, it offers machinery consultancy and training, and machinery transport and logistics services, as well as distributes spare parts. General de Alquiler de Maquinaria, S.A. was incorporated in 2002 and is based in Siero, Spain."}, {"name": "GRUPO CATALANA OCCIDENTE SA", "ticker": "GCO.mc", "sector": "Financial Services", "description": "Grupo Catalana Occidente, S.A., together with its subsidiaries, provides insurance products and services worldwide. The company operates through Traditional Business and Credit Insurance Business segments. The company offers multi-risk products and services related to family home, stores, retail, blocks of flats, offices, and SMEs; life insurance products, such as risk, savings, pension plans, and investment funds, as well as funeral and health insurance; machinery breakdown; electrical equipment; and motor insurance. It also provides other insurance products, such as industrial products, accidents, transport, and third-party and civil liability; and credit and surety insurance, as well as reinsurance. In addition, the company is also involved in the real estate development business; and stock broking business. It markets its products primarily under the Seguros Catalana Occidente, Plus Ultra Seguros, Seguros Bilbao, NorteHispana Seguros, Crédito y Caución, Atradius, and Atradius Re brands. The company was formerly known as Catalana Occidente, Sociedad Anónima de Seguros y Reaseguros and changed its name to Grupo Catalana Occidente, S.A. in 2001. The company was incorporated in 1864 and is headquartered in Madrid, Spain. Grupo Catalana Occidente, S.A. is a subsidiary of INOC, S.A."}, {"name": "GESTAMP AUTOMOCION SA", "ticker": "GEST.mc", "sector": "Consumer Cyclical", "description": "Gestamp Automoción, S.A. designs, develops, manufactures, and sells metal automotive components in Europe, North America, South America, and Asia. The company offers Body-in-White products, such as bonnets, roofs, doors, and mudguards, as well as other surface and assembly parts; and structural and crash-related elements that include floors, pillars, rails, and wheel arches. It also provides chassis parts, such as systems; frames and related parts comprising front and rear axles and couplings; control arms; and integrated couplings. In addition, the company offers mechanism parts, including hinges, door checks, electrical systems, and powered systems, as well as driver controls. It provides its products to manufacturers of light vehicles. The company was incorporated in 1997 and is headquartered in Madrid, Spain. Gestamp Automoción, S.A. is a subsidiary of Gestamp 2020, S.L."}, {"name": "GIGAS HOSTING SA", "ticker": "GIGA.mc", "sector": "Technology", "description": "Gigas Hosting, S.A., a cloud computing company, provides cloud hosting solutions. It offers Cloud Datacenter, a solution that allows users to create, modify, re-distribute, and manage its virtual data center through web control panel in real time. The company also provides Gigas Cloud Contingency service that enables companies to implement and integrate automatic protection; Cloud Virtual Private Server; SAP cloud solutions; and cloud server for Oracle, as well as firewall, load balancer, and VPN solutions. Gigas Hosting, S.A. was founded in 2011 and is based in Alcobendas, Spain."}, {"name": "GRIFOLS SA", "ticker": "GRF.mc", "sector": "Healthcare", "description": "Grifols, S.A. engages in the procurement, manufacture, preparation, and sale of therapeutic products, primarily hemoderivatives. The company operates through Bioscience, Hospital, Diagnostic, Bio Supplies, and Others divisions. The Bioscience division researches, develops, produces, and markets plasma-derived medicines and other innovative solutions to treat patients with chronic, rare, prevalent, and life-threatening diseases. It offers immunoglobulins, alpha-1 antitrypsin, albumin, clotting factors, and hyperimmune globulins. The Hospital division offers non-biological pharmaceutical products and medical supplies clinical nutrition, intravenous therapy, and medical devices. The Diagnostic division researches, develops, produces, and commercializes diagnostic products that span the healthcare continuum\u0096from prevention, screening, diagnosis, and prognosis to disease and treatment monitoring\u0096to serve professionals. The Bio Supplies division provides biological materials for life-science research, clinical trials, and for manufacturing pharmaceutical and diagnostic products. Its products and services are used by healthcare providers to diagnose and treat patients with hemophilia, immune deficiencies, infectious diseases, and other medical conditions. The company serves public and private customers; and wholesalers, distributors, group purchasing organizations, blood banks, hospitals and care institutions, and national health systems. Grifols, S.A. has a technology collaboration agreement with Mondragon. The company was founded in 1940 and is headquartered in Barcelona, Spain."}, {"name": "GREENALIA SA", "ticker": "GRN.mc", "sector": "Industrials", "description": "Greenalia, S.A., an independent renewable energy producer, generates and sells electricity in Spain and rest of Europe, and the United States. It operates through Onshore Wind, Offshore Wind, Photovoltaic, Storage, and Biomass divisions. The company generates electricity through wind, solar photovoltaic, and biomass technologies. It is also involved in the promotion, production, and storage of energy. The company was formerly known as Grupo Garcia Forestal, S.L. and changed its name to Greenalia, S.A. in September 2016. Greenalia, S.A. was incorporated in 2013 and is based in Corunna, Spain. Greenalia, S.A. is a subsidiary of Smarttia Spain, S.L.U."}, {"name": "GRUPO EMPRESARIAL SAN JOSE", "ticker": "GSJ.mc", "sector": "Industrials", "description": "Grupo Empresarial San José, S.A. engages in construction business in Spain and internationally. It constructs hospitals, buildings and facilities, energy power plants, and infrastructure projects, as well as conserves parks and gardens; and undertakes civil, and engineering and industrial construction works. The company also researches and develops energy efficiency and renewable energy projects; and provides consultancy and project management services for the architecture, civil engineering/infrastructure, real estate management, technology, and sustainable development projects. In addition, it engages in agriculture and cattle businesses; and distributes sport and fashion clothes under the Arena, Teva, Hoka, Diadora, Hunter, Fred Perry clothing, and Dr. Martens brands. The company was formerly known as Udra S.A. and changed its name to Grupo Empresarial San José, S.A. in June 2008. Grupo Empresarial San José, S.A. was founded in 1962 and is headquartered in Madrid, Spain."}, {"name": "NEINOR HOMES SA", "ticker": "HOME.mc", "sector": "Consumer Cyclical", "description": "Neinor Homes, S.A., together with its subsidiaries, develops, promotes, rental, and manages real estate properties in Spain. The company operates through Legacy, Development, Assets Management-Servicing, and Rental segments. Its land portfolio consists of 160 lots with a total of 9.700 buildable units in Madrid, Catalonia, the Basque Country, Valencia, and Andalusia. Neinor Homes, S.A. was founded in 1988 and is headquartered in Bilbao, Spain."}, {"name": "INTL CONSOLIDATED AIRLINE-DI", "ticker": "IAG.mc", "sector": "Industrials", "description": "International Consolidated Airlines Group, S.A., together with its subsidiaries, engages in the provision of passenger and cargo transportation services in the United Kingdom, Spain, Ireland, the United States, and rest of the world. The company operates under the British Airways, Iberia, Vueling, Aer Lingus, and LEVEL brands. It operates a fleet of 531 aircraft. The company was incorporated in 2009 and is based in Madrid, Spain."}, {"name": "IBERDROLA SA", "ticker": "IBE.mc", "sector": "Utilities", "description": "Iberdrola, S.A. engages in the generation, transmission, distribution, and supply of electricity in Spain and internationally. It generates and markets electrical power using renewable sources, such as onshore and offshore wind, hydro, solar photovoltaic, combined cycle gas, nuclear, and biomass, as well as through installation of batteries. The company is also involved in the purchase and sale of electricity and gas on wholesale markets; development of green hydrogen projects; and distribution and sale of gas. It has a total installed capacity of 58,320 MW, including 38,138 MW of renewable installed capacity; and operates 1.2 million kilometers of electricity transmission and distribution lines, as well as serves 36.11 million consumers. In addition, the company offers energy storage, heat pumps, self-consumption, and electric vehicles for residential customers; and management of energy facilities, as well as supplies green H2, industrial heat, etc. to industrial customers. Iberdrola, S.A. was founded in 1840 and is headquartered in Bilbao, Spain."}, {"name": "IBERPAPEL GESTION SA", "ticker": "IBG.mc", "sector": "Basic Materials", "description": "Iberpapel Gestión, S.A., together with its subsidiaries, manufactures, sells, and exports writing and printing paper in Spain, rest of European Union, Africa, South America, and internationally. The company operates through Paper, Gas Power Generation, and Forestry Activity and Other segments. It offers paper for bags and packaging, as well as label face products. The company also generates 10 Mwh of electricity through biomass; and 50 Mwh of electricity through gas cogeneration. In addition, it owns and manages 25,788 hectares of land in Spain, Argentina, and Uruguay. Further, the company is involved in the reforestation and forestry operations; and sale of timber. Iberpapel Gestión, S.A. was founded in 1935 and is headquartered in San Sebastián, Spain."}, {"name": "INDRA SISTEMAS SA", "ticker": "IDR.mc", "sector": "Technology", "description": "Indra Sistemas, S.A. operates as a technology and consulting company worldwide. It designs, develops, produces, integrates, operates, maintains, repairs, and markets systems, solutions, and services based on the use of information technologies, electronics, and communication; and for surveillance and security control of facilities. It also researches, engineers, designs, develops, manufactures, markets, installs, maintains, and repairs devices, equipment, and systems for data communication, encryption systems, encryption, beacon, and command and control center; manages, executes, commercializes, and sells system engineering services for the defense industry; and provides engineering and maintenance services for air defense systems and other related systems, as well as architectural and engineering technical services. In addition, it offers systems to aid navigation and landing, and air traffic control systems; outsources business processes; delivers document management services and mortgage management; realizes measures for the settlement and registration; and manages digitalization and data capture. Further, it provides business consulting, technology and solutions consulting, administration, management, support, advisory, telecommunications, mobile telephony, credit card processing, and energy transport and distribution network manufacture services; engineering and consultancy services for environment, transport, construction, water, and industry areas; and digital agency, web communication and marketing, securities, computer programing, aerodrome air traffic, radio communication security, port infrastructure, airline training and coaching, and project services. Additionally, it researches and develops autonomous air systems and solutions in unmanned systems; and develops and produces aircraft, tactical communication systems, and toll and traffic control and management systems. Indra Sistemas, S.A. was founded in 1921 and is headquartered in Alcobendas, Spain."}, {"name": "INMOBILIARIA DEL SUR SA", "ticker": "ISUR.mc", "sector": "Real Estate", "description": "Inmobiliaria del Sur, S.A. operates as a real estate company in Spain. It constructs and sells houses; offers offices and commercial premises; and rents car parks. The company was incorporated in 1945 and is headquartered in Seville, Spain."}, {"name": "INDUSTRIA DE DISENO TEXTIL", "ticker": "ITX.mc", "sector": "Consumer Cyclical", "description": "Industria de Diseño Textil, S.A. engages in the retail and online distribution of clothing, footwear, accessories, and household textile products through various commercial concepts. Its retail concepts include Zara, Pull & Bear, Massimo Dutti, Bershka, Stradivarius, Oysho, Zara Home, and Uterqüe. As of July 13, 2021, the company operated 6,829 stores in 96 markets; and online stores in 216 markets. It is also involved in textile manufacturing, design, financial services, real estate, logistics, insurance, and combined heat and power plant, and construction businesses. The company operates in Spain, rest of Europe, the Americas, and internationally. Industria de Diseño Textil, S.A. was founded in 1963 and is based in Corunna, Spain."}, {"name": "LINGOTES ESPECIALES S.A.", "ticker": "LGT.mc", "sector": "Consumer Cyclical", "description": "Lingotes Especiales, S.A. engages in the designing, development, casting, machining, and assembly of grey and spheroidal iron parts worldwide. It primarily manufactures brake discs. The company serves automotive, civil works, submarine wiring, electrical appliances, and general industries. Lingotes Especiales, S.A. was incorporated in 1968 and is headquartered in Valladolid, Spain."}, {"name": "CIA DE DISTRIBUCION INTEGRAL", "ticker": "LOG.mc", "sector": "Industrials", "description": "Compañía de Distribución Integral Logista Holdings, S.A., through its subsidiaries, operates as a distributor and logistics operator in Spain, France, Italy, and Portugal. It distributes a range of products and services, including tobacco products; convenience products; pharmaceutical products; electronically recharged products; books; fiscal stamps, postage stamps, and other official documents; and periodicals, collectibles, and magazines. The company also provides parcel and express courier, temperature-controlled capillary transport, and long distance and full load transportation services. It serves clients in various sectors comprising tobacco, publications, books, e-transactions, transport, pharmaceutical, wholesale distribution, and public sectors. The company was incorporated in 1964 and is headquartered in Leganés, Spain. Compañía de Distribución Integral Logista Holdings, S.A. operates as a subsidiary of Imperial Tobacco Limited."}, {"name": "LAR ESPANA REAL ESTATE SOCIM", "ticker": "LRE.mc", "sector": "Real Estate", "description": "LAR ESPAÑA REAL ESTATE SOCIMI, SA is a company listed on the Spanish Stock Exchanges, constituted SOCIMI \"Sociedad Anónima Quizada de Inversión en el Mercado Inmobiliario\" in March 2014. The company, which aims to invest in the Spanish real estate sector, especially in the retail segment. Today it is the Spanish market leader in retail, with nearly 600,000 square meters for rent and 1,509 million euros in asset value. In 2015 LAR ESPAÑA was included in the FTSA EPRA / NAREIT Global index, a selective global index designed to represent general trends in listed real estate companies around the world. Likewise, in 2018 it was included in the Ibex Top Dividend index. In September 2020, for the sixth consecutive year, Lar España was awarded the EPRA Gold Award for the quality of financial information made available to its main stakeholders. Regarding the information published on ESG, Lar España has obtained the highest distinction from EPRA, achieving the Gold Award for the third consecutive year."}, {"name": "MAPFRE SA", "ticker": "MAP.mc", "sector": "Financial Services", "description": "Mapfre, S.A., engages in the insurance and reinsurance activities worldwide. It offers life, health, accident, savings and investment, retirement, burial, and travel and leisure insurance; and homeowner's, automobile, third-party liability, family, and other insurance. The company also provides vehicle, third-party liability and asset, agriculture and livestock, commercial establishment, and other insurance products. In addition, it offers engineering and building, hull and aviation, transportation of goods, surety and credit, life and retirement, and other insurances and reinsurance products. The company offers its services to individuals, professionals, entrepreneurs, self-employed people, small and medium-sized enterprises, and large corporations. It distributes its products through a network of 4,942 direct and delegates; and 10,412 bancassurance offices, as well as through 77,754 delegates, agents, and brokers. The company was formerly known as Corporacion Mapfre and changed its name to Mapfre, S.A. in December 2006. Mapfre, S.A. was founded in 1933 and is headquartered in Majadahonda, Spain. Mapfre, S.A. operates as a subsidiary of Cartera Mapfre, S.L."}, {"name": "MIQUEL Y COSTAS", "ticker": "MCM.mc", "sector": "Basic Materials", "description": "Miquel y Costas & Miquel, S.A., together with its subsidiaries, engages in the manufacture, trading, and sale of fine and specialty lightweight papers in Spain and internationally. It operates through Tobacco Industry, Industrial Products, and Others segments. The company offers papers for the cigarette industry; printing, rolling, and specialty papers; and specialty textile pulps for industrial uses, as well as colored papers and cardboards. It also manufactures, markets, and sells paper pulp, and processed and handled paper; operates thermal electric plant; leases industrial assets; promotes and develops companies; and provides other technical, logistics, storage, transport, and distribution services. The company also exports its products. Miquel y Costas & Miquel, S.A. was founded in 1725 and is headquartered in Barcelona, Spain."}, {"name": "DURO FELGUERA SA", "ticker": "MDF.mc", "sector": "Industrials", "description": "Duro Felguera, S.A. executes turnkey projects for the energy, industrial, and oil and gas facilities in Spain, Latin America, Europe, Africa, Asia, and internationally. It operates through six segments: Energy, Mining & Handling, Oil & Gas, Services, Manufacturing of Capital Goods, and Communications and Control Systems. The company engages in the management, engineering, supply, construction, assembly, start-up and operation, and maintenance of power generation facilities. It also engages in mineral processing activities, including grinding, milling, classification, separation by magnets, gravity, flotation, heap/tank leaching, and sedimentation of residues; and handling turnkey projects, such as port terminals, and homogenization and mine yards. In addition, the company undertakes EPC contracts for engineering, equipment and materials supply, construction, commissioning, start-up, and operation and maintenance of plants; designs and constructs liquefied natural gas tanks, vertical and spherical storage tanks, and hydrocarbon fuel storage plants; and operates and maintains refineries and storage plants. Further, it operates as a turnkey contractor for biomass and cogeneration plants, pellet plants, and smart warehouses; and engages in the construction, assembly, operation, and maintenance of wind farms. Additionally, the company designs and manufactures pressure vessels for the oil and gas and petrochemical industry, and nuclear sector; and offers large equipment shipped in one piece, storage mounded bullets, heavy wall and reactors, coke drums, FCC units, unit packages, modular construction, and nuclear components, as well as provides communications and control systems. The company was formerly known as Grupo Duro Felguera, S.A. and changed its name to Duro Felguera, S.A. in April 2001. Duro Felguera, S.A. was founded in 1858 and is headquartered in Gijón, Spain."}, {"name": "MELIA HOTELS INTERNATIONAL", "ticker": "MEL.mc", "sector": "Consumer Cyclical", "description": "Meliá Hotels International, S.A. owns, manages, operates, leases, and franchises hotels worldwide. The company operates approximately 380 hotels under the Gran Meliá Hotels & Resorts, Paradisus by Meliá, ME by Meliá, Meliá Hotels & Resorts, INNSIDE by Meliá, Sol by Meliá, TRYP by Wyndham, and Circle by Melia brand names, as well as Meliá PRO, a platform for B2B clients. It also operates Club Meliá vacation club; develops and operates real estate properties; and engages in the casinos and tour-operator activities. The company was formerly known as Sol Meliá, S.A. and changed its name to Meliá Hotels International, S.A. in June 2011. Meliá Hotels International, S.A. was founded in 1956 and is based in Palma de Mallorca, Spain."}, {"name": "MERLIN PROPERTIES SOCIMI SA", "ticker": "MRL.mc", "sector": "Real Estate", "description": "MERLIN Properties SOCIMI, SA, one of the main real estate companies listed on the Spanish Stock Exchange (IBEX-35), has as its main activity the acquisition and management of tertiary real estate assets in the Iberian Peninsula. The Company is a public limited company incorporated as a SOCIMI. The main activity of the Company is the acquisition, active management, operation and selective rotation of quality commercial real estate assets in the investment segment \u0093Core\u0094 and \u0093Core Plus\u0094, mainly in Spain and, to a lesser extent, in Portugal. The Company focuses on the office, retail and logistics market."}, {"name": "MONTEBALITO SA", "ticker": "MTB.mc", "sector": "Real Estate", "description": "Montebalito, S.A. engages in the real estate business in Sweden and internationally. It develops and rents properties; and provides land management services. The company was founded in 1972 and is based in Madrid, Spain. Montebalito, S.A. operates as a subsidiary of Metambiente, S.A."}, {"name": "ARCELORMITTAL", "ticker": "MTS.mc", "sector": "Basic Materials", "description": "ArcelorMittal S.A., together with its subsidiaries, operates as integrated steel and mining companies in Europe, North and South America, Asia, and Africa. Its principal steel products include semi-finished flat products, including slabs; finished flat products comprising plates, hot- and cold-rolled coils and sheets, hot-dipped and electro-galvanized coils and sheets, tinplate, and color coated coils and sheets; semi-finished long products, which includes blooms and billets; finished long products, including bars, wire-rods, structural sections, rails, sheet piles, and wire-products; and seamless and welded pipes and tubes. The company's principal mining products comprise iron ore lumps, fines, concentrates, pellets, and sinter feeds; and coking and thermal coal, and pulverized coal injections. It sells its products to various customers in the automotive, appliance, engineering, construction, energy, and machinery industries through a centralized marketing organization, as well as distributors. The company has iron ore mining activities in Brazil, Bosnia, Canada, Kazakhstan, Liberia, Mexico, South Africa, and Ukraine; and coal mining activities in Kazakhstan. ArcelorMittal S.A. was founded in 1976 and is headquartered in Luxembourg City, Luxembourg."}, {"name": "METROVACESA SA", "ticker": "MVC.mc", "sector": "Consumer Cyclical", "description": "Metrovacesa S.A. operates as a real estate development company in Spain. It develops and sells residential properties, which include one-family, multi-family, and semi-detached and detached houses; and commercial properties, as well as sells land. The company was formerly known as Metrovacesa Suelo y Promoción, S.A. and changed its name to Metrovacesa, S.A. in November 2017. Metrovacesa S.A. was founded in 1918 and is headquartered in Madrid, Spain."}, {"name": "NICOLAS CORREA SA", "ticker": "NEA.mc", "sector": "Industrials", "description": "Nicolás Correa, S.A. designs, manufactures, and sells milling machines in Spain and internationally. It offers bed type, travelling column, bridge type moving table milling, gantry type, and gantry milling machines; and express delivery machines, as well as machines with a T-shaped configuration. The company also designs and manufactures machine welded and machined structures, enclosures, telescopic guards, and other metal parts for the general industry; and manufactures and installs electrical cabinets and boards for the industrial machinery sector. In addition, it provides applications engineering and after-sales services. The company offers its products for use in aeronautic, automotive, railway, wind energy, capital goods, energy, defense, general machining, and oil and gas applications. Nicolás Correa, S.A. was founded in 1947 and is based in Burgos, Spain."}, {"name": "NH HOTEL GROUP SA", "ticker": "NHH.mc", "sector": "Consumer Cyclical", "description": "NH Hotel Group, S.A. operates hotels in Spain, Benelux, Italy, Germany, Latin America, and internationally. As of December 31, 2021, the company operated 353 hotels and 55,063 rooms in 30 countries. It is also involved in procurement platform, call center, and catering services. The company was formerly known as NH Hoteles, S.A. and changed its name to NH Hotel Group, S.A. in June 2014. The company was incorporated in 1881 and is headquartered in Madrid, Spain. NH Hotel Group, S.A. is a subsidiary of MHG Continental Holding (Singapore) Pte. Ltd."}, {"name": "NATURGY ENERGY GROUP SA", "ticker": "NTGY.mc", "sector": "Utilities", "description": "Naturgy Energy Group, S.A., together with its subsidiaries, engages in the supply, liquefaction, regasification, transport, storage, distribution, and sale of natural gas. It operates through Energy and Network Management, Renewables and New Business, Supply, and Rest segments. The company engages in the regulated gas and electricity distribution; sale of liquefied natural gas and the sea transport business; management of the gas pipelines and conventional thermal generation facilities; and generation and sale of electricity through wind, mini-hydro, solar, and cogeneration sources, as well as provision of supply management services. It serves in Spain, Argentina, Brazil, Chile, Mexico, Panama, the rest of Latin America, and internationally. The company was formerly known as Gas Natural SDG, S.A. and changed its name to Naturgy Energy Group, S.A. in June 2018. Naturgy Energy Group, S.A. was incorporated in 1843 and is based in Madrid, Spain."}, {"name": "NATURHOUSE HEALTH SAU", "ticker": "NTH.mc", "sector": "Consumer Defensive", "description": "Naturhouse Health, S.A. operates in the nutrition and weight management industry in Spain, Italy, France, Poland, and internationally. The company sells food supplements that are made from natural extracts to facilitate the consumption of various nutrients; and foods and drinks, such as diet products for breakfast, snacks, and meal substitutes. It also offers cosmetics and body care products, including beauty products related to skincare during the slimming process comprising cellulite, firming products, etc.; and anti-ageing products. As of December 31, 2020, it operated through a network of 1,788 centers in 28 countries. The company sells its products through directly operated and franchised Naturhouse centers. The company was formerly known as Housediet, S.L.U. The company was founded in 1991 and is based in Madrid, Spain."}, {"name": "NUEVA EXPRESION TEXTIL SA", "ticker": "NXT.mc", "sector": "Consumer Cyclical", "description": "Nueva Expresión Textil, S.A. manufactures and sells fabrics and garments. The company offers jacquards, meshes, rib, lurex, stripes, simplex, spacer, and elastic fabrics. It also designs, manufactures, and commercializes women's fashion knitwear garments, as well as swimwear and sportswear for men and women; and underwear and technical garments, such as functional men's underwear; garments clothing and accessories for the maternal and lactation stage; and outerwear, athleisure, and shapewear. It provides its products under the Anna Llop, QTT, DOGI, Ritex, EFA, SICI 93, Playvest, and TREISS brand names. The company was formerly known as Dogi International Fabrics, S.A. Nueva Expresión Textil, S.A. was founded in 1954 and is based in Madrid, Spain."}, {"name": "DEOLEO SA", "ticker": "OLE.mc", "sector": "Consumer Defensive", "description": "Deoleo, S.A. engages in the production, transformation, and sale of vegetable oils, and other food and agricultural products in Spain, Italy, Northern Europe, North America, and internationally. The company offers olive oil; markets seed oils, table olives, vinegars, and sauces; purchases and sells, imports, exports, processes, prepares, and markets rice, and other food and agricultural products; and offers co-generation power. It offers its products under the Azalea, Bertolli, Carapelli, Carbonell, Dolcemio, Elosol, Elosua, Figaro, Friol, Giglio Oro, happyday, Hojiblanca, KOIPE, KOIPE SOL, Louit, Lupi, Maya, SAN GIORGIO, SASSO, and Sublime brands. Deoleo, S.A. was incorporated in 1955 and is headquartered in Rivas-Vaciamadrid, Spain."}, {"name": "ORYZON GENOMICS", "ticker": "ORY.mc", "sector": "Healthcare", "description": "Oryzon Genomics S.A., a clinical phase biopharmaceutical company, engages in the discovery and development of epigenetics-based therapeutics for patients with cancer and CNS disorders. Its clinical phase compounds include iadademstat (ORY-1001), a selective LSD1 inhibitor that is in Phase II trials for oncology; and vafidemstat (ORY-2001), a CNS-optimized LSD1 inhibitor, which is in Phase II trials for the treatment of CNS and psychiatric diseases. Its product candidates also comprise ORY-3001, an LSD1 inhibitor that is in preclinical development for the treatment of non-oncological diseases. The company was founded in 2000 and is based in Cornellà de Llobregat, Spain."}, {"name": "PHARMA MAR SA", "ticker": "PHM.mc", "sector": "Healthcare", "description": "Pharma Mar, S.A., a biopharmaceutical company, engages in the research, development, production, and commercialization of bio-active principles of marine origin for use in oncology in Spain, rest of Europe, and internationally. The company operates through three segments: Oncology, Diagnostics, and RNA interference. It develops and commercializes Yondelis for the treatment of soft tissue sarcomas and for ovarian cancer; Aplidin for treating multiple myeloma; and Zepzelca for treating patients with small cell lung cancer. The company also develops clinical-stage programs, including PM184 and PM14. In addition, it develops and markets diagnostics kits; and develops drugs with therapeutic activity based on reducing or silencing gene expression. Pharma Mar, S.A. was incorporated in 1986 and is based in Madrid, Spain."}, {"name": "PRIM SA", "ticker": "PRM.mc", "sector": "Healthcare", "description": "Prim, S.A., through its subsidiaries, designs, manufactures, and commercializes orthopedic products for physiotherapy, thalassotherapy, hydrotherapy, rehabilitation, spa, geriatrics, and support techniques in Spain and internationally. The company offers products for neuro-trauma, cardiovascular, neuromodulation, operating rooms, endo-surgery, plastic surgery, and ENT. It also engages in management of wellness projects, including hotels, resorts, and club sports. Prim, S.A. was founded in 1870 and is headquartered in Móstoles, Spain."}, {"name": "PROMOTORA DE INFORMACIONES-A", "ticker": "PRS.mc", "sector": "Communication Services", "description": "Promotora de Informaciones, S.A., together with its subsidiaries, engages in the exploitation of media in Spain and internationally. The company provides a range of products and services, including educational content, such as textbooks, digital resources, support material, etc., covering preschool to Bachillerato and vocational training; and books publication services. It also offers technology, training, and assessment services to schools, teachers, and students, as well as advisory services. In addition, the company is involved in the operation of radio broadcasting stations; and a range of activities and events, including concerts, festivals, music awards, debates, and conferences. Further, it sells newspapers and magazines, as well as offers advertising and promotions services. Promotora de Informaciones, S.A. was incorporated in 1972 and is based in Madrid, Spain."}, {"name": "PROSEGUR COMP SEGURIDAD", "ticker": "PSG.mc", "sector": "Industrials", "description": "Prosegur Compañía de Seguridad, S.A. operates in the private security sector. The company operates through Security, Cash, Cybersecurity, Alarms, and AVOS (added-value outsourcing services) segments. The Security segment offers guarding and protection of premises, goods and individuals, and activities related to technological security solutions. The Cash segment engages in the transportation, storage, safekeeping, counting, and classification of coins and bank notes, deeds, securities, and other items that require special protection due to their economic value or associated risk. The Alarms segment installs and maintains home alarm systems, as well as provides alarm monitoring services for families and businesses. The Cybersecurity segment offers managed detection and response services, managed security services, cyber intelligence services, readteam services, management, risk and compliance, and integration of cybersecurity technology. The AVOS (added-value outsourcing services) segment provides business process outsourcing services to improve operational management through redesign, automation, and digital transformation in financial and insurance companies. It operates in Germany, Spain, France, Luxembourg, Australia, China, the United States, the Philippines, India, Indonesia, Singapore, South Africa, Argentina, Brazil, Chile, Colombia, El Salvador, Guatemala, Honduras, Mexico, Nicaragua, Paraguay, Peru, and Uruguay. The company was incorporated in 1976 and is headquartered in Madrid, Spain. Prosegur Compañía de Seguridad, S.A. is a subsidiary of Gubel, S.L."}, {"name": "PESCANOVA SA", "ticker": "PVA.mc", "sector": "Consumer Defensive", "description": "Pescanova, S.A. through its subsidiaries, engages in the fishing business. It is involved in the aquafarming and industrial exploitation of sea products. Pescanova, S.A. was founded in 1960 and is based in Redondela, Spain."}, {"name": "RENTA 4 BANCO SA", "ticker": "R4.mc", "sector": "Financial Services", "description": "Renta 4 Banco, S.A., together with its subsidiaries, provides wealth management, brokerage, and corporate advisory services in Spain and internationally. It is involved in the management of collective investment institution (CII) and pension funds; discretionary management of equity portfolios and investment funds, or a combination of equity and investment funds; and provision of wealth management services. The company also offers security and CII custodian services; corporate advisory services, such as corporate finance or M&A; underwriting and placement services; and public debt management services, as well as outsources various services and corporate services. In addition, it engages in the purchase and sale of securities and other financial instruments in Spain and international markets; and sale of CIIs and pension plans that are managed by the company and belonging to third parties. The company was founded in 1985 and is headquartered in Madrid, Spain."}, {"name": "RED ELECTRICA CORPORACION SA", "ticker": "REE.mc", "sector": "Utilities", "description": "Red Eléctrica Corporación, S.A. engages in the electricity transmission, and system operation and management of the transmission network for the electricity system in Spain and internationally. Its transmission network comprises approximately 44,687 kilometers; and has 93,871 MVA of transformation capacity. The company also provides advisory, engineering, and construction services; telecommunications infrastructure services to telecommunications operators comprising leasing of dark fiber; and line and sub-station maintenance services. In addition, it manages and constructs energy storage facilities and the water cycle; operates satellite communications system and offers space segment services for the geostationary orbital slots; sells and leases satellites and spatial capacity; and offers technical consultancy and satellite telecommunications services. The company was incorporated in 1985 and is based in Alcobendas, Spain."}, {"name": "RENTA CORP REAL ESTATE SA", "ticker": "REN.mc", "sector": "Real Estate", "description": "Renta Corporación Real Estate, S.A. engages in the acquisition, refurbishment, and sale of real estate properties in the cities of Barcelona and Madrid. The company's property portfolio comprises residential properties, offices, and parking spaces, as well as commercial premises and hotels. It serves individuals, companies, institutions, and real estate agents. Renta Corporación Real Estate, S.A. was founded in 1991 and is based in Barcelona, Spain."}, {"name": "REPSOL SA", "ticker": "REP.mc", "sector": "Energy", "description": "Repsol, S.A. operates as an integrated energy company worldwide. Its Exploration and Production segment engages in the exploration, development, and production of crude oil and natural gas reserves. The company's Industrial segment is involved in refining activities and petrochemicals business; the trading and transportation of crude oil and oil products; and the sale, transportation, and regasification of natural gas and liquefied natural gas (LNG). Its Commercial and Renewables segment engages in the low carbon power generation and renewable sources; sale of gas and power; mobility and sale of oil products; and liquified petroleum gas activities. The company also offers asphalt products; installs, operates, and manages service stations; provides maritime services; constructs and operates oil refineries; refines and markets hydrocarbons; offers human resource services; distributes and supplies electricity; and develops new energy source, solar, and wind projects, as well as produces and markets chemical products, lubricants, and biofuels. Further, it is involved in fuel and special products marketing, research, trading and transport, insurance and reinsurance, technology development, and financing activities; develops nanoparticles and nanofibers for material, energy, and biomedicine applications; provides blockchain technology for retail, energy, and automotive sectors; produces synthetic oil cloths; invests in liquefaction plant project; and offers water treatment technology management services. The company was formerly known as Repsol YPF, S.A. and changed its name to Repsol, S.A. in May 2012. Repsol, S.A. was founded in 1927 and is headquartered in Madrid, Spain."}, {"name": "BODEGAS RIOJANAS SA", "ticker": "RIO.mc", "sector": "Consumer Defensive", "description": "Bodegas Riojanas, S.A. engages in winemaking business in Spain. The company offers its wine products under the Monte Real, Viña Albina, Puerta Vieja, Gran Albina, Viore, Borisa, Peñamonte, Pascali, Marqués de Peñamonte, Veiga Naúm, Pierrel, Alacer, and Canchales names. The company was founded in 1890 and is based in Cenicero, Spain."}, {"name": "LABORATORIO REIG JOFRE SA", "ticker": "RJF.mc", "sector": "Healthcare", "description": "Laboratorio Reig Jofre, S.A., a pharmaceutical company, researches, develops, manufactures, and markets pharmaceutical products and food supplements. The company offers prescription medicines, OTCs, medical devices, and cosmetics. Its products include pharmaceutical technologies products, such as antibiotics, and injectable and other products; specialty pharmacare products, which include skin, hair, and nail health, joint health and pain, women's health, respiratory/ENT, and pediatrics; and consumer healthcare products under the Forté Pharma brand. The company also provides CDMO and CMO services. It sells its products directly in 7 countries and through business partners in approximately 70 countries. The company was founded in 1929 and is based in Sant Joan Despí, Spain. Laboratorio Reig Jofre, S.A. is a subsidiary of Reig Jofre Investments SL."}, {"name": "REALIA BUSINESS SA", "ticker": "RLIA.mc", "sector": "Real Estate", "description": "Realia Business, S.A., together with its subsidiaries, engages in property management and homebuilding activities in Spain and internationally. It develops, manages, operates, and leases office buildings, shopping centers, commercial premises, and industrial buildings; and provides land management services. It has a land portfolio of 6,946,216 gross square meters and 1,752,340 square meters of buildable land. The company was founded in 2000 and is headquartered in Madrid, Spain."}, {"name": "LABORATORIOS FARMACEUTICOS R", "ticker": "ROVI.mc", "sector": "Healthcare", "description": "Laboratorios Farmaceuticos Rovi, S.A. engages in the research, development, production, and sale of pharmaceutical products in Spain, European Union, OECD countries, and internationally. The company distributes other products that are licensed from other laboratories. Its principal products include Hibor, a low-molecular-weight heparin to prevent and treat venous thromboembolic disease; Enoxaparin biosimilar Becat, a low-molecular-weight heparin; Neparvis to treat symptomatic chronic heart failure with reduced ejection in adult patients; Absorcol, Vytorin, and Orvatez to diet in patients with hypercholesterolemia; Hirobriz Breezhaler and Ulunar Breezhaler that are long-acting bronchodilators for the maintenance treatment of chronic obstructive pulmonary diseases; Volutsa for treatment of moderate to severe storage systems symptoms and voiding symptoms associated with benign prostatic hyperplasia in men who are not responding adequately to monotherapy treatment; and Medikinet and Medicebrán to treat attention deficit hyperactivity disorder in children and teenagers. The company also markets various hospital products for imaging diagnosis, such as Iomeron and Iopamiro for computed tomography and intervention; Multihance and Prohance for magnetic resonance imaging; Sonovue for ultrasounds; and EmpowerCTA+, EmpowerMR, and CT Exprès that are contrast injection systems and compatible disposable material. It provides non-prescription pharmaceutical products; and contract-manufacturing services to other companies for a range of pharmaceutical forms, including prefilled syringes, vials, suppositories, tablets, hard capsules, and sachets. The company serves wholesalers, doctors, nursing staff, pharmacists, and patients. It has a collaboration with Moderna, Inc. for manufacturing mRNA COVID-19 vaccine candidate. The company was incorporated in 1946 and is headquartered in Madrid, Spain. Laboratorios Farmaceúticos Rovi, S.A. is a subsidiary of Norbel Inversiones, S.L."}, {"name": "BANCO DE SABADELL SA", "ticker": "SAB.mc", "sector": "Financial Services", "description": "Banco de Sabadell, S.A. provides banking products and services to personal, business, and private customers in Spain and internationally. The company offers retail banking products, such as current and savings accounts, personal loans, cards, and mortgages. It also provides financial products and services to large and medium enterprises, SMEs, shops and self-employed workers, private individuals, and professionals; and consumer finance, asset management, and bancassurance services. In addition, the company offers corporate banking services, including financing services, transactional banking services, and other complex custom solutions in finance, treasury, and import/export, among others. Further, it provides insurance and pension products. As of December 31, 2021, the company operated 1,593 branches. Banco de Sabadell, S.A. was founded in 1881 and is based in Alicante, Spain."}, {"name": "BANCO SANTANDER SA", "ticker": "SAN.mc", "sector": "Financial Services", "description": "Banco Santander, S.A. provides various retail and commercial banking products and services to individuals, small and medium-sized enterprises, and large companies worldwide. It offers demand and time deposits, and current and savings accounts; mortgages, consumer finance, syndicated corporate loans, structured financing, cash management, export and agency finance, trade and working capital solutions, and corporate finance; and insurance products. The company also provides cash, asset, and wealth management; and private banking services. In addition, it is involved in the corporate banking; treasury, risk hedging, foreign trade, confirming, custody, and investment banking activities. The company operates through a network of 9,879 branches. The company was formerly known as Banco Santander Central Hispano S.A. and changed its name to Banco Santander, S.A. in June 2007. Banco Santander, S.A. was founded in 1856 and is headquartered in Madrid, Spain."}, {"name": "SACYR SA", "ticker": "SCYR.mc", "sector": "Industrials", "description": "Sacyr, S.A. engages in the construction and infrastructure concession services businesses worldwide. The company operates through Concessions, Engineering and Infrastructure, and Services divisions. It offers various construction services comprising civil engineering and buildings, as well as engineering and construction, and maintenance of industrial and oil and gas facilities. The company also engages in motorway, transport hub, airport, and hospital concessions business. In addition, it develops conventional and renewable energy facilities, photovoltaic and geothermal plants, and biomass energy systems; maintains power plants and industrial facilities; and designs, constructs, and operates waste treatment and waste-to-power plants, as well as manages processing plants and equipment. Further, the company engages in the implementation of refinery, chemical and petrochemical, gas handling and treatment, and liquefied natural gas projects; transportation and storage of fuels; and engineering development and construction of high-voltage electricity lines and electricity substations, as well as maintenance of medium and high-voltage electricity lines. Additionally, it offers environmental work and regeneration services; integrated water cycle management, water purification, desalination, and recycling services; facility management and maintenance, building cleaning, and ancillary services; and mining services, as well as involved in street cleaning; waste collection; sludge treatment; gardening and maintenance of green areas; parking meter management; towing; bicycle rental; and removal of vehicles from public thoroughfares. Sacyr, S.A. also engages in real estate development activities; the provision of catering services; and the operation of restaurants and hotels, petrol stations, and retail outlets. The company was formerly known as Sacyr Vallehermoso S.A. and changed its name to Sacyr, S.A. in August 2013. Sacyr, S.A. is headquartered in Madrid, Spain."}, {"name": "SIEMENS GAMESA RENEWABLE ENE", "ticker": "SGRE.mc", "sector": "Industrials", "description": "Siemens Gamesa Renewable Energy, S.A., together with its subsidiaries, supplies wind power solutions in Europe, the Middle East, Africa, Americas, Asia, and Australia. It operates through two segments, Wind Turbines and Operation and Maintenance. The Wind Turbines segment offers wind turbines for various pitch and speed technologies, as well as provides development, construction, and sale of wind farms. The Operation and Maintenance segment engages in the management, monitoring, and maintenance of wind farms. It has a total installed capacity of approximately 107 gigawatts. The company was formerly known as Gamesa Corporación Tecnológica, Sociedad Anónima and changed its name to Siemens Gamesa Renewable Energy, S.A. in May 2017. The company was founded in 1976 and is headquartered in Zamudio, Spain. Siemens Gamesa Renewable Energy, S.A. operates as a subsidiary of Siemens Energy Global GmbH & Co. KG."}, {"name": "SOLARIA ENERGIA Y MEDIO AMBI", "ticker": "SLR.mc", "sector": "Utilities", "description": "Solaria Energía y Medio Ambiente, S.A. engages in the solar photovoltaic power generation business. The company owns, manages, and operates photovoltaic plants in Spain, Italy, Uruguay, and Greece. The company was incorporated in 2002 and is headquartered in Madrid, Spain."}, {"name": "TELEFONICA SA", "ticker": "TEF.mc", "sector": "Communication Services", "description": "Telefónica, S.A., together with its subsidiaries, provides telecommunications services in Europe and Latin America. The company's mobile and related services and products comprise mobile voice, value added, mobile data and Internet, wholesale, corporate, roaming, fixed wireless, and trunking and paging services. Its fixed telecommunication services include PSTN lines; ISDN accesses; public telephone services; local, domestic, and international long-distance and fixed-to-mobile communications; corporate communications; supplementary value-added services; video telephony; intelligent network; and telephony information services, as well as leases and sells handset equipment. The company also provides Internet and broadband multimedia services comprising Internet service provider, portal and network, retail and wholesale broadband access, narrowband switched access, high-speed Internet through fibre to the home, and voice over Internet protocol services. In addition, it offers leased line, virtual private network, fibre optics, web hosting and application, outsourcing and consultancy, desktop, and system integration and professional services. Further, the company offers wholesale services for telecommunication operators, including domestic interconnection and international wholesale services; leased lines for other operators; and local loop leasing services, as well as bit stream services, wholesale line rental accesses, and leased ducts for other operators' fiber deployment. Additionally, it provides video/TV services; smart connectivity and services, and consumer IoT products; financial and other payment, security, cloud computing, advertising, big data, and digital telco experience services; virtual assistants; digital home platforms; and Movistar Home devices. It also offers online telemedicine, home insurance, music streaming, and consumer loan services. The company was incorporated in 1924 and is headquartered in Madrid, Spain."}, {"name": "MEDIASET ESPANA COMUNICACION", "ticker": "TL5.mc", "sector": "Communication Services", "description": "Mediaset España Comunicación, S.A., together with its subsidiaries, engages in the television broadcasting business in Spain. The company operates seven television channels comprising TELECINCO, FactorÃ­a de FicciÃ³n, BOING, Cuatro, Divinity, Energy, and Be Mad. It is also involved in the production and broadcast of audiovisual content; provision of news agency services; exploitation of advertising space on television channels; and advertising promotion activities. The company was formerly known as Gestevisión Telecinco, S.A. and changed its name to Mediaset España Comunicación, S.A. in May 2011. Mediaset España Comunicación, S.A. was incorporated in 1989 and is based in Madrid, Spain. Mediaset España Comunicación, S.A. is a subsidiary of MFE-MediaForEurope NV."}, {"name": "TALGO SA", "ticker": "TLGO.mc", "sector": "Industrials", "description": "Talgo, S.A., a rolling stock engineering company, designs, manufactures, and services lightweight trains worldwide. It offers very high speed, high speed, and intercity trains and locomotives. The company also provides maintenance equipment, including underfloor wheel lathers for maintenance of high speed and long-distance trains; and shunting cars, as well as measuring equipment to railway operators. In addition, it offers maintenance and rolling stock refurbishment services. The company was formerly known as Pegaso Rail International, S.A. The company was founded in 1942 and is headquartered in Madrid, Spain."}, {"name": "TECNICAS REUNIDAS SA", "ticker": "TRE.mc", "sector": "Industrials", "description": "Técnicas Reunidas, S.A., an engineering and construction company, engages in the design and management of industrial plant projects worldwide. It operates through Oil and Gas, Power, and Other Industries segments. The Oil and Gas segment offers engineering, procurement, and construction services in oil processing operations and chemical production and processing operations; services related to the natural gas production and extraction value chain, such as production, processing, storage, and transportation; constructs, revamps, and expands refining plants; designs and builds auxiliary services and other refining units; and designs and constructs monomers, polymers and plastics, chemical, and fertilizer producing and processing plants. The Power segment provides consulting, engineering, procurement, and construction services for a range of electricity generating plants comprising conventional thermal plants, combined cycle power plants, gasification integrated with combined cycle, nuclear plants, co-generators, solar plants, fuel cells, solid waste, and biomass technology, as well as plant operation and maintenance services; and supplies turnkey plants. The Other Industries segment undertakes projects in various areas that include airports, industrial facilities, and desalination and water treatment plants, as well as projects for public authorities and other organizations, including management of car parks, and sports centers. It is also involved in the property development and machinery wholesale business; and provision of inspection, quality control, and technical consulting services. The company was formerly known as Lummus Española, S.A. and changed its name to Técnicas Reunidas, S.A. in 1972. Técnicas Reunidas, S.A. was incorporated in 1960 and is based in Madrid, Spain."}, {"name": "TUBOS REUNIDOS SA", "ticker": "TRG.mc", "sector": "Basic Materials", "description": "Tubos Reunidos, S.A. manufactures, processes, and distributes seamless steel pipes in North America, the European Union, the Far East, the Middle East, Africa, and internationally. The company provides hot finished and cold drawn seamless tubes in carbon steel and alloyed steel; and hot finished large diameter seamless tubes in carbon, alloyed, high alloyed, and stainless steel. Its products are used in oil and gas; electric power generation and heat transfer; and chemical and petrochemical sectors, as well as in machinery and special industrial applications. Tubos Reunidos, S.A. was founded in 1892 and is headquartered in Amurrio, Spain."}, {"name": "TUBACEX SA", "ticker": "TUB.mc", "sector": "Basic Materials", "description": "Tubacex, S.A., together with its subsidiaries, engages in the manufacture, supply, and sale of stainless steel and nickel super-alloy tubular solutions worldwide. The company offers seamless stainless steel tubes; mechanical tubes; round bars, billets, and ingots; fittings and special components, such as welding fittings, curved sections, elbows, tees, reducers, and caps; and Tubacoat, a ceramic coating for long steel and high-nickel alloy products. Its products have applications in the oil and gas exploration and production, hydrocarbon processing, fertilizer, power generation, aerospace, and other industries. The company was incorporated in 1963 and is headquartered in Llodio, Spain."}, {"name": "URBAS GRUPO FINANCIERO SA", "ticker": "UBS.mc", "sector": "Real Estate", "description": "Urbas Grupo Financiero, S.A. engages in the real estate business in Spain. The company develops and sells properties; manages and sells land; and leases properties. It also engages in the construction, maintenance, and facilities; and energy and industrial projects business. The company was formerly known as Urbas Guadahermosa SA. and changed its name to Urbas Grupo Financiero, S.A. in September 2011. Urbas Grupo Financiero, S.A. was incorporated in 1944 and is based in Madrid, Spain."}, {"name": "UNICAJA BANCO SA", "ticker": "UNI.mc", "sector": "Financial Services", "description": "Unicaja Banco, S.A. provides various banking products and services to individuals and companies in Spain and internationally. It offers accounts, payments, and debit and credit cards; mortgages and personal loans; deposit products, stock exchange, pension plans, investment funds and portfolios, and savings insurance policies; and life, home, car, accident, health, and agricultural insurance, as well as SME and retail damage, and corporate liability insurance products. The company also provides cash management, short term and long-term financing, and investment services, as well as remote and mobile banking services. In addition, it engages in the property development and renewable energies activities; and invests in assets, securities, and financial companies. As of December 31, 2021, it had a network of 1,368 branches in Spain and 1 correspondent office in the United Kingdom. Unicaja Banco, S.A. was founded in 1991 and is headquartered in Málaga, Spain."}, {"name": "VIDRALA SA", "ticker": "VID.mc", "sector": "Consumer Cyclical", "description": "Vidrala, S.A., a consumer packaging company, manufactures and sells glass containers for food and beverage products in Spain, the United Kingdom, Ireland, France, Italy, Portugal, and internationally. The company provides glass oil bottles and vinegar bottles, beer bottles, preserve food jars, cider bottles and sparkling wine bottles, spirit bottles, wine glass bottles, and juice bottles, as well as bottles for non-alcoholic beverages. It also offers packaging services, such as logistic solutions and beverage filling. The company was incorporated in 1965 and is headquartered in Laudio/Llodio, Spain."}, {"name": "VISCOFAN SA", "ticker": "VIS.mc", "sector": "Consumer Cyclical", "description": "Viscofan, S.A., together with its subsidiaries, manufactures and distributes artificial casings primarily for use in the meat and other industry worldwide. The company offers cellulose casings for cooked, smoked, or unsmoked sausages; collagen casings for processed, fresh, and pre-cooked fried sausages or dry-cured snacks; fibrous casings for sliced goods, such as mortadella or salamis; and other plastic casings and packing solutions. The company offers its cellulosic wraps under the Viscofan brands; collagen casings under the Colfan, NDX, Viscofan Natur, Edicurve, Eficook, and Efidry brands; fibrous casings under the Securex, Zip, PSX, and Titanium brands; casings, films, bags, and other plastic products under the Viscofan Smoke, Betan, Tripan, V-4000 brands; functional solutions under the Vispice, Roast-E, Smoke-E, and Edileaf brands; and vegetable casings under the Viscofan Veggie brand. It also manufactures interleaver films; leases industrial machinery; and generates and sells electricity through its cogeneration plants. The company was formerly known as Viscofan, Industria Navarra de Envolturas Celulósicas, S.A. and changed its name to Viscofan, S.A. in June 2002.Viscofan, S.A. was incorporated in 1975 and is headquartered in Tajonar, Spain."}, {"name": "VOCENTO SA", "ticker": "VOC.mc", "sector": "Communication Services", "description": "Vocento, S.A., together with its subsidiaries, operates as a multimedia communications company in Spain. The company operates through ABC, Regional, Supplements and Magazines, Audiovisual, Classifieds, Gastronomy, Agency, and Structure segments. It conducts various activities in the newspapers, supplements, magazines, television, audiovisual production, film distribution, and Internet in the areas of information and entertainment. The company publishes regional newspapers under the El Correo, La Verdad, El Diario Vasco, El Norte de Castilla, El Diario Montañés, Ideal, Sur, Las Provincias, El Comercio, Hoy, La Rioja, and Colpisa titles; ABC, a national daily newspaper; and supplements comprising XL Semanal and Mujer Hoy, as well as operates WomenNow, a women's event and Mujerhoy.com, a website for women. It also produces and distributes television, radio, and content; offers GELT, an app that offers online coupons and cashback for purchases made in supermarkets; Shows on Demand, a digital platform which allows users to call for their favorite artist to perform in their town; Premium Leads; and provides financing services to recently created companies and those in growth with a proven model. In addition, the company operates a network of national classified advertising under the autocasion.com, autoscout24.es, and pisos.com brands. Further, it engages in the press printing and distribution activities; sale of printed and digital advertising and contents; sale of supplement and magazine; and design of campaigns and organization of food fairs and events. The company was formerly known as Grupo Correo Prensa Española, S.A. and changed its name to Vocento, S.A. in May 2003. Vocento, S.A. was founded in 1854 and is headquartered in Bilbao, Spain."}, {"name": "ZARDOYA OTIS SA", "ticker": "ZOT.mc", "sector": "Industrials", "description": "Zardoya Otis, S.A., together with its subsidiaries, manufactures, installs, and maintains elevators, and escalators and moving walkways worldwide. It also exports its products. The company was incorporated in 1934 and is based in Madrid, Spain. Zardoya Otis, S.A. is a subsidiary of Otis Worldwide Corporation."}]