[{"name": "Absolute Software Corporation", "ticker": "ABST.TO", "sector": "Technology", "description": "Absolute Software Corporation develops, markets, and provides cloud-based endpoint visibility and control platform for the management and security of computing devices, applications, and data for enterprise and public sector organizations. The company offers the Absolute platform to provide the connectivity, visibility, and control of data and devices of the operating system; to recover automatically to a secure operational state without user intervention; to support various other security controls and productivity tools from decay and vulnerabilities; and to enable measurement of the health, compliance, and state of decay of endpoint security controls and productivity tools self-healing if the application becomes uninstalled or broken. It also provides customer support, professional services, investigation services, support and education, and customer programs. The company markets its solutions through device original equipment manufacturers, distributors, and value added resellers, as well as directly to corporations, government agencies, educational institutions, financial services, healthcare sectors, and consumers. It operates in North America, Europe, and Africa, as well as the Asia-Pacific and Latin American regions. Absolute Software Corporation was incorporated in 1993 and is headquartered in Vancouver, Canada."}, {"name": "Barrick Gold Corporation", "ticker": "ABX.TO", "sector": "Basic Materials", "description": "Barrick Gold Corporation engages in the exploration, mine development, production, and sale of gold and copper properties. It has ownership interests in producing gold mines that are located in Argentina, Canada, Côte d'Ivoire, the Democratic Republic of Congo, Dominican Republic, Mali, Tanzania, and the United States. The company also has ownership interests in producing copper mines located in Chile, Saudi Arabia, and Zambia; and various other projects located throughout the Americas and Africa. Barrick Gold Corporation was founded in 1983 and is headquartered in Toronto, Canada."}, {"name": "Aurora Cannabis Inc.", "ticker": "ACB.TO", "sector": "Healthcare", "description": "Aurora Cannabis Inc. produces, distributes, and sells cannabis and cannabis derivative products in Canada and internationally. It also engages in facility engineering and design, cannabis breeding, research, production, derivatives, product development, wholesale, and retail distribution activities. The company produces various strains of dried cannabis, cannabis oil and capsules, and topical kits for medical patients. It also sells vaporizers; consumable vaporizer accessories; and herb mills for using CanniMed herbal cannabis products, as well as grinders and vaporizer lockable containers. In addition, the company engages in the development of medical cannabis products at various stages of development, including oral, topical, edible, and inhalable products; and operation of CanvasRX, a network of cannabis counseling and outreach centers. Further, it provides patient counselling services; design and construction services; and cannabis analytical product testing services. The company's brand portfolio includes Aurora, Aurora Drift, San Rafael '71, Daily Special, AltaVie, MedReleaf, CanniMed, Whistler, Woodstock, and WMMC. Aurora Cannabis Inc. is headquartered in Edmonton, Canada."}, {"name": "Agnico Eagle Mines Limited", "ticker": "AEM.TO", "sector": "Basic Materials", "description": "Agnico Eagle Mines Limited engages in the exploration, development, and production of mineral properties in Canada, Mexico, and Finland. It operates through Northern Business and Southern Business segments. The company primarily produces and sells gold deposits, as well as explores for silver, zinc, and copper deposits. Its flagship property is the LaRonde mine located in the Abitibi region of northwestern Quebec, Canada. As of December 31, 2021, the company's LaRonde mine had proven and probable mineral reserves of approximately 3.0 million ounces of gold. It is also involved in exploration activities in Europe, Latin America, and the United States. The company was incorporated in 1953 and is headquartered in Toronto, Canada."}, {"name": "AEterna Zentaris Inc.", "ticker": "AEZS.TO", "sector": "Healthcare", "description": "Aeterna Zentaris Inc., a specialty biopharmaceutical company, engages in developing and commercializing therapeutics and diagnostic tests. Its lead product is macimorelin, an orally available peptidomimetic ghrelin receptor (GHSR-1a) agonist that stimulates the secretion of growth hormone by binding to the GHSR-1a for the diagnosis of adult growth hormone deficiency and childhood-onset growth hormone deficiency, as well as oncology indications. The company markets macimorelin under the Macrilen brand name. Aeterna Zentaris Inc. has a license agreement with University Wuerzburg to research, develop, manufacture, and sell a potential COVID-19 vaccine; development, manufacture, and commercialization of the treatment for neuromyelitis optica spectrum disorder; and to develop human 3D intestinal tissue models to study infection biology; and for pre-clinical development towards the potential treatment of Parkinson's disease. It also has a license agreement with Consilient Health Ltd., Novo Nordisk Novo Nordisk Health Care AG, and NK MEDITECH Ltd. for the development and commercialization of macimorelin in the United States and Canada, as well as The University of Sheffield, the United Kingdom for the research, development, manufacture, and commercialization of parathyroid hormone fusion polypeptides for the treatment of primary hypoparathyroidism. Aeterna Zentaris Inc. was incorporated in 1990 and is headquartered in Summerville, South Carolina."}, {"name": "Alamos Gold Inc.", "ticker": "AGI.TO", "sector": "Basic Materials", "description": "Alamos Gold Inc., together with its subsidiaries, engages in the acquisition, exploration, development, and extraction of precious metals in Canada, Mexico, the United States, and Turkey. It primary explores for gold and silver. The company's flagship project is the Young-Davidson mine, which includes contiguous mineral leases and claims totaling 5,587 hectares located in Matachewan in the Northern Ontario, Canada. It also holds 100% interest in the Island Gold mine, which comprises approximately 15,000 hectares located in the Ontario, Canada. The company was formerly known as AuRico Gold Inc. and changed its name to Alamos Gold Inc. in July 2015. Alamos Gold Inc. was founded in 2003 and is headquartered in Toronto, Canada."}, {"name": "Almonty Industries Inc.", "ticker": "AII.TO", "sector": "Basic Materials", "description": "Almonty Industries Inc. engages in mining, processing, and shipping tungsten concentrate. It owns interests in the Los Santos mine located near Salamanca, Spain; the Panasqueira tin and tungsten mine situated in Covilha and Castelo Branco, Portugal; the Sangdong tungsten mine located in Gangwon Province, Republic of Korea; and the Valtreixal tin and tungsten project located in Zamora province, Western Spain. Almonty Industries Inc. is headquartered in Toronto, Canada."}, {"name": "Allkem Limited", "ticker": "AKE.TO", "sector": "Basic Materials", "description": "Allkem Limited engages in the exploration, development, and production of lithium and boron in Argentina. The company's flagship project is the Olaroz Lithium Facility located in Jujuy province in northern Argentina. Allkem Limited was incorporated in 2005 and is based in Brisbane, Australia."}, {"name": "Akumin Inc.", "ticker": "AKU.TO", "sector": "Healthcare", "description": "Akumin Inc. provides outpatient diagnostic imaging services in the United States. It operates in two segments, Radiology and Oncology. The company offers various medical imaging services, including magnetic resonance imaging, computed tomography, positron emission tomography, nuclear medicine, mammography, ultrasound, digital radiography, fluoroscopy, and other diagnostic or interventional radiology procedures through a network of approximately 200 owned and/or operated imaging locations. It provides outpatient radiology, and oncology services and solutions to approximately 1,000 hospitals and health systems across 46 states. Akumin Inc. was founded in 2015 and is headquartered in Plantation, Florida."}, {"name": "Alithya Group Inc. ", "ticker": "ALYA.TO", "sector": "Technology", "description": "Alithya Group Inc. provides strategy and digital technology services in Canada, the United States, and Europe. The company's business strategy services include strategic consulting, digital transformation, organizational performance, and enterprise architecture services. It also provides application services, such as digital applications DevOps, legacy systems modernization, control and software engineering, cloud infrastructure, quality assurance, and automated testing; enterprise solutions comprising enterprise resource planning, corporate performance management, customer relationship management, and human capital management; and data and analytics solutions, including business intelligence, data management, artificial intelligence (AI), and machine learning, as well as internet of things. In addition, the company provides AI-FI, an integrated artificial intelligence and fidelity solution; Alithya GoTest, solution allows clients to test the functionality of applications on various platforms; CASSI analytics for online weekly maintenance, outage management, petrochemical turnarounds, and maintenance and reliability; and SIDER, a secure solution that facilitates distribution of medical results to healthcare sectors and to centralized electronic medical records. It serves financial services, energy, manufacturing, telecommunications, transportation and logistics, professional services, healthcare, and government sectors. Alithya Group Inc. was founded in 1992 and is headquartered in Montreal, Canada."}, {"name": "Almaden Minerals Ltd.", "ticker": "AMM.TO", "sector": "Basic Materials", "description": "Almaden Minerals Ltd., an exploration stage company, engages in the acquisition, exploration, evaluation, and development of mineral properties. It primarily owns a 100% interest in the Ixtaca gold-silver project located in Puebla State, Mexico. The company was incorporated in 1980 and is headquartered in Vancouver, Canada."}, {"name": "Africa Oil Corp.", "ticker": "AOI.TO", "sector": "Energy", "description": "Africa Oil Corp., together with its subsidiaries, operates as an oil and gas exploration and development company in Kenya, Nigeria, and South Africa. The company holds interests in producing and development assets in deep-water Nigeria and development assets in Kenya. It also has a portfolio of exploration assets in Guyana, Kenya, Namibia, Nigeria, South Africa, Ethiopia, and in the Senegal Guinea Bissau Joint Development Zone. The company was formerly known as Canmex Minerals Corporation and changed its name to Africa Oil Corp. in August 2007. Africa Oil Corp. was incorporated in 1983 and is headquartered in Vancouver, Canada."}, {"name": "Aptose Biosciences Inc.", "ticker": "APS.TO", "sector": "Healthcare", "description": "Aptose Biosciences Inc., a clinical-stage biotechnology company, discovers and develops personalized therapies addressing unmet medical needs in oncology primarily in the United States. Its clinical programs include APTO-253, which is in Phase 1a/b clinical trial for the treatment of patients with relapsed or refractory blood cancers, including acute myeloid leukemia (AML) and high-risk myelodysplastic syndrome (HR MDS); and HM43239 that is in Phase 1/2 clinical trial to treat patients with relapsed or refractory AML. The company also develops luxeptinib, which is in Phase 1a/b clinical trial for treating patients with relapsed or refractory B-cell malignancies, including chronic lymphocytic leukemia, small lymphocytic lymphoma, and various non-Hodgkin's lymphomas, as well as AML and HR MDS; and APL-581, a dual bromodomain and extra-terminal domain motif protein and kinase inhibitor program. It has agreements with CrystalGenomics, Inc. and OHM Oncology. The company was formerly known as Lorus Therapeutics Inc. and changed its name to Aptose Biosciences Inc. in August 2014. Aptose Biosciences Inc. was incorporated in 1986 and is headquartered in Toronto, Canada."}, {"name": "Anglo Pacific Group PLC", "ticker": "APY.TO", "sector": "Basic Materials", "description": "Anglo Pacific Group plc operates as a natural resources royalty and streaming company. The company has royalties and investments in mining and exploration interests in cobalt, coking coal, iron ore, copper, vanadium, uranium, and gold primarily in Australia, North and South America, and Europe. Anglo Pacific Group plc was incorporated in 1967 and is headquartered in London, the United Kingdom."}, {"name": "Algonquin Power & Utilities Corp.", "ticker": "AQN.TO", "sector": "Utilities", "description": "Algonquin Power & Utilities Corp., through its subsidiaries, owns and operates a portfolio of regulated and non-regulated generation, distribution, and transmission utility assets in Canada, the United States, Chile, and Bermuda. It generates and sells electrical energy through renewable and clean energy power generation facilities. The company also owns and operates hydroelectric, wind, solar, and thermal facilities with generating capacity of approximately 2.3 gigawatt; and regulated electric, natural gas, water distribution, and wastewater collection utility systems. As of December 31, 2021, it serves approximately 307,000 electric connections; 373,000 natural gas connections; and 413,000 regulated water distribution and wastewater collection utility systems. The company was incorporated in 1988 and is headquartered in Oakville, Canada."}, {"name": "Avino Silver & Gold Mines Ltd.", "ticker": "ASM.TO", "sector": "Basic Materials", "description": "Avino Silver & Gold Mines Ltd., together with its subsidiaries, engages in the acquisition, exploration, and advancement of mineral properties in Canada. It primarily explores for silver, gold, and copper deposits. The company owns interests in 42 mineral claims and four leased mineral claims, including Avino mine area property comprising four exploration concessions covering 154.4 hectares, 24 exploitation concessions covering 1,284.7 hectares, and one leased exploitation concession covering 98.83 hectares; Gomez Palacio property consists of nine exploration concessions covering 2,549 hectares; Santiago Papasquiaro property comprises four exploration concessions covering 2,552.6 hectares and one exploitation concession covering 602.9 hectares; and Unification La Platosa properties, which include three leased concessions located in the state of Durango, Mexico. It also owns 100% interests in the Minto and Olympic-Kelvin properties located in British Columbia, Canada; and 14 quartz leases in Eagle property located in the Mayo Mining Division of Yukon, Canada. The company was incorporated in 1968 and is headquartered in Vancouver, Canada."}, {"name": "Algoma Steel Group Inc. ", "ticker": "ASTL.TO", "sector": "Basic Materials", "description": "Algoma Steel Group Inc. produces and sells steel products primarily in North America. It provides flat/sheet steel products, including temper rolling, cold rolled, hot-rolled pickled and oiled products, floor plate, and cut-to-length products for the automotive industry, hollow structural product manufacturers, and the light manufacturing and transportation industries; and plate steel products that consist of rolled, hot-rolled, and heat-treated for use in the construction or manufacture of railcars, buildings, bridges, off-highway equipment, storage tanks, ships, and military applications. Algoma Steel Group Inc. was founded in 1901 and is headquartered in Sault Ste. Marie, Canada."}, {"name": "AcuityAds Holdings Inc.", "ticker": "AT.TO", "sector": "Communication Services", "description": "AcuityAds Holdings Inc., a technology company, provides digital media solutions. The company offers a programmatic marketing platform that enables advertisers to connect with their audiences across online display, video, social, and mobile campaigns. Its platform also allows advertisers to manage their purchasing of online display advertising in real-time using programmatic ad buying. The company serves Fortune 500 enterprises and small to mid-sized businesses in the United States, Canada, Europe, the Middle East, and Africa. AcuityAds Holdings Inc. is headquartered in Toronto, Canada."}, {"name": "Golden Minerals Company", "ticker": "AUMN.TO", "sector": "Basic Materials", "description": "Golden Minerals Company, a precious metals exploration company, mines, constructs, and explores for mineral properties containing precious metals. It explores for gold, silver, zinc, lead, and other minerals. The company holds a 100% interest in the Rodeo gold mine situated in Durango State, Mexico; and a 100% interest in the Velardeña and Chicago gold-silver mining properties and associated oxide and sulfide processing plants located in the State of Durango, Mexico. It also holds a 100% interest in the El Quevar advanced exploration silver property situated in the province of Salta, Argentina; and diversified portfolio of precious metals and other mineral exploration properties located in Argentina, Nevada, and Mexico. The company was formerly known as Apex Silver Mines Limited and changed its name to Golden Minerals Company in March 2009. Golden Minerals Company was founded in 1996 and is headquartered in Golden, Colorado."}, {"name": "Alexco Resource Corp.", "ticker": "AXU.TO", "sector": "Basic Materials", "description": "Alexco Resource Corp. engages in the mineral exploration, evaluation, development, and operational activities primarily in Yukon Territory, Canada. The company explores for silver, lead, zinc, and gold deposits. It owns interests in the majority of the historic Keno Hill Silver District project that comprises the Flame & Moth, Bermingham, Lucky Queen, Bellekeno, and Onek deposits, as well as 722 quartz mining leases, 873 quartz claims, 24 placer mining claims, 1 quartz mining license and 50% of 3 quartz mining leases, 2 crown grants, and 6 fee simple lots and 7 surface leases located in Yukon Territory. Alexco Resource Corp. was incorporated in 2004 and is headquartered in Vancouver, Canada."}, {"name": "Atalaya Mining plc", "ticker": "AYM.TO", "sector": "Basic Materials", "description": "Atalaya Mining Plc, together with its subsidiaries, engages in the mineral exploration and development in Spain. The company's flagship property is its 100% owned Proyecto Riotinto mine, an open-pit copper mine located in the Andalusia region of Spain. It produces copper concentrates, including silver by-products. The company was formerly known as EMED Mining Public Limited and changed its name to Atalaya Mining Plc in October 2015. Atalaya Mining Plc was incorporated in 2004 and is based in Nicosia, Cyprus."}, {"name": "Brookfield Asset Management Reinsurance Partners Ltd.", "ticker": "BAMR.TO", "sector": "Financial Services", "description": "Brookfield Asset Management Reinsurance Partners Ltd., through its subsidiaries, provides annuity-based reinsurance products to insurance and reinsurance companies. The company operates in two segments, Reinsurance and Pension Risk Transfer. It also acts as a direct issuer of pension risk transfer products for pension plan sponsors. The company was incorporated in 2020 and is headquartered in Pembroke, Bermuda."}, {"name": "BlackBerry Limited", "ticker": "BB.TO", "sector": "Technology", "description": "BlackBerry Limited provides intelligent security software and services to enterprises and governments worldwide. The company operates through three segments: Cybersecurity, IoT, and Licensing and Other. The company offers BlackBerry Cyber Suite, which provides Cylance AI and machine learning-based cybersecurity solutions, including BlackBerry Protect, an EPP and available MTD solution; BlackBerry Optics, an EDR solution that provides visibility into and prevention of malicious activity; BlackBerry Guard, a managed detection and response solution; BlackBerry Gateway, an AI-empowered ZTNA solution; and BlackBerry Persona, a UEBA solution that provides authentication by validating user identity in real time. It also provides BlackBerry Spark Unified Endpoint Management Suite, such as BlackBerry UEM, a central software component of its secure communications platform; BlackBerry Dynamics that provides a development platform and secure container for mobile applications; BlackBerry AtHoc and BlackBerry Alert secure and networked critical event management solutions; and SecuSUITE for Government, a multi-OS voice and text messaging solution, as well as BBM Enterprise, an enterprise-grade secure instant messaging solution. In addition, the company offers BlackBerry QNX, which provides Neutrino operating system and BlackBerry QNX CAR platform, and other products; BlackBerry QNX, an embedded system solution; BlackBerry Jarvis, a cloud-based binary static application security testing platform; BlackBerry Certicom cryptography and management products, and BlackBerry Radar asset monitoring solution; and BlackBerry IVY, an intelligent vehicle data platform, as well as enterprise and cybersecurity consulting services. Further, it is involved in the patent licensing and legacy service access fees business. As of February 28, 2022, it owned approximately 38,000 worldwide patents and applications. BlackBerry Limited was incorporated in 1984 and is headquartered in Waterloo, Canada."}, {"name": "Brookfield Business Corporation", "ticker": "BBUC.TO", "sector": "Financial Services", "description": "Brookfield Business Corporation focuses on healthcare, construction, and wastewater services in the United States, Europe, Australia, the United Kingdom, Canada, and Brazil. It operates through three segments: Business Services, Infrastructure Services, and Industrials. The company operates 42 hospitals; offers construction services for office, residential, hospitality and leisure, social infrastructure, retail, and mixed-use properties; and provides nuclear technology services, such as fuel, maintenance services, engineering solutions, instrumentation and control systems, and manufactured components for nuclear power plants. It also engages in the collection, treatment, and distribution of water and wastewater to the residential and governmental customers. The company was incorporated in 2021 and is headquartered in New York, New York."}, {"name": "BCE Inc.", "ticker": "BCE.TO", "sector": "Communication Services", "description": "BCE Inc. operates as a telecommunications and media company in Canada. The company offers wireless, wireline, Internet, and television (TV) services to residential, business, and wholesale customers. It operates through three segments: Bell Wireless, Bell Wireline, and Bell Media. The Bell Wireless segment provides wireless voice and data communication products and services, and consumer electronics products. The Bell Wireline segment offers data, including internet access and Internet protocol television (IPTV), local telephone, long distance, as well as other communication services and products. This segment also buys and sells local telephone, long distance, data, and other services from or to resellers and other carriers. The Bell Media segment provides conventional TV, specialty TV, pay TV, streaming services, digital media services, radio broadcasting services, and out-of-home (OOH) advertising services. It owns and operates 35 conventional TV stations; 27 specialty channels and four Pay TV services; four direct-to-consumer streaming services; 109 licensed radio stations; and websites. The company was formerly known as Bell Canada Enterprises Inc. BCE Inc. was incorporated in 1970 and is headquartered in Verdun, Canada."}, {"name": "BriaCell Therapeutics Corp.", "ticker": "BCT.TO", "sector": "Healthcare", "description": "BriaCell Therapeutics Corp., an immuno-oncology biotechnology company, engages in developing immunotherapies for the treatment of cancer. Its lead candidate is Bria-IMT that is in Phase I/IIa clinical trial in a combination study with immune checkpoint inhibitors for the treatment of breast cancer. The company also has a cooperative research and development agreement with the National Cancer Institute for developing Bria-OTS, a personalized immunotherapy for advanced breast cancer; and BriaDx, a diagnostic test. BriaCell Therapeutics Corp. is headquartered in West Vancouver, Canada."}, {"name": "Brookfield Renewable Corporation", "ticker": "BEPC.TO", "sector": "Utilities", "description": "Brookfield Renewable Corporation owns and operates a portfolio of renewable energy power generating facilities primarily in the United States, Europe, Colombia, and Brazil. It operates hydroelectric, wind, and solar power plants with an installed capacity of approximately 12,723 megawatts. The company was incorporated in 2019 and is headquartered in New York, New York."}, {"name": "Bausch Health Companies Inc.", "ticker": "BHC.TO", "sector": "Healthcare", "description": "Bausch Health Companies Inc., together with its subsidiaries, develops, manufactures, and markets a range of pharmaceutical, medical device, and over-the-counter (OTC) products primarily in the therapeutic areas of eye health, gastroenterology, and dermatology. The company operates through five segments: Bausch + Lomb, Salix, International Rx, Ortho Dermatologics, and Diversified Products. The Bausch + Lomb segment offers products with a focus on the vision care, surgical, and consumer, surgical, and ophthalmic pharmaceuticals products. The Salix segment provides gastroenterology products in the United States. The International Rx segment offers Solta products, branded and generic pharmaceutical products, OTC products, and medical device products, and Bausch + Lomb products in Canada, Europe, Asia, Australia, Latin America, Africa, and the Middle East. The Ortho Dermatologics segment provides dermatological products in the United States; and Solta medical aesthetic devices internationally. The Diversified Products segment offers pharmaceutical products in the areas of neurology and other therapeutic classes, as well as generic and dentistry products in the United States. The company was formerly known as Valeant Pharmaceuticals International, Inc. and changed its name to Bausch Health Companies Inc. in July 2018. Bausch Health Companies Inc. is headquartered in Laval, Canada."}, {"name": "Brookfield Infrastructure Corporation", "ticker": "BIPC.TO", "sector": "Utilities", "description": "Brookfield Infrastructure Corporation, together with its subsidiaries, owns and operates regulated natural gas transmission systems in Brazil. The company also engages in the regulated gas and electricity distribution operations in the United Kingdom; and electricity transmission and distribution, as well as gas distribution in Australia. It operates approximately 2,000 kilometers of natural gas transportation pipelines in the states of Rio de Janeiro, Sao Paulo, and Minas Gerais; 3.9 million gas and electricity connections; and 61,000 kilometers of operational electricity transmission and distribution lines in Australia. The company was incorporated in 2019 and is headquartered in New York, New York. Brookfield Infrastructure Corporation is a subsidiary of Brookfield Infrastructure Partners L.P."}, {"name": "Bitfarms Ltd.", "ticker": "BITF.TO", "sector": "Financial Services", "description": "Bitfarms Ltd. engages in the mining of cryptocurrency coins and tokens in North America. It owns and operates server farms that primarily validates transactions on the Bitcoin Blockchain and earning cryptocurrency from block rewards and transaction fees. The company also provides electrician services to commercial and residential customers in Quebec, Canada. It also undertakes hosting of third-party mining hardware. The company was founded in 2017 and is headquartered in Toronto, Canada."}, {"name": "Ballard Power Systems Inc.", "ticker": "BLDP.TO", "sector": "Industrials", "description": "Ballard Power Systems Inc. engages in the design, development, manufacture, sale, and service of proton exchange membrane (PEM) fuel cell products. The company offers its products for power product markets, consisting of heavy-duty motives, such as bus, truck, rail, and marine applications; material handling; and backup power. It also provides technology solutions, including engineering and technology transfer, as well as licenses and sells intellectual property portfolio and fundamental knowledge for various PEM fuel cell applications; and hydrogen fuel cell powertrain and vehicle systems integration solutions. It operates in China, Germany, the United States, the United Kingdom, Canada, Denmark, Norway, Belgium, Japan, France, Spain, Taiwan, Poland, India, Ukraine, Sweden, and internationally. The company has a strategic alliance with Linamar Corporation for the co-development and sale of fuel cell powertrains and components for class 1 and 2 vehicles in North America and Europe. Ballard Power Systems Inc. was founded in 1979 and is headquartered in Burnaby, Canada."}, {"name": "BELLUS Health Inc.", "ticker": "BLU.TO", "sector": "Healthcare", "description": "BELLUS Health Inc., a clinical stage biopharmaceutical company, develops therapeutics for the treatment of refractory chronic cough (RCC) and other cough hypersensitivity indications. Its lead product candidate includes BLU-5937, an antagonist of the P2X3 receptor, which is in Phase II clinical trial for treatment of RCC and chronic pruritus. The company was incorporated in 1993 and is based in Laval, Canada."}, {"name": "Bank of Montreal", "ticker": "BMO.TO", "sector": "Financial Services", "description": "Bank of Montreal provides diversified financial services primarily in North America. The company's personal banking products and services include checking and savings accounts, credit cards, mortgages, and financial and investment advice services; and commercial banking products and services comprise business deposit accounts, commercial credit cards, business loans and commercial mortgages, cash management solutions, foreign exchange, specialized banking programs, treasury and payment solutions, and risk management products for small business and commercial banking customers. It also offers investment and wealth advisory services; digital investing services; financial services and solutions; and investment management, and trust and custody services. In addition, the company provides life insurance, accident and sickness insurance, and annuity products; creditor and travel insurance to bank customers; and reinsurance solutions. Further, it offers client's debt and equity capital-raising services, as well as loan origination and syndication, and treasury management; strategic advice on mergers and acquisitions, restructurings, and recapitalizations, as well as valuation and fairness opinions; and trade finance, risk mitigation, and other operating services. Additionally, the company provides research and access to markets for institutional, corporate, and retail clients; trading solutions that include debt, foreign exchange, interest rate, credit, equity, securitization and commodities; new product development and origination services, as well as risk management advice and services to hedge against fluctuations; and funding and liquidity management services to its clients. It operates through approximately 900 bank branches and 3,300 automated banking machines in Canada and the United States. Bank of Montreal was founded in 1817 and is headquartered in Montreal, Canada."}, {"name": "Bank of Nova Scotia (The)", "ticker": "BNS.TO", "sector": "Financial Services", "description": "The Bank of Nova Scotia provides various banking products and services in Canada, the United States, Mexico, Peru, Chile, Colombia, the Caribbean and Central America, and internationally. It operates in four segments: Canadian Banking, International Banking, Global Wealth Management, and Global Banking and Markets. The company offers financial advice and solutions, and day-to-day banking products, including debit and credit cards, chequing and saving accounts, investments, mortgages, loans, and insurance to individuals; and business banking solutions comprising lending, deposit, cash management, and trade finance solutions to small, medium, and large businesses, including automotive financing solutions to dealers and their customers. It also provides wealth management advice and solutions, including online brokerage, mobile investment, full-service brokerage, trust, private banking, and private investment counsel services; and retail mutual funds, exchange traded funds, liquid alternative funds, and institutional funds. In addition, the company offers international banking services for retail, corporate, and commercial customers; and lending and transaction, investment banking advisory, and capital markets access services to corporate customers. Further, it provides online, mobile, and telephone banking services. The company operates a network of 954 branches and approximately 3,766 automated banking machines in Canada; and approximately 1,300 branches and a network of contact and support center internationally. The Bank of Nova Scotia was founded in 1832 and is headquartered in Halifax, Canada."}, {"name": "Bragg Gaming Group Inc.", "ticker": "BRAG.TO", "sector": "Communication Services", "description": "Bragg Gaming Group Inc. operates as a technology and content supplier to the gaming industry worldwide. The company provides business-to-business online gaming solutions. It offers a range of games, including slot, table, card, video bingo, scratch card, and live dealer games, as well as virtual sports. The company also provides managed operational and marketing services to its iGaming operator customers to complete its turnkey gaming solution. It offers proprietary third-party gaming content, which delivers through a single integrated platform. The company also holds various content distribution rights through partnerships with selected third-party studios. Bragg Gaming Group Inc. is headquartered in Toronto, Canada."}, {"name": "Baytex Energy Corp.", "ticker": "BTE.TO", "sector": "Energy", "description": "Baytex Energy Corp., an oil and gas company, acquires, develops, and produces oil and natural gas in the Western Canadian Sedimentary Basin and in the Texas, the United States. The company offers light oil and condensate, heavy oil, natural gas liquids, and natural gas. Its principal oil and natural gas properties comprise the Eagle Ford property in Texas, Viking and Lloydminster properties in Alberta and Saskatchewan, Peace River and Duvernay properties in Alberta. The company's properties also include conventional oil and natural gas assets in Western Canada. As of December 31, 2021, it had proved developed producing reserves of 129 million barrels of oil equivalent (mmboe); proved reserves of 278 mmboe; and proved plus probable reserves of 451 mmboe. Baytex Energy Corp. was founded in 1993 and is headquartered in Calgary, Canada."}, {"name": "B2Gold Corp.", "ticker": "BTO.TO", "sector": "Basic Materials", "description": "B2Gold Corp. operates as a gold producer with three operating mines in Mali, the Philippines, and Namibia. It operates the Fekola Mine in Mali, the Masbate Mine in the Philippines, and the Otjikoto Mine in Namibia. The company also has an 25% interest in the Calibre Mining Corp.; and approximately 19% interest in BeMetals Corp. In addition, it has a portfolio of other evaluation and exploration assets in Mali, Uzbekistan, and Finland. The company was incorporated in 2006 and is headquartered in Vancouver, Canada."}, {"name": "Burcon NutraScience Corporation", "ticker": "BU.TO", "sector": "Consumer Defensive", "description": "Burcon NutraScience Corporation, together with its subsidiaries, develops plant proteins and ingredients for use in the food and beverage industries in Canada. Its products include Peazazz, a pea protein for dairy alternative products, such as protein bars and crisps, weight management and meal replacement products, and vegetarian and vegan foods, as well as dry blended and ready-to-drink beverages; and Peazac, a pea protein for plant-based meat alternative products, ready-to-mix powders and beverages, dairy alternatives, nutrition bars, and other applications. The company also provides Puratein, a canola protein isolate for use in meat alternatives, such as burgers, sausages, and nutrition bars; Supertein, a canola protein that is a light colored powder for use in non-dairy frozen desserts, egg alternative, plant-based marshmallows and ready-to-mix beverages, whipped toppings, and plant based bars; and Nutratein, a canola protein comprising a mixture of globulin and albumin proteins for use in meat and egg alternatives, and other plant-based functional foods. In addition, it offers Nutratein-PS, a blend of Peazazz pea protein and Supertein canola protein for use in dairy alternative beverages; Nutratein-TZ, a blend of Peazac pea protein and Puratein canola protein for use in plant-based burgers or sausages; and CLARISOY, a soy protein for use in sports nutrition beverages, dairy alternative yogurts and cheeses, powdered beverage mixes, coffee creamers, and other foods and nutritional products. Further, the company provides MeritPro, a nutritional protein blend, including allergen-free, gluten-free, non-dairy, non-GMO, and vegan. The company was formerly known as Burcon Capital Corp. and changed its name to Burcon NutraScience Corporation in October 1999. Burcon NutraScience Corporation was incorporated in 1998 and is headquartered in Vancouver, Canada."}, {"name": "CAE Inc.", "ticker": "CAE.TO", "sector": "Industrials", "description": "CAE Inc., together with its subsidiaries, designs, manufactures, and supplies simulation equipment and training solutions to defense and security markets, commercial airlines, business aircraft operators, helicopter operators, aircraft manufacturers, and healthcare education and service providers worldwide. The company's Civil Aviation Training Solutions segment provides training solutions for flight, cabin, maintenance, and ground personnel in commercial, business, and helicopter aviation; flight simulation training devices; and ab initio pilot training and crew sourcing services, as well as end to end digitally-enabled crew management, training operations solutions, and optimization software. Its Defence and Security segment offers training and mission support solutions for defense forces across multi-domain operations, and for government organizations responsible for public safety. The company's Healthcare segment provides integrated education and training solutions, including surgical and imaging simulations, curriculum, audiovisual and centre management platforms, and patient simulators to healthcare students and clinical professionals. It has a strategic partnership with Volocopter GmbH to develop, certify, and deploy a pilot training program for electric vertical takeoff and landing operations. The company was formerly known as CAE Industries Ltd. and changed its name to CAE Inc. in June 1993. CAE Inc. was founded in 1947 and is headquartered in Saint-Laurent, Canada."}, {"name": "Cameco Corporation", "ticker": "CCO.TO", "sector": "Energy", "description": "Cameco Corporation produces and sells uranium. It operates through two segments, Uranium and Fuel Services. The Uranium segment is involved in the exploration for, mining, and milling, as well as purchase and sale of uranium concentrate. The Fuel Services segment engages in the refining, conversion, and fabrication of uranium concentrate, as well as the purchase and sale of conversion services. This segment also produces fuel bundles or reactor components for CANDU reactors. The company sells its uranium and fuel services to nuclear utilities in the Americas, Europe, and Asia. Cameco Corporation was incorporated in 1987 and is headquartered in Saskatoon, Canada."}, {"name": "Ceridian HCM Holding Inc.", "ticker": "CDAY.TO", "sector": "Technology", "description": "Ceridian HCM Holding Inc., together with its subsidiaries, operates as a human capital management (HCM) software company in the United States, Canada, and internationally. It offers Dayforce, a cloud HCM platform that provides human resources (HR), payroll, benefits, workforce management, and talent management functionality; and Powerpay, a cloud HR and payroll solution for the small business market. The company also provides Bureau solutions for payroll and payroll-related services. It sells its solutions through direct sales force and third-party channels. The company was incorporated in 2013 and is headquartered in Minneapolis, Minnesota."}, {"name": "Centamin plc", "ticker": "CEE.TO", "sector": "Basic Materials", "description": "Centamin plc engages in the exploration, mining, and development of precious metals in Egypt, Burkina Faso, Côte d'Ivoire, Jersey, the United Kingdom, and Australia. The company explores for gold deposits. Its principal asset is the Sukari Gold Mine project, which covers an area of approximately 160 square kilometers located in the Eastern Desert of Egypt. The company was incorporated in 2011 and is headquartered in Saint Helier, Jersey."}, {"name": "Sprott Physical Gold and Silver Trust", "ticker": "CEF.TO", "sector": "Financial Services", "description": "Sprott Physical Gold and Silver Trust is an exchange traded commodity launched and managed by Sprott Asset Management, LP. The fund invests in commodity markets. It invests in London Good Delivery physical gold and silver bullion. Sprott Physical Gold and Silver Trust was formed on October 26, 2017 and is domiciled in Canada."}, {"name": "Centerra Gold Inc.", "ticker": "CG.TO", "sector": "Basic Materials", "description": "Centerra Gold Inc., a gold mining company, engages in the acquisition, exploration, development, and operation of gold and copper properties in North America, Turkey, and internationally. The company explores for gold, copper, and molybdenum deposits. Its flagship projects include the 100% owned Mount Milligan gold-copper mine located in British Columbia, Canada; and the Öksüt Gold Mine located in Turkey. The company was incorporated in 2002 and is headquartered in Toronto, Canada."}, {"name": "China Gold International Resources Corp. Ltd.", "ticker": "CGG.TO", "sector": "Basic Materials", "description": "China Gold International Resources Corp. Ltd., a gold and base metal mining company, acquires, explores for, develops, and mines mineral properties in the People's Republic of China. It primarily holds 96.5% interest in the Chang Shan Hao gold mine covering an area of 36 square kilometers in the western part of Inner Mongolia, northern China; and 100% interest in the Jiama copper-gold polymetallic mine that hosts copper, gold, molybdenum, silver, lead, and zinc metals located in Metrokongka County, Tibet. The company was formerly known as Jinshan Gold Mines Inc. China Gold International Resources Corp. Ltd. was incorporated in 2000 and is headquartered in Vancouver, Canada."}, {"name": "Canadian General Investments Limited", "ticker": "CGI.TO", "sector": "Financial Services", "description": "Canadian General Investments, Limited is a close ended equity mutual fund launched and managed by Morgan Meighen & Associates Limited. It invests in the public equity markets of Canada. The fund seeks to invest in stocks of companies operating across diversified sectors. It invests in stocks of companies across all market capitalization. The fund employs fundamental analysis with a bottom-up stock picking approach focusing on timely recognition of capital gains and appropriate income generating instruments to create its portfolio. It benchmarks the performance of its portfolio against the S&P/TSX Composite Index. Canadian General Investments, Limited was formed on January 15, 1930 and is domiciled in Ontario, Canada."}, {"name": "Champion Iron Limited", "ticker": "CIA.TO", "sector": "Basic Materials", "description": "Champion Iron Limited engages in the acquisition, exploration, development, and production of iron ore deposits in Canada. Its flagship projects include the Bloom Lake Mine located in south end of the Labrador; and the Consolidated Fire Lake North project that includes the Fire Lake North, Don Lake, Bellechasse, and Oil Can deposits situated in northeastern Quebec. The company also holds interest in Kami iron ore project located in the Labrador. It sells its iron ore concentrate in China, Japan, the Middle East, Europe, South Korea, India, Canada, and internationally. Champion Iron Limited is headquartered in Rozelle, Australia."}, {"name": "Colliers International Group Inc.", "ticker": "CIGI.TO", "sector": "Real Estate", "description": "Colliers International Group Inc. provides commercial real estate professional and investment management services to corporate and institutional clients in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It offers sales brokerage services, including real estate sales, debt origination and placement, equity capital raising, market value opinions, acquisition advisory, and transaction management services; and landlord and tenant representation services. The company provides outsourcing and advisory services, such as corporate and workplace solutions; valuation and advisory services; workplace strategy services; loan servicing; property marketing; research services; and engineering design services for property and building, infrastructure, transportation, environmental and telecommunications end-markets. It also offers property management services comprising building operations and maintenance, facilities management, lease administration, property accounting and financial reporting, contract management and, construction management; and project management services, which include bid document review, construction monitoring and delivery management, contract administration and integrated cost control, development management, facility and engineering functionality, milestone and performance monitoring, quality assurance, risk management and strategic project consulting. In addition, the company provides investment management services that consists of asset management advisory and administration, transaction, and incentive services. The company was founded in 1972 and is headquartered in Toronto, Canada."}, {"name": "CI Financial Corp.", "ticker": "CIX.TO", "sector": "Financial Services", "description": "CI Financial Corp. is a publicly owned asset management holding company. Through its subsidiaries, the firm manages separate client focused equity, fixed income, and alternative investments portfolios. It also manages mutual funds, hedge funds, and fund of funds for its clients through its subsidiaries. The firm was founded in 1965 and is based in Toronto, Canada with additional offices in Vancouver, Canada; Calgary, Canada; and Montreal, Canada."}, {"name": "Celestica Inc.", "ticker": "CLS.TO", "sector": "Technology", "description": "Celestica Inc. provides hardware platform and supply chain solutions in North America, Europe, and Asia. It operates through two segments, Advanced Technology Solutions, and Connectivity & Cloud Solutions. The company offers a range of product manufacturing and related supply chain services, including design and development, engineering, supply chain management, new product introduction, component sourcing, electronics manufacturing and assembly, testing, complex mechanical assembly, systems integration, precision machining, order fulfillment, logistics, asset management, product licensing, and after-market repair and return services. It also provides enterprise-level data communications and information processing infrastructure products, such as routers, switches, data center interconnects, edge solutions, servers, and storage-related products; capacitors, microprocessors, resistors, and memory modules; and power inverters, energy storage products, smart meters, and other electronic componentry products. The company serves aerospace and defense, industrial, energy, healthtech, capital equipment, original equipment manufacturers, cloud-based, and other service providers, including hyperscalers, and other companies in a range of industries. Celestica Inc. was incorporated in 1994 and is headquartered in Toronto, Canada."}, {"name": "Canadian Imperial Bank Of Commerce", "ticker": "CM.TO", "sector": "Financial Services", "description": "Canadian Imperial Bank of Commerce, a diversified financial institution, provides various financial products and services to personal, business, public sector, and institutional clients in Canada, the United States, and internationally. The company operates through four strategic business units: Canadian Personal and Business Banking; Canadian Commercial Banking and Wealth Management; U.S. Commercial Banking and Wealth Management; and Capital Markets. The company offers chequing, savings, and business accounts; mortgages; loans, lines of credit, student lines of credit, and business and agriculture loans; investment and insurance services; and credit cards, as well as overdraft protection services. It also provides day-to-day banking, borrowing and credit, specialty, investing and wealth, and international services; correspondent banking and online foreign exchange services; and cash management services. The company serves its customers through its banking centers, as well as direct, mobile, and remote channels. Canadian Imperial Bank of Commerce was founded in 1867 and is headquartered in Toronto, Canada."}, {"name": "Copper Mountain Mining Corporation", "ticker": "CMMC.TO", "sector": "Basic Materials", "description": "Copper Mountain Mining Corporation operates as a mining company in Canada. The company explores for copper, gold, and silver deposits. Its flagship asset is the Copper Mountain mine that comprise 138 crown granted mineral claims, 149 located mineral claims, 14 mining leases, and 12 fee simple properties covering an area of 6,702 hectares located to the south of Princeton, British Columbia. The company was founded in 2006 and is headquartered in Vancouver, Canada."}, {"name": "Canacol Energy Ltd.", "ticker": "CNE.TO", "sector": "Energy", "description": "Canacol Energy Ltd., an oil and gas company, engages in the exploration, development, and production of natural gas in Colombia. As of December 31, 2021, it had a total proved developed producing reserves of 236 billion cubic feet (Bcf) conventional natural gas; a total proved plus probable reserves of 607 Bcf conventional natural gas; and a total proved reserves of 368 Bcf conventional natural gas. The company was incorporated in 1970 and is headquartered in Calgary, Canada."}, {"name": "Canadian Natural Resources Limited", "ticker": "CNQ.TO", "sector": "Energy", "description": "Canadian Natural Resources Limited acquires, explores for, develops, produces, markets, and sells crude oil, natural gas, and natural gas liquids (NGLs). The company offers synthetic crude oil (SCO), light and medium crude oil, bitumen (thermal oil), primary heavy crude oil, and Pelican Lake heavy crude oil. Its midstream and refining assets include two crude oil pipeline systems; and a 50% working interest in an 84-megawatt cogeneration plant at Primrose. As of December 31, 2020, the company had total proved crude oil, bitumen, and NGLs reserves were 10,528 million barrels (MMbbl); total proved plus probable crude oil, bitumen, and NGLs reserves were 13,271 MMbbl; proved SCO reserves were 6,998 MMbbl; total proved plus probable SCO reserves were 7,535 MMbbl; proved natural gas reserves were 12,168 billion cubic feet (Bcf); and total proved plus probable natural gas reserves were 20,249 Bcf. It operates primarily in Western Canada; the United Kingdom portion of the North Sea; and Offshore Africa. The company was formerly known as AEX Minerals Corporation and changed its name to Canadian Natural Resources Limited in December 1975. Canadian Natural Resources Limited was incorporated in 1973 and is headquartered in Calgary, Canada."}, {"name": "Canadian National Railway Company", "ticker": "CNR.TO", "sector": "Industrials", "description": "Canadian National Railway Company, together with its subsidiaries, engages in the rail and related transportation business. The company's portfolio of goods includes petroleum and chemicals, grain and fertilizers, coal, metals and minerals, forest products, intermodal, and automotive products serving exporters, importers, retailers, farmers, and manufacturers. It operates a network of 19,500 route miles of track spanning Canada and the United States. The company also provides vessels and docks, transloading and distribution, automotive logistics, and freight forwarding and transportation management services. Canadian National Railway Company was incorporated in 1919 and is headquartered in Montreal, Canada."}, {"name": "Condor Gold plc", "ticker": "COG.TO", "sector": "Basic Materials", "description": "Condor Gold Plc, together with its subsidiaries, explores and develops gold and silver properties in Nicaragua. The company owns a 100% interest in the La India project that comprises 12 concessions covering an area of 588 square kilometers located in the La India Gold Mining District, Nicaragua. It also holds 100% interests in Rio Luna concession covering an area of 43 square kilometers located in Central Highlands, Nicaragua; and Estrella concession covering an area of 18 square kilometers located in southwest of Siuna, Nicaragua. The company was incorporated in 2005 and is headquartered in Godalming, the United Kingdom."}, {"name": "Canadian Pacific Railway Limited", "ticker": "CP.TO", "sector": "Industrials", "description": "Canadian Pacific Railway Limited, together with its subsidiaries, owns and operates a transcontinental freight railway in Canada and the United States. The company transports bulk commodities, including grain, coal, potash, fertilizers, and sulphur; and merchandise freight, such as energy, chemicals and plastics, metals, minerals and consumer, automotive, and forest products. It also transports intermodal traffic comprising retail goods in overseas containers. The company offers rail and intermodal transportation services through a network of approximately 13,000 miles serving business centers in Quebec and British Columbia, Canada; and the United States Northeast and Midwest regions. Canadian Pacific Railway Limited was incorporated in 1881 and is headquartered in Calgary, Canada."}, {"name": "Crescent Point Energy Corp.", "ticker": "CPG.TO", "sector": "Energy", "description": "Crescent Point Energy Corp. explores, develops, and produces light and medium crude oil, natural gas liquids, and natural gas reserves in Western Canada and the United States. It's crude oil and natural gas properties, and related assets are located in the provinces of Saskatchewan, Alberta, British Columbia, and Manitoba; and the states of North Dakota and Montana. The company was incorporated in 1994 and is headquartered in Calgary, Canada."}, {"name": "Cardiol Therapeutics Inc.", "ticker": "CRDL.TO", "sector": "Healthcare", "description": "Cardiol Therapeutics Inc., a clinical-stage life sciences company, focuses on the research and development of anti-fibrotic and anti-inflammatory therapies for the treatment of cardiovascular disease (CVD). Its lead product is CardiolRx, which is in Phase II/III multi-national, randomized, double-blind, and placebo-controlled study; and LANCER design to evaluate the efficacy and safety of CardiolRx as a cardioprotective therapy to reduce major cardiovascular and respiratory events in patients hospitalized with COVID-19 that is in Phase II. The company is also developing a proprietary subcutaneous formulation of cannabidiol to achieve higher bioavailability for the treatment chronic heart failure. In addition, it develops proprietary nanotechnology to enable the distribution of water insoluble drugs within the blood circulation, enhance pharmacokinetics, and facilitate drug accumulation in the failing heart. Cardiol Therapeutics Inc. was incorporated in 2017 and is headquartered in Oakville, Canada."}, {"name": "Cronos Group Inc.", "ticker": "CRON.TO", "sector": "Healthcare", "description": "Cronos Group Inc. operates as a cannabinoid company. It manufactures, markets, and distributes hemp-derived supplements and cosmetic products through e-commerce, retail, and hospitality partner channels under the Lord Jones and Happy Dance brands in the United States. The company is also involved in the cultivation, manufacture, and marketing of cannabis and cannabis-derived products for the medical and adult-use markets. It sells cannabis and cannabis products, including dried cannabis, pre-rolls, edibles, concentrates, and cannabis extracts through wholesale and direct-to-client channels under its wellness platform, PEACE NATURALS; and operates under adult-use brands, Spinach. It also exports dried cannabis and cannabis oils to Germany, Israel, and Australia. Cronos Group Inc. was founded in 2012 and is based in Toronto, Canada."}, {"name": "Cenovus Energy Inc.", "ticker": "CVE.TO", "sector": "Energy", "description": "Cenovus Energy Inc., together with its subsidiaries, develops, produces, and markets crude oil, natural gas liquids, and natural gas in Canada, the United States, and the Asia Pacific region. The company operates through Oil Sands, Conventional, Offshore, Canadian Manufacturing, U.S. Manufacturing, and Retail segments. The Oil Sands segment develops and produces bitumen and heavy oil in northern Alberta and Saskatchewan. This segments Foster Creek, Christina Lake, Sunrise, and Tucker oil sands projects, as well as Lloydminster thermal and conventional heavy oil assets The Conventional segment holds assets primarily located in Elmworth-Wapiti, Kaybob-Edson, Clearwater, and Rainbow Lake operating in Alberta and British Columbia, as well as interests in various natural gas processing facilities. The offshore segment engages in the exploration and development activities. The Canadian Manufacturing segment includes the owned and operated Lloydminster upgrading and asphalt refining complex, which upgrades heavy oil and bitumen into synthetic crude oil, diesel fuel, asphalt, and other ancillary products, as well as owns and operates the Bruderheim crude-by-rail terminal and two ethanol plants. The U.S. Manufacturing segment comprises the refining of crude oil to produce diesel, gasoline, jet fuel, asphalt, and other products. The Retail segment consists of marketing of its own and third-party refined petroleum products through retail, commercial, and bulk petroleum outlets, as well as wholesale channels. Cenovus Energy Inc. was founded in 2009 and is headquartered in Calgary, Canada."}, {"name": "Docebo Inc.", "ticker": "DCBO.TO", "sector": "Technology", "description": "Docebo Inc. provides a cloud-based learning management system to train internal and external workforces, partners, and customers in North America, Europe, and the Asia-Pacific region. Its platform helps customers to centralize learning materials from peer enterprises and learners into one learning management system (LMS) to expedite and enrich the learning process, increase productivity, and grow teams uniformly. The company's learning platform includes Docebo Learn LMS, a cloud-based learning platform; Docebo Shape, an AI-based learning content creation tool; Docebo Content that allows to unlock the industry's best-learning content; Docebo Learning Impact, a learning measurement tool; Docebo Learning Analytics that allows learning administrators to prove their learning programs are powering their business, as well as connecting learning data to business results; Docebo Connect that connects Docebo to custom tech stack and making integrations; and Docebo Flow that allows businesses to directly inject learning into the flow of work. It also provides Docebo for Salesforce, a native integration that leverages Salesforce's application programming interface and technology architecture to produce a learning experience; and Docebo Embed (OEM) that allows original equipment manufacturers to embed and re-sell Docebo as a part of their software. In addition, the company offers Docebo Mobile App Publisher product that allows companies to create and publish own branded version of Docebo Go.Learn mobile learning applications; Docebo Extended Enterprise that breeds customer education, partner enablement, and retention; and Docebo Discover, Coach & Share that enhances the learning experience to create a culture of social learning. It serves customers in the technology, media, manufacturing, consulting and professional services, and retail industries. The company was formerly known as Docebo Canada, Inc. Docebo Inc. founded in 2005 and is based in Toronto, Canada."}, {"name": "Denison Mines Corp.", "ticker": "DML.TO", "sector": "Energy", "description": "Denison Mines Corp. engages in the acquisition, exploration, development, extraction, processing, selling of, and investing in uranium properties in Canada. Its flagship project is the 95% interest owned Wheeler River uranium project located in the Athabasca Basin region in northern Saskatchewan. The company was formerly known as International Uranium Corporation and changed its name to Denison Mines Corp. in December 2006. Denison Mines Corp. was founded in 1997 and is headquartered in Toronto, Canada."}, {"name": "Candente Copper Corp.", "ticker": "DNT.TO", "sector": "Basic Materials", "description": "Candente Copper Corp., a mineral exploration company, engages in the acquisition, exploration, and development of mineral properties. The company primarily explores for copper, gold, and silver deposits. Its principal property is the Cañariaco project consisting of 15 mining concessions covering a total area of approximately 10,190 hectares located in Northern Peru. The company was formerly known as Candente Resource Corp. and changed its name to Candente Copper Corp. in December 2009. Candente Copper Corp. was incorporated in 1997 and is headquartered in Vancouver, Canada."}, {"name": "BRP Inc.", "ticker": "DOO.TO", "sector": "Consumer Cyclical", "description": "BRP Inc., together with its subsidiaries, designs, develops, manufactures, distributes, and markets powersports vehicles and marine products in the United States, Canada, Europe, the Asia Pacific, Mexico, Austria, and internationally. The company operates through two segments, Powersports and Marine. It offers all-terrain, side-by-side, and three-wheeled vehicles; seasonal products, such as snowmobiles and personal watercraft; and engines for jet boats, outboards, karts, motorcycles, and recreational aircraft. The company also provides parts, accessories, and apparel, as well as other services. It sells its products through a network of independent dealers and distributors, as well as to original equipment manufacturers. The company was formerly known as J.A. Bombardier (J.A.B.) Inc. and changed its name to BRP Inc. in April 2013. BRP Inc. was founded in 1937 and is headquartered in Valcourt, Canada."}, {"name": "DIRTT Environmental Solutions Ltd.", "ticker": "DRT.TO", "sector": "Industrials", "description": "DIRTT Environmental Solutions Ltd. designs, manufactures, and installs prefabricated interior solutions for use in commercial spaces across various industries and businesses in the United States, Canada, internationally. Its ICE software interior construction software provides end-to-end integration, design, order engineering, manufacturing, and installation services. The company's interior construction solutions include prefabricated, customized interior modular walls, ceilings, and floors; decorative and functional millwork; power infrastructure; network infrastructure; and pre-installed medical gas piping systems. It offers interior construction solutions through a network of independent distribution partners. It serves commercial, healthcare, education, hospitality, and other industries, as well as medical gas piping systems for healthcare. DIRTT Environmental Solutions Ltd. was incorporated in 2003 and is headquartered in Calgary, Canada."}, {"name": "Descartes Systems Group Inc. (The)", "ticker": "DSG.TO", "sector": "Technology", "description": "The Descartes Systems Group Inc. provides cloud-based logistics and supply chain management business process solutions that focuses on enhancing the productivity, performance, and security of logistics-intensive businesses worldwide. Its Logistics Technology platform offers a range of modular, cloud-based, and interoperable web and wireless logistics management applications, which unites a community of logistics-focused parties, allowing them to transact business. The company provides a suite of solutions that include routing, mobile and telematics; transportation management and e-commerce enablement; customs and regulatory compliance; trade data; global logistics network services; and broker and forwarder enterprise systems. It offers its customers to use its modular, software-as-a-service, and data solutions to route, schedule, track, and measure delivery resources; plan, allocate, and execute shipments; rate, audit, and pay transportation invoices; access and analyze global trade data; research and perform trade tariff and duty calculations; file customs and security documents for imports and exports; and various other logistics processes. The company also provides cloud-based ecommerce warehouse management solutions; consulting, implementation, and training services; and maintenance and support services. It primarily focuses on serving transportation providers, logistics service providers, and distribution-intensive companies, as well as manufacturers, retailers, distributors, and mobile business service providers. The company was incorporated in 1981 and is headquartered in Waterloo, Canada."}, {"name": "Endeavour Silver Corp.", "ticker": "EDR.TO", "sector": "Basic Materials", "description": "Endeavour Silver Corp., a silver mining company, engages in the acquisition, exploration, development, extraction, processing, refining, and reclamation of mineral properties in Mexico and Chile. The company explores for gold and silver deposits, and precious metals. The company operates two producing silver-gold mines in Mexico, such as the Guanaceví mine in Durango; and the Bolañitos mine in Guanajuato. It is also advancing two exploration and development projects in Mexico, including the Terronera property in Jalisco; and the Parral properties in Chihuahua. In addition, the company holds interests in three exploration projects in northern Chile comprising the Aida silver project, the Paloma gold project, and the Cerro Marquez copper-molybdenum gold project. The company was formerly known as Endeavour Gold Corp. and changed its name to Endeavour Silver Corp. in September 2004. Endeavour Silver Corp. was incorporated in 1981 and is headquartered in Vancouver, Canada."}, {"name": "Endeavour Mining plc", "ticker": "EDV.TO", "sector": "Basic Materials", "description": "Endeavour Mining plc, together with its subsidiaries, operates as a gold mining company in West Africa. Its project portfolio includes 90% owned Houndé, Mana, Boungou, and Wahgnion mines in Burkina Faso; 85% owned Ity mine located in Côte d'Ivoire; 90% owned Sabodala-Massawa mine situated in Senegal; and Fetekro, Kalana, Bantou, Nabanga, and Afema development projects. The company was incorporated in 2021 and is based in London, the United Kingdom."}, {"name": "Energy Fuels Inc.", "ticker": "EFR.TO", "sector": "Energy", "description": "Energy Fuels Inc., together with its subsidiaries, engages in the extraction, recovery, exploration, and sale of conventional and in situ uranium recovery in the United States. The company owns and operates the Nichols Ranch project, the Jane Dough property, and the Hank project located in Wyoming; and the Alta Mesa project located in Texas, as well as White Mesa Mill in Utah. It also holds interests in uranium and uranium/vanadium properties and projects in various stages of exploration, permitting, and evaluation located in Utah, Wyoming, Arizona, New Mexico, and Colorado. The company was formerly known as Volcanic Metals Exploration Inc. and changed its name to Energy Fuels Inc. in May 2006. Energy Fuels Inc. was incorporated in 1987 and is headquartered in Lakewood, Colorado."}, {"name": "Enthusiast Gaming Holdings Inc.", "ticker": "EGLX.TO", "sector": "Communication Services", "description": "Enthusiast Gaming Holdings Inc. engages in the media, content, entertainment, and esports businesses the United States, Canada, and internationally. The company operates an online network of approximately 100 gaming related websites; owns and operates Enthusiast Gaming Live Expo, a video-gaming expo; provides management and support services to players involved in professional gaming; owns and manages esports teams, which cover games comprising Call of Duty, Madden NFL, Fortnite, Overwatch, Super Smash Bros., Rocket League, and Valorant; and produces and programs approximately 30 weekly shows across AVOD and OTT channels, and represents approximately 500 gaming influencers in YouTube and Twitch. It also operates Luminosity Gaming, an eSports franchise; and hosts other gaming events. The company is headquartered in Toronto, Canada."}, {"name": "Eldorado Gold Corporation", "ticker": "ELD.TO", "sector": "Basic Materials", "description": "Eldorado Gold Corporation, together with its subsidiaries, engages in the mining, exploration, development, and sale of mineral products primarily in Turkey, Canada, Greece, and Romania. The company primarily produces gold, as well as silver, lead, and zinc. It holds a 100% interest in the Kisladag and Efemcukuru gold mines located in western Turkey; 100% interest in Lamaque gold mines located in Canada; and Olympias, Stratoni, Skouries, Perama Hill, and Sapes gold mines located in Greece, as well as the 80.5% interest in Certej development projects located in Romania. The company was formerly known as Eldorado Corporation Ltd. and changed its name to Eldorado Gold Corporation in April 1996. Eldorado Gold Corporation was incorporated in 1992 and is headquartered in Vancouver, Canada."}, {"name": "Eastern Platinum Limited", "ticker": "ELR.TO", "sector": "Basic Materials", "description": "Eastern Platinum Limited, together with its subsidiaries, engages in the mining, exploration, and development of platinum group metal (PGM) and chrome properties in South Africa. Its PGM deposits include platinum, palladium, rhodium, osmium, iridium, and ruthenium. The company principally holds 87.5% interest in the Crocodile River Mine located on the western limb and the Kennedy's Vale project on the eastern limb of Bushveld Complex (BCX); 87% interest in the Mareesburg project situated on the eastern limb of the BCX; and 93.4% interest in the Spitzkop project located on the eastern limb of the BCX. Eastern Platinum Limited is headquartered in Vancouver, Canada."}, {"name": "Enbridge Inc.", "ticker": "ENB.TO", "sector": "Energy", "description": "Enbridge Inc. operates as an energy infrastructure company. The company operates through five segments: Liquids Pipelines, Gas Transmission and Midstream, Gas Distribution and Storage, Renewable Power Generation, and Energy Services. The Liquids Pipelines segment operates pipelines and related terminals to transport various grades of crude oil and other liquid hydrocarbons in Canada and the United States. The Gas Transmission and Midstream segment invests in natural gas pipelines, and gathering and processing facilities in Canada and the United States. The Gas Distribution and Storage segment is involved in natural gas utility operations serving residential, commercial, and industrial customers in Ontario, as well as natural gas distribution and energy transportation activities in Quebec. The Renewable Power Generation segment operates power generating assets, such as wind, solar, geothermal, and waste heat recovery facilities; and transmission assets in North America and Europe. The Energy Services segment provides energy marketing services to refiners, producers, and other customers; and physical commodity marketing and logistical services in Canada and the United States. The company was formerly known as IPL Energy Inc. and changed its name to Enbridge Inc. in October 1998. Enbridge Inc. was founded in 1949 and is headquartered in Calgary, Canada."}, {"name": "Equinox Gold Corp.", "ticker": "EQX.TO", "sector": "Basic Materials", "description": "Equinox Gold Corp. engages in the operation, acquisition, exploration, and development of mineral properties. The company primarily explores for gold and silver deposits. Its properties include the Aurizona gold mine located in Maranhão State; the RDM gold mine located in Minas Gerais State; and Fazenda gold mine and the Santa Luz gold mine located in Bahia State, Brazil. The company also hold interests in the Mesquite gold mine and the Castle Mountain property situated in California, the United States; and the Los Filos Gold Mine located in Guerrero State, Mexico. In addition, it holds a 60% interest in the Greenstone project located in Ontario, Canada. The company was formerly known as Trek Mining Inc. and changed its name to Equinox Gold Corp. in December 2017. Equinox Gold Corp. was incorporated in 2007 and is headquartered in Vancouver, Canada."}, {"name": "Enerplus Corporation", "ticker": "ERF.TO", "sector": "Energy", "description": "Enerplus Corporation, together with subsidiaries, engages in the exploration and development of crude oil and natural gas in the United States and Canada. The company's oil and natural gas properties are located primarily in North Dakota, Colorado, and Pennsylvania; and Alberta, British Columbia, and Saskatchewan. As of December 31, 2021, it had proved plus probable gross reserves of approximately 8.2 million barrels (MMbbls) of light and medium crude oil; 20.7 MMbbls of heavy crude oil; 299.3 MMbbls of tight oil; 56.2 MMbbls of natural gas liquids; 19.7 billion cubic feet (Bcf) of conventional natural gas; and 1,367.9 Bcf of shale gas. Enerplus Corporation was founded in 1986 and is headquartered in Calgary, Canada."}, {"name": "Ero Copper Corp.", "ticker": "ERO.TO", "sector": "Basic Materials", "description": "Ero Copper Corp., a mining company, focuses on the production, exploration, and development of mining projects in Brazil. The company also explores for copper, gold, and silver deposits. Its principal property is the Vale do CuraÃ§Ã¡ property covering an area of approximately 153,741 hectares located in the northeastern Bahia State, Brazil. The company also holds interests in the Boa EsperanÃ§a project covering an area of approximately 4,034 hectares located in ParÃ¡, Brazil; and NX gold mine covering an area of approximately 31,096 located in Mato Grosso, Brazil. Ero Copper Corp. was incorporated in 2016 and is headquartered in Vancouver, Canada."}, {"name": "Excellon Resources Inc.", "ticker": "EXN.TO", "sector": "Basic Materials", "description": "Excellon Resources Inc., a silver mining and exploration company, acquires, explores, develops, and exploits mineral properties in Mexico and Canada. The company primarily explores for silver, lead, zinc, and gold deposits. It holds 100% interests in the Platosa property covering an area of approximately 11,000 hectares located in Durango State, Mexico; the Evolución property that covers an area of 45,000 hectares situated in the states of Durango and Zacatecas, Mexico; and the Silver City Project totaling an area of 164 square kilometers in Saxony, Germany. It also holds 100% interests in the Kilgore Project that covers an area of 6,788 located in Clark County, Southeastern Idaho; and the Oakley Project covering an area of 2,833 hectares in Oakley, Idaho. The company was incorporated in 1987 and is based in Toronto, Canada."}, {"name": "Filo Mining Corp.", "ticker": "FIL.TO", "sector": "Basic Materials", "description": "Filo Mining Corp., together with its subsidiaries, engages in the identification, acquisition, exploration, evaluation, and development of mineral properties in Chile and Argentina. Its flagship property is the 100% owned Filo del Sol copper-gold-silver deposit located in the Atacama region of Northern Chile and adjacent San Juan province of Argentina. The company was incorporated in 2016 and is headquartered in Vancouver, Canada."}, {"name": "Franco-Nevada Corporation", "ticker": "FNV.TO", "sector": "Basic Materials", "description": "Franco-Nevada Corporation operates as a gold-focused royalty and streaming company in Latin America, the United States, Canada, and internationally. It operates in two segments, Mining and Energy. The company manages its portfolio with a focus on precious metals, such as gold, silver, and platinum group metals; and energy comprising oil, gas, and natural gas liquids. The company was founded in 1983 and is headquartered in Toronto, Canada."}, {"name": "First Majestic Silver Corp.", "ticker": "FR.TO", "sector": "Basic Materials", "description": "First Majestic Silver Corp. engages in the acquisition, exploration, development, and production of mineral properties with a focus on silver and gold production in North America. It holds 100% interests in the San Dimas Silver/Gold Mine covering an area of 71,868 hectares located in Durango and Sinaloa states; the Santa Elena Silver/Gold Mine covering an area of 102,244 hectares located in Sonora; Jerritt Canyon gold mine that covers an area of approximately of 30,821 hectares located in Elko County, Nevada; and the La Encantada Silver Mine covering an area of 4,076 hectares situated in Coahuila, as well as surface land ownership of 1,343 hectares. The company also holds 100% interests in the La Parrilla Silver Mine that covers an area of 69,478 hectares located in Durango; the Del Toro Silver Mine consisting of 3,815 hectares of mining concessions and 219 hectares of surface rights located in Zacatecas; the San Martin Silver Mine includes 33 mining concessions covering an area of 12,795 hectares located in Jalisco; and the La Guitarra Silver Mine that covers an area of 39,714 hectares located in Mexico. In addition, it holds interest in the Springpole project, a gold and silver project covering an area of approximately 41,913 hectares in Ontario, Canada. The company was formerly known as First Majestic Resource Corp. and changed its name to First Majestic Silver Corp. in November 2006. First Majestic Silver Corp. was incorporated in 1979 and is headquartered in Vancouver, Canada."}, {"name": "Fennec Pharmaceuticals Inc.", "ticker": "FRX.TO", "sector": "Healthcare", "description": "Fennec Pharmaceuticals Inc., a biopharmaceutical company, develops product candidates for use in the treatment of cancer in the United States. Its lead product PEDMARK, a formulation of Sodium Thiosulfate that has completed the Phase III clinical trial for the prevention of cisplatin induced hearing loss or ototoxicity in children. The company was formerly known as Adherex Technologies Inc. and changed its name to Fennec Pharmaceuticals Inc. in September 2014. Fennec Pharmaceuticals Inc. was incorporated in 1996 and is based in Research Triangle Park, North Carolina."}, {"name": "FirstService Corporation", "ticker": "FSV.TO", "sector": "Real Estate", "description": "FirstService Corporation, together with its subsidiaries, provides residential property management and other essential property services to residential and commercial customers in the United States and Canada. The company operates in two segments, FirstService Residential and FirstService Brands. The FirstService Residential segment offers property management services for private residential communities, such as condominiums, co-operatives, homeowner associations, master-planned communities, active adult and lifestyle communities, and various other residential developments. This segment also provides a range of ancillary services, including on-site staffing for building engineering and maintenance, full-service swimming pool and amenity management, and security and concierge/front desk; and financial services comprising cash management, other banking transaction-related, and specialized property insurance brokerage. In addition, this segment offers energy management solutions and advisory services, and resale processing services. The FirstService Brands segment operates and provides essential property services to residential and commercial customers, through five franchise networks; and company-owned locations, including 20 California Closets, 12 Paul Davis Restoration, and 1 CertaPro Painters locations. It provides residential and commercial restoration, painting, and floor coverings design and installation services; custom-designed and installed closet, and home storage solutions; home inspection services; and fire protection and related services. This segment offers its services primarily under the Paul Davis Restoration, First Onsite Restoration, Century Fire Protection, CertaPro Painters, California Closets, Pillar to Post Home Inspectors, and Floor Coverings International brand names. FirstService Corporation was founded in 1989 and is headquartered in Toronto, Canada."}, {"name": "Field Trip Health Ltd.", "ticker": "FTRP.TO", "sector": "Healthcare", "description": "Field Trip Health Ltd. engages in the development and delivery of psychedelic therapies in North America. The company operates Field Trip Health Centres that provide psychedelic therapies; offers Field Trip Digital apps; and Field Trip Discovery, a drug development division developing the next generation of psychedelic molecules. Field Trip Health Ltd. was founded in 2008 and is headquartered in Toronto, Canada."}, {"name": "Fortis Inc.", "ticker": "FTS.TO", "sector": "Utilities", "description": "Fortis Inc. operates as an electric and gas utility company in Canada, the United States, and the Caribbean countries. It generates, transmits, and distributes electricity to approximately 438,000 retail customers in southeastern Arizona; and 100,000 retail customers in Arizona's Mohave and Santa Cruz counties with an aggregate capacity of 3,485 megawatts (MW), including 53 MW of solar capacity and 252 MV of wind capacity. The company also sells wholesale electricity to other entities in the western United States; owns gas-fired and hydroelectric generating capacity totaling 65 MW; and distributes natural gas to approximately 1,065,000 residential, commercial, and industrial customers in British Columbia, Canada. In addition, it owns and operates the electricity distribution system that serves approximately 577,000 customers in southern and central Alberta; owns 4 hydroelectric generating facilities with a combined capacity of 225 MW; and provides operation, maintenance, and management services to five hydroelectric generating facilities. Further, the company distributes electricity in the island portion of Newfoundland and Labrador with an installed generating capacity of 143 MW; and on Prince Edward Island with a generating capacity of 130 MW. Additionally, it provides integrated electric utility service to approximately 68,000 customers in Ontario; approximately 272,000 customers in Newfoundland and Labrador; approximately 32,000 customers on Grand Cayman, Cayman Islands; and approximately 16,000 customers on certain islands in Turks and Caicos. The company also holds long-term contracted generation assets in Belize consisting of 3 hydroelectric generating facilities with a combined capacity of 51 MW; and the Aitken Creek natural gas storage facility. It also owns and operates approximately 90,200 circuit Kilometers (km) of distribution lines; and approximately 50,500 km of natural gas pipelines. Fortis Inc. was founded in 1885 and is headquartered in St. John's, Canada."}, {"name": "Fury Gold Mines Limited", "ticker": "FURY.TO", "sector": "Basic Materials", "description": "Fury Gold Mines Limited operates as an exploration and development company in Canada. It primarily explores for gold properties. The company's flagship properties include the Eau Claire project that consists of map-designated claims totaling approximately 23,000 hectares located in the Eeyou Istchee James Bay Region of Northern Quebec; and Committee Bay project, which comprise 57 crown leases and 190 mineral claims in six non-contiguous blocks totaling approximately 297,273 hectares situated in the Kitikmeot Region of Nunavut. It also explores for silver metals. The company was formerly known as Auryn Resources Inc. and changed its name to Fury Gold Mines Limited in October 2020. Fury Gold Mines Limited was incorporated in 2008 and is headquartered in Vancouver, Canada."}, {"name": "Fortuna Silver Mines Inc.", "ticker": "FVI.TO", "sector": "Basic Materials", "description": "Fortuna Silver Mines Inc. engages in the acquisition, exploration, and mining of precious and base metal deposits in Argentina, Burkina Faso, Mexico, Peru, and Côte d'Ivoire. It holds interest in the Caylloma silver, lead, and zinc mine located in southern Peru; the San Jose silver and gold mine situated in southern Mexico; the Lindero gold project located in Argentina; Yaramoko gold mine situated in south western Burkina Faso; and Séguéla gold mine located in south western Côte d'Ivoire. The company was formerly known as Fortuna Ventures Inc. and changed its name to Fortuna Silver Mines Inc. in June 2005. Fortuna Silver Mines Inc. was incorporated in 1990 and is based in Vancouver, Canada."}, {"name": "Gatos Silver", "ticker": "GATO.TO", "sector": "Basic Materials", "description": "Gatos Silver, Inc. engages in the exploration, development, and production of precious metals. It primarily explores for silver ores. The company also explores for zinc, lead, copper, and gold ores. Its flagship asset is the Cerro Los Gatos mine located at the Los Gatos District in Chihuahua state, Mexico. The company was formerly known as Sunshine Silver Mining & Refining Corporation and changed its name to Gatos Silver, Inc. in October 2020. Gatos Silver, Inc. was incorporated in 2009 and is based in Greenwood Village, Colorado."}, {"name": "Galiano Gold Inc.", "ticker": "GAU.TO", "sector": "Basic Materials", "description": "Galiano Gold Inc. engages in the exploration, development, and production of gold properties. The company's primary asset is the Asanko Gold Mine located in Ghana, West Africa. The company was formerly known as Asanko Gold Inc. and changed its name to Galiano Gold Inc. in May 2020. Galiano Gold Inc. was incorporated in 1999 and is headquartered in Vancouver, Canada."}, {"name": "GFL Environmental Inc.", "ticker": "GFL.TO", "sector": "Industrials", "description": "GFL Environmental Inc. operates as a diversified environmental services company in Canada and the United States. The company offers non-hazardous solid waste management, infrastructure and soil remediation, and liquid waste management services. Its solid waste management business line includes the collection, transportation, transfer, recycling, and disposal of non-hazardous solid waste for municipal, residential, and commercial and industrial customers. The company's infrastructure and soil remediation business line provides remediation of contaminated soils, as well as complementary services, including civil, demolition, and excavation and shoring services. Its liquid waste management business collects, manages, transports, processes, and disposes of a range of industrial and commercial liquid wastes, as well as resells liquid waste products. The company was incorporated in 2007 and is headquartered in Vaughan, Canada."}, {"name": "Goldgroup Mining Inc.", "ticker": "GGA.TO", "sector": "Basic Materials", "description": "Goldgroup Mining Inc., together with its subsidiaries, focuses on the acquisition, exploration, and development of gold-bearing mineral properties in the Americas. It holds 100% interests in the Cerro Prieto project located in the state of Sonora; and the San José de Gracia project situated in Sinaloa State, Mexico. The company is headquartered in Vancouver, Canada."}, {"name": "Gildan Activewear Inc.", "ticker": "GIL.TO", "sector": "Consumer Cyclical", "description": "Gildan Activewear Inc. manufactures and sells various apparel products in the United States, North America, Europe, Asia-Pacific, and Latin America. It provides various activewear products, including T-shirts, fleece tops and bottoms, and sports shirts under the Gildan, Gildan Performance, Gildan Hammer, Comfort Colors, American Apparel, Alstyle, and GoldToe brands. The company also offers hosiery products comprising athletic; dress; and casual, liner, therapeutic, and workwear socks, as well as sheer pantyhose, tights, and leggings under the Gildan, Under Armour, GoldToe, PowerSox, Signature Gold by Goldtoe, Peds, MediPeds, Therapy Plus, All Pro, Secret, Silks, Secret Silky, and American Apparel brands. In addition, it provides men's and boys' underwear products, and ladies panties under the Gildan and Gildan Platinum brands; and ladies' shapewear, intimates, and accessories under the Secret and Secret Silky brands. The company sells its products to wholesale distributors, screen printers, and embellishers, as well as to retailers and lifestyle brand companies. The company was formerly known as Textiles Gildan Inc. and changed its name to Gildan Activewear Inc. in March 1995. Gildan Activewear Inc. was founded in 1946 and is headquartered in Montreal, Canada."}, {"name": "GoldMining Inc.", "ticker": "GOLD.TO", "sector": "Basic Materials", "description": "GoldMining Inc., a mineral exploration company, focuses on the acquisition, exploration, and development of gold assets in the Americas. It also operates a diversified portfolio of resource-stage gold and gold-copper projects in Canada, the United States, Brazil, Colombia, and Peru. The company's principal projects include La Mina Gold Project and Titiribi Gold-Copper Project located in Colombia; Whistler Gold-Copper Project located in Alaska, United States; and São Jorge Gold Project located in the State of Pará, northeastern Brazil. The company was formerly known as Brazil Resources Inc. and changed its name to GoldMining Inc. in December 2016. GoldMining Inc. was incorporated in 2009 and is headquartered in Vancouver, Canada."}, {"name": "Canada Goose Holdings Inc.", "ticker": "GOOS.TO", "sector": "Consumer Cyclical", "description": "Canada Goose Holdings Inc. designs, manufactures, and sells performance luxury apparel for men, women, youth, children, and babies in Canada, the United States, Asia, Europe, and internationally. It operates through three segments: Direct-to-Consumer, Wholesale, and Other. The company offers parkas, lightweight down jackets, rainwear, windwear, knitwear, footwear, and accessories for fall, winter, and spring seasons. As of March 28, 2021, it operated through its 51 national e-commerce markets and 28 directly operated retail stores in North America, Europe, and Asia. The company also sells its products through wholesale partners and distributors. Canada Goose Holdings Inc. was founded in 1957 and is headquartered in Toronto, Canada."}, {"name": "Great Panther Mining Limited", "ticker": "GPR.TO", "sector": "Basic Materials", "description": "Great Panther Mining Limited operates as a precious metals mining and exploration company. It explores for gold, silver, copper, lead, and zinc ores. The company operates three mines, including the Tucano gold mine in Amapá State, Brazil; and the Guanajuato mine complex and the Topia mine in Mexico, as well as Coricancha mine complex in the central Andes, Peru. Its exploration properties also include the El Horcón, Santa Rosa, and Plomo projects in Mexico. The company was formerly known as Great Panther Silver Limited and changed its name to Great Panther Mining Limited in March 2019. Great Panther Mining Limited was incorporated in 1965 and is headquartered in Vancouver, Canada."}, {"name": "Gold Standard Ventures Corp.", "ticker": "GSV.TO", "sector": "Basic Materials", "description": "Gold Standard Ventures Corp., an exploration stage company, engages in the development of district-scale and other gold-bearing mineral resource properties in Nevada, the United States. Its flagship property is the Railroad-Pinion project covering an area of approximately 53,570 acres located in the Elko County, Nevada. The company was incorporated in 2004 and is headquartered in Vancouver, Canada."}, {"name": "Gran Tierra Energy Inc.", "ticker": "GTE.TO", "sector": "Energy", "description": "Gran Tierra Energy Inc., together with its subsidiaries, engages in the exploration and production of oil and gas properties in Colombia and Ecuador. As of December 31, 2021, it had total proved undeveloped reserves of 24.8 million barrels of oil equivalent in Colombia. The company was incorporated in 2003 and is headquartered in Calgary, Canada."}, {"name": "Greenbrook TMS Inc.", "ticker": "GTMS.TO", "sector": "Healthcare", "description": "Greenbrook TMS Inc., together with its subsidiaries, controls and operates a network of outpatient mental health services centers in the United States. Its centers specialize in the provision of transcranial magnetic stimulation (TMS) therapy, an FDA-cleared non-invasive therapy for the treatment of major depressive disorder and other mental health disorders, as well as related psychiatric services. As of December 31, 2021, the company operated 94 wholly owned and 55 TMS centers in the commonwealth of Virginia and the States of Maryland, Delaware, North Carolina, Missouri, Illinois, Ohio, Texas, Connecticut, Florida, South Carolina, Michigan, Alaska, Oregon, California, Iowa, and Massachusetts. Greenbrook TMS Inc. was founded in 2011 and is headquartered in Toronto, Canada."}, {"name": "Global Water Resources", "ticker": "GWR.TO", "sector": "Utilities", "description": "Global Water Resources, Inc., a water resource management company, owns, operates, and manages regulated water, wastewater, and recycled water utilities primarily in metropolitan Phoenix, Arizona. As of December 31, 2020, it served approximately 74,048 people in approximately 27,630 homes. The company was founded in 2003 and is based in Phoenix, Arizona."}, {"name": "HudBay Minerals Inc.", "ticker": "HBM.TO", "sector": "Basic Materials", "description": "Hudbay Minerals Inc., a diversified mining company, together with its subsidiaries, focuses on the discovery, production, and marketing of base and precious metals in North and South America. It produces copper concentrates containing copper, gold, and silver; silver/gold doré; molybdenum concentrates; and zinc metals. The company owns three polymetallic mines, four ore concentrators, and a zinc production facility in northern Manitoba and Saskatchewan, Canada, as well as in Cusco, Peru; and copper projects in Arizona and Nevada, the United States. HudBay Minerals Inc. was founded in 1927 and is headquartered in Toronto, Canada."}, {"name": "HEXO Corp.", "ticker": "HEXO.TO", "sector": "Healthcare", "description": "HEXO Corp., through its subsidiaries, produces, markets, and sells cannabis in Canada. The company offers its adult-use and medical products under the HEXO brand name. It also provides cannabis beverages under the Little Victory, House of Terpenes, Mollo, Veryvell, and XMG brands; and cannabis products under UP Cannabis, Original Stash, and Up brand names. HEXO Corp. has a strategic alliance with Tilray Brands, Inc. The company was formerly known as The Hydropothecary Corporation and changed its name to HEXO Corp. in August 2018. HEXO Corp. was founded in 2013 and is headquartered in Gatineau, Canada."}, {"name": "Hut 8 Mining Corp.", "ticker": "HUT.TO", "sector": "Financial Services", "description": "Hut 8 Mining Corp. operates as a cryptocurrency mining company in North America. The company engages in industrial scale bitcoin mining operations. It also owns and operates 38 BlockBoxes in Drumheller, Alberta; and 51 BlockBoxes in Medicine Hat, Alberta. Hut 8 Mining Corp. was incorporated in 2011 and is headquartered in Toronto, Canada."}, {"name": "Horizonte Minerals Plc", "ticker": "HZM.TO", "sector": "Basic Materials", "description": "Horizonte Minerals Plc, together with its subsidiaries, engages in the exploration and development of mineral projects in Brazil. The company primarily explores for nickel deposits, as well as cobalt deposits. It holds 100% interest in the Araguaia ferronickel project and Serra do Tapa nickel project located in the State of Para; and the Vermelho Nickel-Cobalt project in the eastern part of the Carajás mining district. Horizonte Minerals Plc was incorporated in 2006 and is headquartered in London, the United Kingdom."}, {"name": "i-80 Gold Corp. ", "ticker": "IAU.TO", "sector": "Basic Materials", "description": "i-80 Gold Corp., a mining company, engages in the exploration, development, and production of gold and silver mineral deposits in the United States. It holds a 100% interest in the Lone Tree property covering an area of approximately 12,000 acres located in Battle Mountain-Eureka, Northern Nevada; Ruby Hill property located in Battle Mountain Trend, Northern Nevada; McCoy-Cove project covering 31,000 acres located in Battle Mountain Trend, Nevada; and Buffalo Mountain property located in Battle Mountain Trend, Northern Nevada as well as controls Granite Creek Project located in Getchell Trend, Northern Nevada. The company was incorporated in 2020 and is headquartered in Reno, Nevada."}, {"name": "IAMGold Corporation", "ticker": "IMG.TO", "sector": "Basic Materials", "description": "IAMGOLD Corporation, through its subsidiaries, explores, develops, and operates gold mining properties in North America, South America, and West Africa. The company owns interests in the Rosebel mine located in Suriname, South America; the Essakane mine situated in Burkina Faso and Boto gold project located in Senegal, West Africa; and Westwood mine, covers an area of 1,925 hectare and located in Quebec and the Côté gold project, which covers an area of 586 square kilometer located in Ontario, Canada. Its exploration and development projects include the Pitangui project in Brazil; the Karita project located in Guinea; the Diakha-Siribaya project situated in Mali; and the Nelligan and Monster Lake projects located in Quebec, Canada. IAMGOLD Corporation was incorporated in 1990 and is headquartered in Toronto, Canada."}, {"name": "Imperial Oil Limited", "ticker": "IMO.TO", "sector": "Energy", "description": "Imperial Oil Limited engages in exploration, production, and sale of crude oil and natural gas in Canada. The company operates through three segments: Upstream, Downstream and Chemical segments. The Upstream segment explores for, and produces crude oil, natural gas, synthetic oil, and bitumen. As of December 31, 2021, this segment had 386 million oil-equivalent barrels of proved undeveloped reserves. The Downstream segment is involved in the transportation and refining of crude oil, blending of refined products and the distribution, and marketing of refined products. It also transports crude oil to refineries by contracted pipelines, common carrier pipelines, and rail; maintains a distribution system to move petroleum products to market by pipeline, tanker, rail, and road transport; and owns and operates fuel terminals, natural gas liquids, and products pipelines in Alberta, Manitoba, and Ontario. In addition, this segment markets and supplies petroleum products to motoring public through approximately 2,400 Esso and Mobil-branded sites. Further, it sells petroleum products, including fuel, asphalt, and lubricants for industrial and transportation customers, independent marketers, and resellers, as well as other refiners serving the agriculture, residential heating, and commercial markets through branded fuel and lubricant resellers. The Chemical segment manufactures and markets various petrochemicals, benzene, aromatic and aliphatic solvents, plasticizer intermediates, and polyethylene resin. The company was incorporated in 1880 and is headquartered in Calgary, Canada. Imperial Oil Limited is a subsidiary of Exxon Mobil Corporation."}, {"name": "IMV Inc.", "ticker": "IMV.TO", "sector": "Healthcare", "description": "IMV Inc. operates as a clinical-stage immuno-oncology company. The company develops a portfolio of therapies based on DPX its immune-educating technology platform for treatment of solid and hematological cancers. The company's lead drug candidate includes maveropepimut-S, a DPX-based immunotherapy that targets survivin-expressing cells that is Phase II clinical trials for diffuse large B cell lymphoma; ovarian cancer; and bladder, liver, and microsatellite instability high tumors, as well as in Phase I clinical trial for breast cancer. It also develops DPX-SurMAGE that is in Phase I clinical trial for bladder cancer; and DPX-COVID-19 and DPX-RSV for infectious diseases. The company was formerly known as Immunovaccine Inc. and changed its name to IMV Inc. in May 2018. IMV Inc. was founded in 2000 and is headquartered in Dartmouth, Canada."}, {"name": "International Petroleum Corporation", "ticker": "IPCO.TO", "sector": "Energy", "description": "International Petroleum Corporation explores for, develops, and produces oil and gas. The company holds a portfolio of oil and gas assets in Canada, Malaysia, and France. International Petroleum Corporation was incorporated in 2017 and is headquartered in Vancouver, Canada."}, {"name": "i3 Energy plc", "ticker": "ITE.TO", "sector": "Energy", "description": "i3 Energy Plc, a holding company, engages in the development and production of oil and gas assets in the United Kingdom and Canada. The company owns a 100% interest in the 13/23c and 13/23d blocks of Liberator oil field; and 13/23c-10 well in the Serenity oil field. It also owns working interest in Central Alberta, Wapiti / Elmworth, Simonette, and the Clearwater play properties. The company was founded in 2014 and is based in Westhill, the United Kingdom."}, {"name": "International Tower Hill Mines Ltd.", "ticker": "ITH.TO", "sector": "Basic Materials", "description": "International Tower Hill Mines Ltd., a mineral exploration company, engages in the acquisition, exploration, and development of mineral properties. It holds or has rights to acquire interests in the Livengood gold project covering an area of approximately 19,546 hectares located to the northwest of Fairbanks, Alaska. The company was formerly known as Tower Hill Mines Ltd. and changed its name to International Tower Hill Mines Ltd. in March 1991. International Tower Hill Mines Ltd. was incorporated in 1978 and is headquartered in Vancouver, Canada."}, {"name": "Josemaria Resources Inc.", "ticker": "JOSE.TO", "sector": "", "description": "Josemaria Resources Inc., through its subsidiaries, engages in the acquisition, exploration, and development of mineral properties in South America. The company explores for copper, gold, and silver deposits. It holds 100% interests in Josemaria project located in the San Juan province, Argentina. The company was formerly known as NGEx Resources Inc. and changed its name to Josemaria Resources Inc. in July 2019. Josemaria Resources Inc. was incorporated in 1983 and is headquartered in Vancouver, Canada. As of April 28, 2022, Josemaria Resources Inc. operates as a subsidiary of Lundin Mining Corporation."}, {"name": "Kinross Gold Corporation", "ticker": "K.TO", "sector": "Basic Materials", "description": "Kinross Gold Corporation, together with its subsidiaries, engages in the acquisition, exploration, and development of gold properties principally in the United States, the Russian Federation, Brazil, Chile, Ghana, and Mauritania. It is also involved in the extraction and processing of gold-containing ores; reclamation of gold mining properties; and production and sale of silver. Kinross Gold Corporation was founded in 1993 and is headquartered in Toronto, Canada."}, {"name": "Kelso Technologies Inc.", "ticker": "KLS.TO", "sector": "Industrials", "description": "Kelso Technologies Inc. develops, produces, and distributes proprietary equipment used in transportation applications in the United States and Canada. The company offers railway equipment, such as bottom outlet, pressure relief, vacuum relief, and check valves, as well as one-bolt manways, pressure cars, pressure differential parts, tank gauges, laboratory test equipment, and wheel cleaners; emergency response kits; and fueling valves. It also provides trucking components, including one-bolt manways and pressure/vacuum safety valves for tank trailers; and suspension systems for fleet vehicles to access wilderness worksites. The company was formerly known as Kelso Resources Ltd. and changed its name to Kelso Technologies Inc. in July 1994. Kelso Technologies Inc. was incorporated in 1987 and is headquartered in Surrey, Canada."}, {"name": "Lithium Americas Corp.", "ticker": "LAC.TO", "sector": "Basic Materials", "description": "Lithium Americas Corp. operates as a resource company in the United States and Argentina. The company explores for lithium deposits. It owns interests in the Cauchari-Olaroz project located in Jujuy province of Argentina; Thacker Pass project located in north-western Nevada; and Pastos Grandes project located in the Salta province of Argentina. The company was formerly known as Western Lithium USA Corporation and changed its name to Lithium Americas Corp. in March 2016. Lithium Americas Corp. was incorporated in 2007 and is headquartered in Vancouver, Canada."}, {"name": "Laramide Resources Ltd.", "ticker": "LAM.TO", "sector": "Basic Materials", "description": "Laramide Resources Ltd. engages in the mining, exploration, and development of uranium assets in Australia, Canada, and the United States. It holds 100% interest in the Church rock uranium project, the Crownpoint uranium project, the La Jara Mesa Uranium project, and the La Sal Uranium project located in the United States; and holds 100% interest in the Westmoreland Uranium project and the Murphy uranium project located in Australia. The company was incorporated in 1980 and is headquartered in Toronto, Canada."}, {"name": "Lion Electric Company (The)", "ticker": "LEV.TO", "sector": "Industrials", "description": "The Lion Electric Company designs, develops, manufactures, and distributes purpose-built all-electric medium and heavy-duty urban vehicles in North America. Its products include battery systems, chassis, bus bodies, and truck cabins. The company also distributes truck and bus parts, as well as accessories. The Lion Electric Company was incorporated in 2008 and is based in Saint-Jérôme, Canada."}, {"name": "Largo Inc.", "ticker": "LGO.TO", "sector": "Basic Materials", "description": "Largo Inc. engages in the development and sale of vanadium-based utility scale electrical energy storage systems in Canada. The company operates in five segments: Sales & Trading, Mine Properties, Corporate, Exploration and Evaluation Properties, and Largo Clean Energy. Its products include VPURE+ vanadium flakes that are used in the production of master alloys and aerospace applications; VPURE vanadium flakes ferrovanadium and vanadium carbon nitride for the steel industry; and VPURE+ vanadium powder for catalyst applications. The company offers renewable energy solutions through Largo Clean Energy. Its products are sourced from vanadium deposits at the Maracás Menchen Mine in Brazil. The company was formerly known as Largo Resources Ltd. and changed its name to Largo Inc. in November 2021. Largo Inc. was incorporated in 1988 and is headquartered in Toronto, Canada."}, {"name": "Lightspeed Commerce Inc.", "ticker": "LSPD.TO", "sector": "Technology", "description": "Lightspeed Commerce Inc. provides commerce enabling Software as a Service (SaaS) platform for small and midsize businesses, retailers, restaurants, and golf course operators in Canada, the United States, Germany, Australia, and internationally. Its SaaS platform enables customers to engage with consumers, manage operations, accept payments, etc. The company's cloud platforms are designed interrelated elements, such as omni-channel consumer experience, a comprehensive back-office operations management suite to improve customers' efficiency and insight, and the facilitation of payments. Its platform functionalities include full omni-channel capabilities, order-ahead and curbside pickup, point of sale, product and menu management, employee and inventory management, analytics and reporting, multi-location connectivity, loyalty, customer management, and tailored financial solutions. The company also offers Lightspeed Loyalty; Lightspeed Analytics; Lightspeed Payments, a payment processing solution; and Lightspeed Capital, a merchant cash advance program. In addition, it sells a suite of hardware products to complement its software solutions for the retail and hospitality segments, such as customer facing displays, stands, barcode scanners, receipt printers, cash drawers, payment terminals, and an assortment of other accessories, as well as provides installation and implementation services. The company was formerly known as Lightspeed POS Inc. and changed its name to Lightspeed Commerce Inc. in August 2021. Lightspeed Commerce Inc. was incorporated in 2005 and is headquartered in Montréal, Canada."}, {"name": "Lundin Gold Inc.", "ticker": "LUG.TO", "sector": "Basic Materials", "description": "Lundin Gold Inc. operates as a mining company in Canada. The company holds interests in 27 metallic mineral concessions and three construction material concessions covering an area of approximately 64,270 hectares located in Southeast Ecuador. It primary holds interests in the Fruta del Norte gold project comprising seven concessions covering an area of approximately 5,566 hectares located near the city of Loja in Ecuador. The company was formerly known as Fortress Minerals Corp. and changed its name to Lundin Gold Inc. in December 2014. Lundin Gold Inc. was incorporated in 1986 and is headquartered in Vancouver, Canada."}, {"name": "Lundin Mining Corporation", "ticker": "LUN.TO", "sector": "Basic Materials", "description": "Lundin Mining Corporation, a diversified base metals mining company, engages in the exploration, development, and mining of mineral properties in Brazil, Chile, Portugal, Sweden, and the United States. It primarily produces copper, zinc, nickel, and gold, as well as lead, silver, and other metals. The company holds 100% interests in the Chapada mine located in Brazil; the Neves-Corvo mine located in Portugal; the Eagle mine located in the United States; and the Zinkgruvan mine located in Sweden. It also holds 80% interests in the Candelaria and Ojos del Salado mining complex located in Chile. The company was formerly known as South Atlantic Ventures Ltd. and changed its name to Lundin Mining Corporation in August 2004. Lundin Mining Corporation was incorporated in 1994 and is headquartered in Toronto, Canada."}, {"name": "MAG Silver Corp.", "ticker": "MAG.TO", "sector": "Basic Materials", "description": "MAG Silver Corp. engages in the exploration and development of precious metal mining properties. The company explores for silver, gold, lead, and zinc deposits. It primarily holds 44% interest in the Juanicipio project located in the Fresnillo District, Zacatecas State, Mexico. The company is headquartered in Vancouver, Canada."}, {"name": "Maxar Technologies Inc.", "ticker": "MAXR.TO", "sector": "Technology", "description": "Maxar Technologies Inc. provides earth intelligence and space infrastructure solutions in the United States, Asia, South America, Europe, the Middle East, Australia, Canada, and internationally. It operates through two segments, Earth Intelligence and Space Infrastructure. The Earth Intelligence segment offers earth imagery and other geospatial data sourced from its advanced satellite constellation and third-party providers to public sector and enterprise customers, as well as a provides advanced geospatial information, applications, and analytic services for national security and commercial solutions. Its solutions include satellite access, geospatial foundation, precision mapping, on-demand intelligence, and geospatial services. It serves U.S. and international government agencies, and enterprise customer verticals. The Space Infrastructure segment provides space-based infrastructure, robotics, sub-systems, and information solutions, including communication and imaging satellites and payloads; platforms for space exploration and hosting instruments for earth science; space subsystems for power, propulsion, and communication; satellite ground systems and support services; space-based remote sensory solutions; space robotics; and defense systems. This segment serves government agencies and satellite operators. Maxar Technologies Inc. was founded in 1957 and is headquartered in Westminster, Colorado."}, {"name": "Medicenna Therapeutics Corp.", "ticker": "MDNA.TO", "sector": "Healthcare", "description": "Medicenna Therapeutics Corp., a clinical stage immunotherapy company, engages in the development and commercialization of Superkines and empowered Superkines for the treatment of cancer and other diseases. Its lead product is MDNA55, an interleukin- 4 (IL-4) EC that has completed Phase 2b clinical trial for the treatment of recurrent glioblastoma (rGBM), as well as preclinical and clinical development stages for the treatment of other brain and non-brain tumors. The company also develops MDNA55, which has completed Phase 2b clinical trial to treat rGBM; MDNA109, an enhanced version of IL-2 to activate and proliferate the immune cells needed to fight cancer; MDNA209, an IL-2 antagonist for autoimmune diseases, such as multiple sclerosis and graft versus host disease (GvHD); MDNA413, a dual IL-4/IL-13 antagonist to treat solid tumors; and MDNA132, an IL-13 Superkine to chimeric antigen receptor T (CAR-T) platform. In addition, it provides BiSKITs platform to develop designer Superkines by fusing them to other proteins, antibodies, or naked IL-2, IL-4, and IL-13 Superkines. Medicenna Therapeutics Corp. is headquartered in Toronto, Canada."}, {"name": "Manulife Financial Corporation", "ticker": "MFC.TO", "sector": "Financial Services", "description": "Manulife Financial Corporation, together with its subsidiaries, provides financial products and services in Asia, Canada, the United States, and internationally. The company operates through Wealth and Asset Management Businesses; Insurance and Annuity Products; And Corporate and Other segments. The Wealth and Asset Management Businesses segment provides mutual funds and exchange-traded funds, group retirement and savings products, and institutional asset management services through agents and brokers affiliated with the company, securities brokerage firms, and financial advisors pension plan consultants and banks. The Insurance and Annuity Products segment offers deposit and credit products; individual life, and individual and group long-term care insurance; and guaranteed and partially guaranteed annuity products through insurance agents, brokers, banks, financial planners, and direct marketing. The Corporate and Other segment is involved in property and casualty insurance and reinsurance businesses; and run-off reinsurance operations, including variable annuities, and accident and health. It also manages timberland and agricultural portfolios; and engages in insurance agency, portfolio and mutual fund management, mutual fund dealer, life, annuity, long-term care, and financial reinsurance; and fund management businesses. Additionally, the company holds and manages provides investment management, counseling, advisory, and dealer services. Manulife Financial Corporation was incorporated in 1887 and is headquartered in Toronto, Canada."}, {"name": "Magna International Inc.", "ticker": "MG.TO", "sector": "Consumer Cyclical", "description": "Magna International Inc. designs, engineers, and manufactures components, assemblies, systems, subsystems, and modules for original equipment manufacturers of vehicles and light trucks worldwide. It operates through four segments: Body Exteriors & Structures, Power & Vision, Seating Systems, and Complete Vehicles. The Body Exteriors & Structures segment provides body and chassis, exterior, and roof systems, as well as battery enclosures and engineering and testing services, including fascia and trims, front end modules, front integration panels, liftgate modules, active aerodynamics, engineered glass, running boards, truck bed access products, and side doors. The Power & Vision segment offers hybrid and electric drive systems, motors, inverters, onboard chargers, and e-clutch; dedicated hybrid, dual and hybrid dual, and manual transmissions; AWD/4WD products and rear drive modules; transmission, engine, driveline components, engine drive plates, and accessories; engineering services; advanced driver assistance systems and sensors, and electronic control units; interior and exterior mirrors, camera and driver monitoring systems and electronics, actuators, door handles, and overhead consoles; forward, rear, and auxiliary lighting products; latching, door modules, window, power closure, and hinges and wire forming systems; and modular and textile folding roofs, and hard and soft tops. The Seating Systems segment provides seat structures, mechanism and hardware solutions, and foam and trim products. The Complete Vehicles segment offers vehicle engineering and manufacturing services. The company also designs, engineers, and manufactures tooling products. Magna International Inc. was founded in 1957 and is headquartered in Aurora, Canada."}, {"name": "Maverix Metals Inc.", "ticker": "MMX.TO", "sector": "Basic Materials", "description": "Maverix Metals Inc., together with its subsidiaries, operates as a precious metals royalty and streaming company in Canada. The company explores for gold, silver, lead, zinc, copper, nickel, and other metals. It has a portfolio of over 100 royalties and streams in the Americas and Australia. The company was incorporated in 2016 and is headquartered in Vancouver, Canada."}, {"name": "Mogo Inc.", "ticker": "MOGO.TO", "sector": "Technology", "description": "Mogo Inc. operates as a financial technology company in Canada and internationally. The company provides digital solutions to the consumers to get in control of their financial health. It offers Mogo app to access a digital spending account with Mogo Visa Platinum Prepaid Card; MogoCrypto that enables the buying and selling of bitcoin; MogoProtect, a free ID fraud protection and monthly credit score monitoring; MogoMortgage, a digital mortgage experience; and MogoMoney that provides access to personal loans. The company also offers Mogo Trade, a free stock trading platform with real-time stock quotes and funding; and Mogo Ventures to manage its existing investments in strategic partners and companies. In addition, it operates Carta, a digital payments software platform that enable financial technology companies, banks, and corporations to issue payment products to consumers via multiple channels, including physical, virtual, and tokenized cards, as well as payment switching and routing services. Mogo Inc. was founded in 2003 and is headquartered in Vancouver, Canada."}, {"name": "Mountain Province Diamonds Inc.", "ticker": "MPVD.TO", "sector": "Basic Materials", "description": "Mountain Province Diamonds Inc. focuses on the mining and marketing of rough diamonds worldwide. Its primary asset is its 49% interest in the Gahcho Kué diamond mine comprising mining leases covering an area of 5,216 hectares; and holds a 100% interest in the Kennady North project consisting of 22 federal leases and 97 claims covering an area of 107,000 hectares located in the Northwest Territories, Canada. The company was formerly known as Mountain Province Mining Inc. and changed its name to Mountain Province Diamonds Inc. in October 2000. Mountain Province Diamonds Inc. was incorporated in 1986 and is headquartered in Toronto, Canada."}, {"name": "McEwen Mining Inc.", "ticker": "MUX.TO", "sector": "Basic Materials", "description": "McEwen Mining Inc. engages in the exploration, development, production, and sale of gold and silver deposits in the United States, Canada, Mexico, and Argentina. The company also explores for copper deposits. It primarily owns a 100% interest in the Gold Bar mine in Eureka County, Nevada; the Black Fox gold mine in Ontario, Canada; the El Gallo Project and Fenix silver-gold project in Sinaloa, Mexico; the Los Azules copper deposit in San Juan, Argentina; and a portfolio of exploration properties in Nevada, Canada, Mexico, and Argentina. It also owns a 49% interest in the San José mine located in Argentina. The company was formerly known as US Gold Corporation and changed its name to McEwen Mining Inc. in January 2012. McEwen Mining Inc. was incorporated in 1979 and is headquartered in Toronto, Canada."}, {"name": "Methanex Corporation", "ticker": "MX.TO", "sector": "Basic Materials", "description": "Methanex Corporation produces and supplies methanol in North America, the Asia Pacific, Europe, and South America. The company also purchases methanol produced by others under methanol offtake contracts and on the spot market. In addition, it owns and leases storage and terminal facilities. The company owns and manages a fleet of approximately 30 ocean-going vessels. It serves chemical and petrochemical producers. Methanex Corporation was incorporated in 1968 and is headquartered in Vancouver, Canada."}, {"name": "Newcrest Mining Limited", "ticker": "NCM.TO", "sector": "Basic Materials", "description": "Newcrest Mining Limited, together with its subsidiaries, engages in the exploration, mine development, mine operation, and sale of gold and gold/copper concentrates. It is also involved in the exploration and production of silver deposits. The company primarily owns and operates mines and projects located in Cadia, Telfer, and Havieron, Australia; Lihir and Wafi-Golpu, Papua New Guinea; Red Chris in British Columbia, Canada; and Fruta Del Norte, Ecuador. Newcrest Mining Limited was founded in 1966 and is headquartered in Melbourne, Australia."}, {"name": "Northern Dynasty Minerals Ltd.", "ticker": "NDM.TO", "sector": "Basic Materials", "description": "Northern Dynasty Minerals Ltd. engages in the exploration of mineral properties in the United States. Its principal mineral property is the Pebble Copper-Gold-Molybdenum-Silver-Rhenium project comprising 1,840 mineral claims that covers an area of approximately 274 square miles located in southwest Alaska, 17 miles from the villages of Iliamna and Newhalen, and approximately 200 miles southwest of the city of Anchorage. The company was formerly known as Northern Dynasty Explorations Ltd. and changed its name to Northern Dynasty Minerals Ltd. in October 1997. Northern Dynasty Minerals Ltd. was incorporated in 1983 and is headquartered in Vancouver, Canada."}, {"name": "Neptune Wellness Solutions Inc.", "ticker": "NEPT.TO", "sector": "Healthcare", "description": "Neptune Wellness Solutions Inc. operates as an integrated health and wellness company. It builds a portfolio of lifestyle brands and consumer packaged goods products under the Biodroga Neutraceuticals, Forest Remedies, Ocean Remedies, Neptune Wellness, Mood Ring, PanHash, Sprout, Nosh, and NurturMe brands. The company offers turnkey product development and supply chain solutions to business customers in various health and wellness verticals, such as legal cannabis and hemp, nutraceuticals, and white label consumer packaged goods. It is also involved in the extraction, purification, formulation, and manufacturing of health and wellness products, such as omega-3 and hemp-derived products under various delivery forms, such as soft gels, liquids, capsules, vape pens, sprays, topicals, sachets, tinctures, concentrates, edibles, and beverages, as well as hand sanitizers, non-contact thermometers, and gloves. In addition, the company offers Maxsimil, an omega-3 fatty acid delivery technology that uses enzymes that mimic the natural human digestive system to predigest omega-3 fatty acids. It has a collaboration agreement with International Flavors & Fragrances Inc. to co-develop hemp-derived CBD products for the mass retail, and health and wellness markets. The company was incorporated in 1998 and is headquartered in Laval, Canada."}, {"name": "Novagold Resources Inc.", "ticker": "NG.TO", "sector": "Basic Materials", "description": "NovaGold Resources Inc. explores for and develops gold mineral properties in the United States. Its principal asset is the Donlin Gold project consisting of 493 mining claims covering an area of approximately 29,008 hectares located in the Kuskokwim region of southwestern Alaska. The company was formerly known as NovaCan Mining Resources (1985) Limited and changed its name to NovaGold Resources Inc. in March 1987. NovaGold Resources Inc. was incorporated in 1984 and is based in Vancouver, Canada."}, {"name": "New Gold Inc.", "ticker": "NGD.TO", "sector": "Basic Materials", "description": "New Gold Inc., an intermediate gold mining company, engages in the exploration, development, and operation of mineral properties. It primarily explores for gold, silver, and copper deposits. The company's principal operating properties include 100% interests in the Rainy River mine located in Ontario, Canada; and New Afton mine situated in British Columbia, Canada. It also operates the Cerro San Pedro mine in San Luis Potosí, Mexico. The company was incorporated in 1980 and is headquartered in Toronto, Canada."}, {"name": "Newmont Corporation", "ticker": "NGT.TO", "sector": "Basic Materials", "description": "Newmont Corporation engages in the production and exploration of gold. It also explores for copper, silver, zinc, and lead. The company has operations and/or assets in the United States, Canada, Mexico, Dominican Republic, Peru, Suriname, Argentina, Chile, Australia, and Ghana. As of December 31, 2021, it had proven and probable gold reserves of 92.8 million ounces and land position of 62,800 square kilometers. The company was founded in 1916 and is headquartered in Denver, Colorado."}, {"name": "North American Construction Group Ltd.", "ticker": "NOA.TO", "sector": "Energy", "description": "North American Construction Group Ltd. provides equipment maintenance, and mining and heavy construction services in Canada, the United States, and Australia. The company's Heavy Construction & Mining division offers constructability reviews, budgetary cost estimates, design-build construction, project management, contract mining, pre-stripping/pit pioneering, overburden removal and stockpile, muskeg removal and stockpile, site preparation, air strip construction, site dewatering/perimeter ditching, tailings and process pipelines, haulage and access road construction, tailings dam construction and densification, mechanically stabilized earth walls, dyke construction, and reclamation services. Its Equipment Maintenance Services division provides fuel and lube servicing, portable steaming, equipment inspections, parts and component supply, major overhauls and equipment refurbishment, onsite haul truck brake testing, onsite maintenance support, under carriage rebuild, machining, hose manufacturing, and technical support services, as well as welding, fabrication/repairs, weld certification, and inspection services. As of December 31, 2021, the company operated a heavy equipment fleet of 632 units. It serves resource development and industrial construction sectors. The company was formerly known as North American Energy Partners Inc. and changed its name to North American Construction Group Ltd. in April 2018. North American Construction Group Ltd. was founded in 1953 and is headquartered in Acheson, Canada."}, {"name": "Nomad Royalty Company Ltd.", "ticker": "NSR.TO", "sector": "Basic Materials", "description": "Nomad Royalty Company Ltd. operates as a gold and silver royalty company that purchases rights to the gold or silver produced from a mine. The company owns a portfolio of 22 royalty, stream, and other interests. Nomad Royalty Company Ltd. is headquartered in Montreal, Canada."}, {"name": "Nutrien Ltd.", "ticker": "NTR.TO", "sector": "Basic Materials", "description": "Nutrien Ltd. provides crop inputs and services. It offers potash, nitrogen, phosphate, and sulfate products; and financial solutions. The company also distributes crop nutrients, crop protection products, seeds, and merchandise products through approximately 2,000 retail locations in the United States, Canada, South America, and Australia. In addition, it provides services directly to growers through a network of farm centers in North America, South America, and Australia. The company was founded in 2017 and is headquartered in Saskatoon, Canada."}, {"name": "New Pacific Metals Corp.", "ticker": "NUAG.TO", "sector": "Basic Materials", "description": "New Pacific Metals Corp., together with its subsidiaries, engages in the exploration and development of mineral properties in Bolivia and Canada. It explores for silver, gold, lead, and zinc deposits. The company's flagship property is the Silver Sand property, which cover an area of 5.42 square kilometers located in the Potosí Department, Bolivia. It also owns Silverstrike property located in southwest of La Paz, Bolivia; and Carangas property located in La Ruta de la Plata. The company was formerly known as New Pacific Holdings Corp. and changed its name to New Pacific Metals Corp. in July 2017. New Pacific Metals Corp. is headquartered in Vancouver, Canada."}, {"name": "Neovasc Inc.", "ticker": "NVCN.TO", "sector": "Healthcare", "description": "Neovasc Inc., a specialty medical device company, develops, manufactures, and markets products for cardiovascular marketplace in Europe and internationally. Its products include the Tiara technology for the transcatheter treatment of mitral valve disease; and the Neovasc Reducer for the treatment of refractory angina. The company was formerly known as Medical Ventures Corp. and changed its name to Neovasc Inc. in July 2008. Neovasc Inc. was incorporated in 2000 and is headquartered in Richmond, Canada."}, {"name": "Nuvei Corporation", "ticker": "NVEI.TO", "sector": "Technology", "description": "Nuvei Corporation provides payment technology solutions to merchants and partners in North America, Europe, the Middle East and Africa, Latin America, and the Asia Pacific. It provides a suite of payment solutions to support lifecycle of a transaction across mobile or in-app, online, unattended, and in-store channels. The company sells and distributes its solutions through direct sales, indirect sales for small-and-medium sized businesses, and eCommerce resellers. Nuvei Corporation was founded in 2003 and is headquartered in Montreal, Canada."}, {"name": "NexGen Energy Ltd.", "ticker": "NXE.TO", "sector": "Energy", "description": "NexGen Energy Ltd., an exploration and development stage company, engages in the acquisition, exploration, and evaluation and development of uranium properties in Canada. Its principal asset is the Rook I project comprising 32 contiguous mineral claims totaling an area of 35,065 hectares located in the southwestern Athabasca Basin of Saskatchewan. The company is headquartered in Vancouver, Canada."}, {"name": "Obsidian Energy Ltd.", "ticker": "OBE.TO", "sector": "Energy", "description": "Obsidian Energy Ltd. primarily focuses on the exploration, production, and development of oil and natural gas properties in the Western Canada Sedimentary Basin. The company was formerly known as Penn West Petroleum Ltd. and changed its name to Obsidian Energy Ltd. in June 2017. Obsidian Energy Ltd. is headquartered in Calgary, Canada."}, {"name": "OceanaGold Corporation", "ticker": "OGC.TO", "sector": "Basic Materials", "description": "OceanaGold Corporation, a gold producer, engages in the exploration, development, and operation of mineral properties. It explores for gold, copper, and silver deposits. The company operates the Didipio gold-copper mine located in the Nueva Vizcaya and Quirino provinces on the island of Luzon in the Philippines; the Macraes goldfield mine on the South Island of New Zealand and the Waihi gold mine on the North Island of New Zealand; and the Haile gold mine located in South Carolina, the United States. OceanaGold Corporation was founded in 2003 and is based in South Brisbane, Australia."}, {"name": "Organigram Holdings Inc.", "ticker": "OGI.TO", "sector": "Healthcare", "description": "Organigram Holdings Inc., through its subsidiaries, produces and sells cannabis and cannabis-derived products in Canada. It offers medical cannabis products, including cannabis flowers, cannabis oils, and vaporizers for civilian patients and veterans; adult use recreational cannabis under the Edison Cannabis Co., Trail Blazer, SHRED, SHRED'ems, Big Bag O' Buds, and Monjour brands; and cannabis edibles products and concentrates. The company also engages in the wholesale shipping of cannabis plant cuttings, dried flowers, blends, pre-rolls, and cannabis derivative based products to retailers and wholesalers for adult-use recreational cannabis. It sells its products through online, as well as telephone channels. Organigram Holdings Inc. was founded in 2013 and is headquartered in Moncton, Canada."}, {"name": "Orla Mining Ltd.", "ticker": "OLA.TO", "sector": "Basic Materials", "description": "Orla Mining Ltd. acquires, explores for, and develops mineral properties. The company explores for gold, silver, zinc, lead, and copper deposits. It owns 100% interests in the Camino Rojo project that consists of seven concessions covering an area of 163,129 hectares located in Zacatecas, Mexico; and Cerro Quema project totaling an area of 14,800 hectares located in the Azuero Peninsula, Panama. The company was formerly known as Red Mile Minerals Corp. and changed its name to Orla Mining Ltd. in June 2015. Orla Mining Ltd. was incorporated in 2007 and is headquartered in Vancouver, Canada."}, {"name": "Oncolytics Biotech Inc.", "ticker": "ONC.TO", "sector": "Healthcare", "description": "Oncolytics Biotech Inc., a development-stage biopharmaceutical company, focuses on the discovery and development of pharmaceutical products for the treatment of cancer. Its lead product is pelareorep, an intravenously delivered immunotherapeutic agent for the treatment of solid tumors and hematological malignancies. Oncolytics Biotech Inc. has a co-development agreement with Merck KGaA and Pfizer Inc. to co-develop pelareorep in combination with paclitaxel and avelumab, a human anti-PD-L1 antibody for the treatment of hormone receptor-positive/human epidermal growth factor 2-negative metastatic breast cancer; and PrECOG LLC. The company was incorporated in 1998 and is headquartered in Calgary, Canada."}, {"name": "Osisko Gold Royalties Ltd.", "ticker": "OR.TO", "sector": "Basic Materials", "description": "Osisko Gold Royalties Ltd acquires and manages precious metal and other royalties, streams, and offtake and other interests in Canada and internationally. It also owns options on royalty/stream financings; and exclusive rights to participate in future royalty/stream financings on various projects. The company's primary asset is a 5% net smelter return royalty on the Canadian Malartic mine located in Canada. It is also involved in the exploration, evaluation, and development of mining projects. It primarily explores for precious metals, including gold, silver, diamond, and others. The company is headquartered in Montreal, Canada."}, {"name": "Open Text Corporation", "ticker": "OTEX.TO", "sector": "Technology", "description": "Open Text Corporation engages in the designs, develops, markets, and sells information management software and solutions. It offers content services; business network that manages data within the organization and outside the firewall; security and protection solutions for defending against cyber threats, and preparing for business continuity and response in the event of a breach; digital investigation and forensic security solutions; OpenText security solutions to address information cyber resilience needs; Carbonite and Webroot products; and OpenText Information Management software platform. The company also provides Discovery platform that provides forensics and unstructured data analytics; OpenText Developer Cloud; key developer API services; AI and analytics that leverages structured or unstructured data; digital process automation solutions, which enables organizations to transform into digital data-driven businesses; and OpenText Digital Experience platform. In addition, it offers customer support programs, including access to software upgrades, a knowledge base, discussions, product information, and an online mechanism to post and review trouble tickets; and consulting and learning services relating to the implementation, training, and integration of its licensed product offerings, as well as cloud services. The company serves organizations, enterprise and mid-market companies, public sector agencies, small and medium-sized businesses, and direct consumers in Canada, the United States, the United Kingdom, Germany, rest of Europe, the Middle East, Africa, and internationally. It has strategic partnerships with SAP SE, Google Cloud, Amazon AWS, Microsoft Corporation, Oracle Corporation, Salesforce.com Corporation, Accenture plc, ATOS, Capgemini Technology Services SAS, Cognizant Technology Solutions U.S. Corp., Deloitte Consulting LLP, and Tata Consultancy Services. The company was incorporated in 1991 and is headquartered in Waterloo, Canada."}, {"name": "Ovintiv Inc.", "ticker": "OVV.TO", "sector": "Energy", "description": "Ovintiv Inc., together with its subsidiaries, engages in the exploration, development, production, and marketing of natural gas, oil, and natural gas liquids. It operates through USA Operations, Canadian Operations, and Market Optimization segments. The company's principal assets include Permian in west Texas and Anadarko in west-central Oklahoma; and Montney in northeast British Columbia and northwest Alberta. Its other upstream assets comprise Bakken in North Dakota, and Uinta in central Utah; and Horn River in northeast British Columbia, and Wheatland in southern Alberta. The company was formerly known as Encana Corporation and changed its name to Ovintiv Inc. in January 2020. Ovintiv Inc. was incorporated in 2020 and is based in Denver, Colorado."}, {"name": "Pan American Silver Corp.", "ticker": "PAAS.TO", "sector": "Basic Materials", "description": "Pan American Silver Corp., together with its subsidiaries, engages in the exploration, mine development, extraction, processing, refining, and reclamation of silver, gold, zinc, lead, and copper mines in Canada, Mexico, Peru, Argentina, and Bolivia. It holds interests in the La Colorada, Dolores, Huaron, Morococha, Shahuindo, La Arena, Timmins West, Bell Creek, Manantial Espejo, San Vicente, Joaquin, Cap-Oeste Sur Este, and Navidad mines. The company was formerly known as Pan American Minerals Corp. and changed its name to Pan American Silver Corp. in April 1995. Pan American Silver Corp. was incorporated in 1979 and is headquartered in Vancouver, Canada."}, {"name": "Precision Drilling Corporation", "ticker": "PD.TO", "sector": "Energy", "description": "Precision Drilling Corporation, a drilling company, provides onshore drilling, completion, and production services to exploration and production companies in the oil and natural gas and geothermal industries in North America and the Middle East. The company operates in two segments, Contract Drilling Services; and Completion and Production Services. The Contract Drilling Services segment offers onshore well drilling services to exploration and production companies in the oil and natural gas industry. This segment's services include land and turnkey drilling; and procurement and distribution of oilfield supplies, as well as manufacture and refurbishment of drilling and service rig equipment. As of December 31, 2021, it operated 227 land drilling rigs, including 109 in Canada; 105 in the United States; 6 in Kuwait; 4 in Saudi Arabia; 2 in the Kurdistan region of Iraq; and 1 in the country of Georgia. As of December 31, 2021, this segment also operated 47 AlphaTM rigs with commercial AlphaAutomation; 18 AlphaApps; 4 grid power capable rigs; and 60 natural gas or bi-fuel rigs. The Completion and Production Services segment provides service rigs for well completion, workover, abandonment, maintenance, and re-entry preparation services; wellsite accommodations; oilfield surface equipment rentals; and camp and catering services to oil and natural gas exploration and production companies. As of December 31, 2021, it operated 123 well completion and workover service rigs, including 113 in Canada and 10 in the United States; 1,900 oilfield rental items, including surface storage, small-flow wastewater treatment, power generation, and solids control equipment; 109 wellsite accommodation units; 943 drill camp beds; 822 base camp beds; and three kitchen diners in Canada. Precision Drilling Corporation was incorporated in 1951 and is headquartered in Calgary, Canada."}, {"name": "Sprott Physical Gold Trust", "ticker": "PHYS.TO", "sector": "Financial Services", "description": "Sprott Physical Gold Trust is an exchange traded commodity launched and managed by Sprott Asset Management, LP. The fund invests in the commodity markets. It primarily invests in physical gold bullion in London Good Delivery bar form. Sprott Physical Gold Trust was formed on August 28, 2009 and is domiciled in Canada."}, {"name": "Polymet Mining Corp.", "ticker": "POM.TO", "sector": "Basic Materials", "description": "PolyMet Mining Corp., through its subsidiary, Poly Met Mining, Inc., engages in the exploration and development of natural resource properties. Its primary mineral property is the NorthMet project, a polymetallic project that hosts copper, nickel, cobalt, gold, silver, and platinum group metal mineralization covering an area of approximately 4,300 acres located in northeastern Minnesota, the United States. The company was formerly known as Fleck Resources Ltd. and changed its name to PolyMet Mining Corp. in June 1998. PolyMet Mining Corp. was incorporated in 1981 and is headquartered in Saint Paul, Minnesota."}, {"name": "Pembina Pipeline Corporation", "ticker": "PPL.TO", "sector": "Energy", "description": "Pembina Pipeline Corporation provides transportation and midstream services for the energy industry. It operates through three segments: Pipelines, Facilities, and Marketing & New Ventures. The Pipelines segment operates conventional, oil sands and heavy oil, and transmission assets with a transportation capacity of 3.1 millions of barrels of oil equivalent per day, ground storage of 11 millions of barrels, and rail terminalling capacity of approximately 105 thousands of barrels of oil equivalent per day serving markets and basins across North America. The Facilities segment offers infrastructure that provides customers with natural gas, condensate, and natural gas liquids (NGLs), including ethane, propane, butane, and condensate; and includes 354 thousands of barrels per day of NGL fractionation capacity, 21 millions of barrels of cavern storage capacity, and associated pipeline and rail terminalling facilities. The Marketing & New Ventures segment buys and sells hydrocarbon liquids and natural gas originating in the Western Canadian sedimentary basin and other basins. Pembina Pipeline Corporation was incorporated in 1954 and is headquartered in Calgary, Canada."}, {"name": "Perpetua Resources Corp.", "ticker": "PPTA.TO", "sector": "Basic Materials", "description": "Perpetua Resources Corp. engages in the mineral exploration activities in the United States. The company primarily explores for gold, silver, and antimony. Its principal asset is the 100% owned Stibnite gold project located in Valley County, Idaho. The company was formerly known as Midas Gold Corp. and changed its name to Perpetua Resources Corp. in February 2021. Perpetua Resources Corp. was incorporated in 2011 and is headquartered in Boise, Idaho."}, {"name": "Primo Water Corporation", "ticker": "PRMW.TO", "sector": "Consumer Defensive", "description": "Primo Water Corporation provides water direct to consumers and water filtration services in North America and Europe. It offers bottled water, purified bottled water, premium spring, sparkling and flavored water, mineral water, filtration equipment, and coffee; as well as water dispensers, and self-service refill drinking water. The company offers its products under the Primo, Alhambra, Crystal Rock, Mountain Valley, Deep Rock, Hinckley Springs, Crystal Springs, Kentwood Springs, Mount Olympus, Pureflo, Nursery, Sierra Springs, Sparkletts, Clear Mountain Natural Spring Water, Earth2O, Renü, Water Event Pure Water Solutions, Canadian Springs, Labrador Source, Decantae, Eden, Eden Springs, Chateaud'eau, and Mey Eden brands. It provides its services to residential customers, small and medium-sized businesses, and regional and national corporations and retailers. The company was formerly known as Cott Corporation and changed its name to Primo Water Corporation in March 2020. Primo Water Corporation was incorporated in 1955 and is headquartered in Tampa, Florida."}, {"name": "Profound Medical Corp.", "ticker": "PRN.TO", "sector": "Healthcare", "description": "Profound Medical Corp., together with its subsidiaries, operates as a commercial-stage medical device company that develops magnetic resonance guided ablation procedures for treatment of prostate disease, uterine fibroids, and palliative pain treatment in Canada, Germany, the United States, and Finland. Its lead product TULSA-PRO system used for magnetic resonance imaging scanner in hospitals and treatment facilities. The company also offers Sonalleve, a therapeutic platform for the treatment of uterine fibroids and palliative pain relief associated with metastases in bone, as well as non-invasive treatment of uterine fibroids. Profound Medical Corp. is headquartered in Mississauga, Canada."}, {"name": "Perseus Mining Limited", "ticker": "PRU.TO", "sector": "Basic Materials", "description": "Perseus Mining Limited explores, evaluates, develops, and mines for gold properties in West Africa. The company primarily holds interests in the Edikan gold mine project located in Ghana; and Sissingué and Yaoure gold projects located in Côte d'Ivoire. Perseus Mining Limited was incorporated in 2003 and is based in Subiaco, Australia."}, {"name": "Sprott Physical Silver Trust", "ticker": "PSLV.TO", "sector": "Financial Services", "description": "Sprott Physical Silver Trust is an exchange traded commodity launched and managed by Sprott Asset Management, LP. The fund invests in the commodity markets. It primarily invests in physical silver bullion in London Good Delivery bar form. Sprott Physical Silver Trust was formed on June 30, 2010 and is domiciled in Canada."}, {"name": "Platinum Group Metals Ltd.", "ticker": "PTM.TO", "sector": "Basic Materials", "description": "Platinum Group Metals Ltd. engages in the exploration and development of platinum and palladium properties. It explores for palladium, platinum, gold, copper, nickel, and rhodium deposits. The company holds 50.02% interest in the Waterberg project located on the Northern Limb of the Western Bushveld complex, South Africa. It also develops next-generation battery technology using platinum and palladium. Platinum Group Metals Ltd. was incorporated in 2000 and is headquartered in Vancouver, Canada."}, {"name": "Points.com Inc.", "ticker": "PTS.TO", "sector": "Communication Services", "description": "Points.com Inc. provides technology solutions to loyalty industry in the United States, Europe, and internationally. It offers Currency Retailing for its members to get more of their currency, whenever they need it; Travel Accrual for its members to book any hotel, car, or activity and earn currency; Everyday Accrual for members to earn currency on day-to-day purchases; Travel Rewards for members to redeem their currency for hotel stays and car rentals; Everyday Rewards for members to redeem their currency for more than travel; and Currency Utility for members to do so much more with currency. The company was founded in 2000 and is headquartered in Toronto, Canada."}, {"name": "PyroGenesis Canada Inc.", "ticker": "PYR.TO", "sector": "Industrials", "description": "PyroGenesis Canada Inc. designs, develops, manufactures, and commercializes plasma processes and systems in Canada and internationally. It offers DROSRITE, a process for enhancing metal recovery from dross without any hazardous by-products, targeting primarily the aluminum and zinc industries; PUREVAP, a process to produce high purity metallurgical and solar grade silicon from quartz; and PUREVAP Nano Silicon Reactor, which is designed to transform silicon into spherical silicon powders and silicon nanowires for use in lithium-ion batteries. The company also provides plasma torches, including APT high-powered plasma torch for replacing fossil fuel burners. In addition, it offers plasma arc waste destruction systems for waste destruction onboard ships; steam plasma arc refrigerant cracking systems for the destruction of certain refrigerants, including chlorofluorocarbons, hydrofluorocarbons, and hydrochlorofluorocarbons; plasma arc chemical warfare agent destruction systems, which are mobile platforms for the onsite destruction of chemical warfare agents; plasma resource recovery systems for land-based waste destruction and waste-to-energy applications; plasma torches for waste gasification and combustion; and plasma arc gasification and vitrification. Further, the company provides engineering and manufacturing expertise, and contract research, as well as turnkey process equipment packages to the defense, metallurgical, mining, additive manufacturing (including 3D printing), oil and gas, and environmental industries. Additionally, it offers installation, commissioning, and start-up services. The company is headquartered in Montréal, Canada."}, {"name": "Questerre Energy Corporation", "ticker": "QEC.TO", "sector": "Energy", "description": "Questerre Energy Corporation acquires, explores, and develops non-conventional oil and gas projects in Canada. It produces tight oil, oil shale, shale oil, and shale gas. The company primarily holds 40,800 acres located in Kakwa, west central Alberta, including a 25% working interest in 10,080 acres in Kakwa Central; 50% working interest in 4,480 acres in Kakwa North; 50% interest in 22,400 acres in Kakwa West; and 50% interest in 3,840 acres in Kakwa South. It also holds 100% working interest in 11,952 acres located in Antler, Saskatchewan; and oil shale assets in Jordan. The company was formerly known as Westpro Equipment Ltd. and changed its name to Questerre Energy Corporation in December 2000. Questerre Energy Corporation was incorporated in 1971 and is headquartered in Calgary, Canada."}, {"name": "Restaurant Brands International Inc.", "ticker": "QSR.TO", "sector": "Consumer Cyclical", "description": "Restaurant Brands International Inc. operates as quick service restaurant company in Canada and internationally. It operates through four segments: Tim Hortons (TH), Burger King (BK), Popeyes Louisiana Kitchen (PLK), and Firehouse Subs (FHS). The company owns and franchises TH chain of donut/coffee/tea restaurants that offer blend coffee, tea, and espresso-based hot and cold specialty drinks; and fresh baked goods, including donuts, Timbits, bagels, muffins, cookies and pastries, grilled paninis, classic sandwiches, wraps, soups, and others. It is also involved in owning and franchising BK, a fast food hamburger restaurant chain, which offers flame-grilled hamburgers, chicken and other specialty sandwiches, french fries, soft drinks, and other food items; and PLK quick service restaurants that provide Louisiana style fried chicken, chicken tenders, fried shrimp and other seafood, red beans and rice, and other regional items. In addition, the company owns and franchises FHS restaurants quick service restaurants that offer subs, soft drinks, and local specialties. As of February 15, 2022, the company had approximately 29,000 restaurants in 100 countries under the Tim Hortons, Burger King, Popeyes, And Firehouse Subs brands. Restaurant Brands International Inc. was founded in 1954 and is headquartered in Toronto, Canada."}, {"name": "Quarterhill Inc.", "ticker": "QTRH.TO", "sector": "Technology", "description": "Quarterhill Inc. operates in the intelligent transportation system and intellectual property licensing industries worldwide. Its Licensing segment includes patents relating to wireless communications, memory interface technologies, semiconductor manufacturing and packaging technologies, wired connectivity, automotive applications, computer gaming, intelligent personal assistant technologies, enhanced image processing, streaming video technologies, non-volatile Flash memory, DRAM and other memory technologies, and semiconductor analog circuitry technologies. The company's Intelligent Systems segment provides international road dynamics products and services, such as red light and speed enforcement systems, automated truck weigh stations; toll road systems and equipment; traffic management and safety systems; VectorSense, a tire sensor suite; Vehicle Information-In-Motion, a traffic intelligence system; integrated traffic control systems; permanent and portable slow speed weigh-in-motion systems; portable wheel load scales; traffic data collection products; vehicle and axle detection equipment; and automated vehicle identification services and equipment, and other hardware and software products and offerings for the intelligent transportation systems industry. This segment serves through direct salespeople, distributors, agents, contractors, and systems integrators. The company was formerly known as Wi-LAN Inc. and changed its name to Quarterhill Inc. in June 2017. Quarterhill Inc. was incorporated in 1992 and is headquartered in Toronto, Canada."}, {"name": "Ritchie Bros. Auctioneers Incorporated", "ticker": "RBA.TO", "sector": "Industrials", "description": "Ritchie Bros. Auctioneers Incorporated, an asset management and disposition company, sells industrial equipment and other durable assets through its unreserved auctions, online marketplaces, listing services, and private brokerage services. It sells a range of used and unused commercial assets, including earthmoving equipment, truck tractors and trailers, government surplus, oil and gas equipment, and other industrial assets, as well as construction and heavy machinery. The company also offers live auction events with online bidding. It sells used equipment to its customers through live unreserved auctions at 40 auction sites worldwide. The company serves construction, transportation, agriculture, energy, oil and gas, mining, and forestry sectors. It operates in the United States, Canada, Australia, the United Arab Emirates, the Netherlands, Europe, the Middle East, Asia, and internationally. Ritchie Bros. Auctioneers Incorporated was founded in 1958 and is headquartered in Burnaby, Canada."}, {"name": "Resolute Forest Products Inc.", "ticker": "RFP.TO", "sector": "Basic Materials", "description": "Resolute Forest Products Inc., together with its subsidiaries, operates in the forest products industry in the United States, Canada, Mexico, and internationally. The company operates through four segments: Market Pulp, Tissue, Wood Products, and Paper. The Market Pulp segment offers virgin and recycled bleached Kraft pulp, which is used to make a range of consumer products, including tissue, packaging, specialty paper products, diapers, and other absorbent products. The Tissue segment provides various tissue products, such as recycled and virgin paper products for the away-from-home and retail markets; and sells parent rolls. The Wood Products segment produces construction-grade and spruce-pine-fir lumber products, wood chips, bed frame components, finger joints, and furring strips for pulp and paper mills, as well as I-joists for the construction industry. The Paper segment offers newsprint to newspaper publishers, as well as to commercial printers for uses comprising inserts and flyers. This segment also provides various uncoated mechanical papers, including supercalendered and white papers, as well as uncoated freesheet papers. Its specialty papers are used in books, retail inserts, direct mail, coupons, magazines, catalogs, bags, and other commercial printing applications. This segment sells specialty papers to commercial printers, direct mailers, publishers, catalogers, and retailers. The company also produces electricity at cogeneration facilities and hydroelectric dams. Resolute Forest Products Inc. is headquartered in Montreal, Canada."}, {"name": "RTG Mining Inc.", "ticker": "RTG.TO", "sector": "Basic Materials", "description": "RTG Mining Inc. explores for and develops mineral properties. The company explores for copper and gold deposits. Its principal property is the Mabilo project located in the Philippines. The company has other explorations projects comprising Chanach, Bunawan, Nalesbitan, Pacific Cordillera, Bhayan, Mawab, and Taguibo, as well as copper-gold Panguna Project located in Region of Bougainville. The company was incorporated in 2012 and is headquartered in Subiaco, Australia."}, {"name": "Royal Bank of Canada", "ticker": "RY.TO", "sector": "Financial Services", "description": "Royal Bank of Canada operates as a diversified financial service company worldwide. The company's Personal & Commercial Banking segment offers checking and savings accounts, home equity financing, personal lending, private banking, indirect lending, including auto financing, mutual funds and self-directed brokerage accounts, guaranteed investment certificates, credit cards, and payment products and solutions; and lending, leasing, deposit, investment, foreign exchange, cash management, auto dealer financing, trade products, and services to small and medium-sized commercial businesses. This segment offers financial products and services through branches, automated teller machines, and mobile sales network. Its Wealth Management segment provides a suite of advice-based solutions and strategies to high net worth and ultra-high net worth individuals, and institutional clients. The company's Insurance segment offers life, health, home, auto, travel, wealth, annuities, and reinsurance advice and solutions; and business insurance services to individual, business, and group clients through its advice centers, RBC insurance stores, and mobile advisors; digital, mobile, and social platforms; independent brokers; and travel partners. Its Investor & Treasury Services segment provides asset servicing, custody, payments, and treasury services to financial and other investors; and fund and investment administration, shareholder, private capital, performance measurement and compliance monitoring, distribution, transaction banking, cash and liquidity management, foreign exchange, and global securities finance services. The company's Capital Markets segment offers corporate and investment banking, as well as equity and debt origination, distribution, advisory services, sale, and trading services for corporations, institutional investors, asset managers, private equity firms, and governments. The company was founded in 1864 and is headquartered in Toronto, Canada."}, {"name": "Serabi Gold plc", "ticker": "SBI.TO", "sector": "Basic Materials", "description": "Serabi Gold plc engages in the evaluation, exploration, and development of gold projects in Brazil. The company also explores for copper deposits. Its flagship property is the Palito mining complex covering an area of approximately 48,846 hectares located in the Tapajos region of northern Brazil. The company also holds interest in the Coringa gold project located in the Tapajos region. The company was formerly known as Serabi Mining Limited and changed its name to Serabi Gold plc in October 2011. Serabi Gold plc was founded in 1999 and is headquartered in London, the United Kingdom."}, {"name": "Seabridge Gold Inc.", "ticker": "SEA.TO", "sector": "Basic Materials", "description": "Seabridge Gold Inc., together with its subsidiaries, engages in the acquisition and exploration of gold properties in North America. The company also explores for copper, silver, molybdenum, and rhenium deposits. Its principal projects are the Kerr-Sulphurets-Mitchell property and Iskut project located in British Columbia, Canada; Courageous Lake property situated in Northwest Territories, Canada; Snowstorm project located in the Nevada; and 3 Aces project located in the Yukon Territory. The company was formerly known as Seabridge Resources Inc. and changed its name to Seabridge Gold Inc. in June 2002. Seabridge Gold Inc. was incorporated in 1979 and is headquartered in Toronto, Canada."}, {"name": "SouthGobi Resources Ltd.", "ticker": "SGQ.TO", "sector": "Energy", "description": "SouthGobi Resources Ltd., together with its subsidiaries, operates as an integrated coal mining, development, and exploration company in Mongolia, Hong Kong, and China. It primarily explores for coking and thermal coal. The company's flagship project is the Ovoot Tolgoi open pit coal mine located in the Umnugobi Aimag of Mongolia. It also engages in the logistics and trading of coal in Mongolia and China. The company was formerly known as SouthGobi Energy Resources Ltd. and changed its name to SouthGobi Resources Ltd. in May 2010. SouthGobi Resources Ltd. was incorporated in 2002 and is based in Mong kok, Hong Kong."}, {"name": "Shopify Inc.", "ticker": "SHOP.TO", "sector": "Technology", "description": "Shopify Inc., a commerce company, provides a commerce platform and services in Canada, the United States, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. The company's platform enables merchants to displays, manages, markets, and sells its products through various sales channels, including web and mobile storefronts, physical retail locations, pop-up shops, social media storefronts, native mobile apps, buy buttons, and marketplaces; and enables to manage products and inventory, process orders and payments, fulfill and ship orders, new buyers and build customer relationships, source products, leverage analytics and reporting, manage cash, payments and transactions, and access financing. It also sells custom themes and apps, and registration of domain names; and merchant solutions, which include accepting payments, shipping and fulfillment, and securing working capital. The company was formerly known as Jaded Pixel Technologies Inc. and changed its name to Shopify Inc. in November 2011. Shopify Inc. was incorporated in 2004 and is headquartered in Ottawa, Canada."}, {"name": "Sprott Inc.", "ticker": "SII.TO", "sector": "Financial Services", "description": "Sprott Inc. is a publicly owned asset management holding company. Through its subsidiaries, the firm provides asset management, portfolio management, wealth management, fund management, and administrative and consulting services to its clients. It offers mutual funds, hedge funds, and offshore funds, along with managed accounts. Further, the firm also provides broker-dealer activities. Sprott Inc. was formed on February 13, 2008 and is based in Toronto, Canada."}, {"name": "SilverCrest Metals Inc.", "ticker": "SIL.TO", "sector": "Basic Materials", "description": "SilverCrest Metals Inc. explores for and develops precious metal properties in Mexico. The company primarily explores for silver and gold properties. Its principal property includes the Las Chispas project that consists of 28 concessions totaling of approximately 1,401 hectares located in Sonora, Mexico. The company was incorporated in 2015 and is headquartered in Vancouver, Canada."}, {"name": "Skeena Resources Limited", "ticker": "SKE.TO", "sector": "Basic Materials", "description": "Skeena Resources Limited explores and develops mineral properties in Canada. The company explores for gold, silver, copper, and other precious metal deposits. It holds 100% interests in the Snip gold mine comprising one mining lease and four mineral tenures that covers an area of approximately 1,932 hectares; and the Eskay Creek gold mine that consists of eight mineral leases, two surface leases, and various unpatented mining claims, which total 6,151 hectares located in British Columbia, Canada. The company was formerly known as Prolific Resources Ltd. and changed its name to Skeena Resources Limited in June 1990. Skeena Resources Limited was incorporated in 1979 and is headquartered in Vancouver, Canada."}, {"name": "Sun Life Financial Inc.", "ticker": "SLF.TO", "sector": "Financial Services", "description": "Sun Life Financial Inc., a financial services company, provides insurance, wealth, and asset management solutions to individuals and corporate clients worldwide. It offers term and permanent life, as well as personal health, dental, critical illness, long-term care, and disability insurance products. The company also provides reinsurance products; investment counselling and portfolio management services; mutual funds and segregated funds; trust and banking services; real estate property brokerage and appraisal services; and merchant banking services. It distributes its products through direct sales agents, managing and independent general agents, financial intermediaries, broker-dealers, banks, pension and benefits consultants, and other third-party marketing organizations. The company was founded in 1871 and is headquartered in Toronto, Canada."}, {"name": "Solitario Zinc Corp.", "ticker": "SLR.TO", "sector": "Basic Materials", "description": "Solitario Zinc Corp., an exploration stage company, engages in the acquisition and exploration of zinc and other base metal properties in North and South America. The company holds a 50% operating interest in the Lik zinc-lead-silver property located in Northwest Alaska; 39% interest in the Florida Canyon zinc project located in northern Peru; and 85% interest in the Chambara exploration project located in Peru. It also holds interest in the Golden Crest project located in western South Dakota, Lawrence County. The company was formerly known as Solitario Exploration & Royalty Corp. and changed its name to Solitario Zinc Corp. in July 2017. Solitario Zinc Corp. was incorporated in 1984 and is based in Wheat Ridge, Colorado."}, {"name": "Sierra Metals Inc.", "ticker": "SMT.TO", "sector": "Basic Materials", "description": "Sierra Metals Inc., together with its subsidiaries, focuses on the production, exploration, and development of precious and base metals in Peru and Mexico. It primarily focuses on exploration of silver, copper, lead, zinc, and gold deposits. The company's flagship property is the 81.84% owned polymetallic Yauricocha Mine covering an area of 18,778 hectares located in the Yauyos province in Peru. It also holds 100% interest in the Bolivar mine, comprising of 12 mining concessions covering an area 15,217 hectares; and Cusi Mines that comprises of 73 concessions covering 11,977 hectares in Mexico. The company was formerly known as Dia Bras Exploration Inc. and changed its name to Sierra Metals Inc. in December 2012. Sierra Metals Inc. was incorporated in 1996 and is headquartered in Toronto, Canada."}, {"name": "SolGold plc", "ticker": "SOLG.TO", "sector": "Basic Materials", "description": "SolGold Plc, a mineral exploration and development company, explores for and develops mineral properties in Ecuador, Australia, and Solomon Islands. The company primarily explores for copper, gold, silver, and molybdenum deposits. Its flagship project is the Alpala project that covers an area of approximately 50 square kilometers located in Imbabura province, Northern Ecuador. The company was formerly known as Solomon Gold plc and changed its name to SolGold plc in May 2012. SolGold Plc was incorporated in 2005 and is headquartered in Brisbane, Australia."}, {"name": "SunOpta Inc.", "ticker": "SOY.TO", "sector": "Consumer Defensive", "description": "SunOpta Inc. manufactures and sells plant-based and fruit-based food and beverage products to retail customers, foodservice distributors, branded food companies, and food manufacturers worldwide. The company operates through two segments, Plant-Based Foods and Beverages, and Fruit-Based Foods and Beverages. The Plant-Based Foods and Beverages segment provides plant-based beverages, and liquid and dry ingredients that utilizes almond, soy, coconut, oat, hemp, and other bases, as well as broths, teas, and nutritional beverages. This segment also packages dry- and oil-roasted in-shell sunflower and sunflower kernels; and processes and sells raw sunflower inshell and kernel for food and feed applications. The Fruit-Based Foods and Beverages segment offers individually quick frozen (IQF) fruits, such as strawberries, blueberries, mangos, pineapples, blends, and other berries for retail; and IQF and bulk frozen fruits, including purées, toppings, and smoothies for foodservice, and custom fruit preparations for industrial use. This segment also provides fruit snacks comprising bars, twists, ropes, and bite-sized products. The company was formerly known as Stake Technology Ltd. and changed its name to SunOpta Inc. in October 2003. SunOpta Inc. was founded in 1973 and is headquartered in Eden Prairie, Minnesota."}, {"name": "Sprott Physical Platinum and Palladium Trust", "ticker": "SPPP.TO", "sector": "Basic Materials", "description": "Sprott Physical Platinum and Palladium Trust is an exchange traded commodity launched and managed by Sprott Asset Management, LP. The fund invests in commodity markets. It invests in physical platinum and palladium bullion in Good Delivery plate or ingot form. Sprott Physical Platinum and Palladium Trust was formed on December 23, 2011 and is domiciled in Canada."}, {"name": "Sandstorm Gold Ltd.", "ticker": "SSL.TO", "sector": "Basic Materials", "description": "Sandstorm Gold Ltd. operates as a gold royalty company. The company focuses on acquiring royalties and gold and other metals purchase agreements (streams) from companies that have advanced stage development projects or operating mines. It offers upfront payments for companies to acquire a stream or royalty and receives the right to purchase a percentage of a mine's production for the life of the mine at a fixed price per unit or at a fixed percentage of the spot price. The company has a portfolio of 230 streams and royalties. It primarily has operations in Canada, Mexico, the United States, Mongolia, Burkina Faso, Ecuador, South Africa, Ghana, Botswana, Cote D'Ivoire, Argentina, Brazil, Chile, Peru, Egypt, Ethiopia, Guyana, Paraguay, French Guiana, Turkey, Sweden, Fiji, and Australia. The company was formerly known as Sandstorm Resources Ltd. and changed its name to Sandstorm Gold Ltd. in February 2011. Sandstorm Gold Ltd. was incorporated in 2007 and is headquartered in Vancouver, Canada."}, {"name": "SSR Mining Inc.", "ticker": "SSRM.TO", "sector": "Basic Materials", "description": "SSR Mining Inc., together with its subsidiaries, engages in the acquisition, exploration, development, and operation of precious metal resource properties in Turkey and the Americas. The company explores for gold, silver, copper, lead, and zinc deposits. Its projects include the Çöpler Gold mine located in Erzincan, Turkey; the Marigold mine located in Humboldt County, Nevada, the United States; the Seabee Gold Operation located in Saskatchewan, Canada; and the Puna Operations in Jujuy, Argentina. The company was formerly known as Silver Standard Resources Inc. and changed its name to SSR Mining Inc. in August 2017. SSR Mining Inc. was incorporated in 1946 and is based in Denver, Colorado."}, {"name": "Sangoma Technologies Corporation ", "ticker": "STC.TO", "sector": "Technology", "description": "Sangoma Technologies Corporation develops, manufactures, distributes, and supports voice and data connectivity components for software-based communication applications worldwide. The company offers Switchvox, a business phone system; PBXact, a phone system; Internet protocol (IP) phones; service provider and voice over Internet protocol gateways; Switchvox Cloud, a unified communications solution; SIPstation SIP Trunking, a hosted session initiation protocol trunking service; PBXact Cloud, a cloud based private branch exchange service; Asterisk and FreePBX, an open source IP PBX software; and FAXStation, a fax-over-IP solution. It also provides session border controllers; telephony and media transcoding cards; and open source communications software. The company serves small and medium sized businesses, enterprises, original equipment manufacturers, carriers, and service providers. Sangoma Technologies Corporation was founded in 1984 and is headquartered in Markham, Canada."}, {"name": "Stantec Inc.", "ticker": "STN.TO", "sector": "Industrials", "description": "Stantec Inc. provides engineering, architecture, and environmental consulting services in the areas of infrastructure and facilities in Canada, the United States, and internationally. The company provides consulting services in engineering, architecture, interior design, landscape architecture, surveying, environmental sciences, project management, and project economics. It also offers structural, mechanical, electrical, plumbing, and hydraulics engineering services; transportation advisory, planning and analytics, transport engineering, and technical design; paleontological and archaeological services for the rail, transportation, water, and power and energy sectors; environmental and infrastructure services; and environmental and cultural resource compliance services. The company was formerly known as Stanley Technology Group Inc. and changed its name to Stantec Inc. in October 1998. Stantec Inc. was founded in 1954 and is headquartered in Edmonton, Canada."}, {"name": "Suncor Energy Inc.", "ticker": "SU.TO", "sector": "Energy", "description": "Suncor Energy Inc. operates as an integrated energy company. The company primarily focuses on developing petroleum resource basins in Canada's Athabasca oil sands; explores, acquires, develops, produces, transports, refines, and markets crude oil in Canada and internationally; markets petroleum and petrochemical products under the Petro-Canada name primarily in Canada. It operates through Oil Sands; Exploration and Production; Refining and Marketing; and Corporate and Eliminations segments. The Oil Sands segment recovers bitumen from mining and in situ operations, and upgrades it into refinery feedstock and diesel fuel, or blends the bitumen with diluent for direct sale to market. The Exploration and Production segment is involved in offshore operations off the east coast of Canada and in the North Sea; and operating onshore assets in Libya and Syria. The Refining and Marketing segment refines crude oil and intermediate feedstock into various petroleum and petrochemical products; and markets refined petroleum products to retail, commercial, and industrial customers through its other retail sellers. The Corporate and Eliminations segment operates four wind farms in Ontario and Western Canada. The company also markets and trades in crude oil, natural gas, byproducts, refined products, and power. The company was formerly known as Suncor Inc. and changed its name to Suncor Energy Inc. in April 1997. Suncor Energy Inc. was founded in 1917 and is headquartered in Calgary, Canada."}, {"name": "Silvercorp Metals Inc.", "ticker": "SVM.TO", "sector": "Basic Materials", "description": "Silvercorp Metals Inc., together with its subsidiaries, engages in the acquisition, exploration, development, and mining of mineral properties in China and Mexico. The company primarily explores for silver, gold, lead, and zinc metals. Its flagship property is the Ying silver-lead- zinc project located in the Ying Mining District in Henan Province, China. The company was formerly known as SKN Resources Ltd. and changed its name to Silvercorp Metals Inc. in May 2005. Silvercorp Metals Inc. is headquartered in Vancouver, Canada."}, {"name": "Sierra Wireless Inc.", "ticker": "SW.TO", "sector": "Technology", "description": "Sierra Wireless, Inc., together with its subsidiaries, provides device-to-cloud Internet of Things (IoT) solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It operates in two segments, IoT Solutions and Enterprise Solutions. The IoT Solutions segment offers cellular wireless IoT modules that provides original equipment manufacturers (OEMs) with 5G, 4G LTE, third generation/second generation, low power wide area, Wi-Fi, Bluetooth, and global navigation satellite system connectivity; embedded broadband solutions, including industrial-grade modules, which offers speed, bandwidth, and network performance for connecting to 5G and 4G networks; and IoT connectivity services. The Enterprise Solutions segment provides a range of Sierra Wireless AirLink routers, IoT applications and advanced network management, managed network services, and mobility applications. This segment also offers asset, fleet, and cargo tracking services; offender and remote monitoring services; and alarm communications, as well as a cloud platform that comprises reporting and analytics. The company serves enterprises, industrial companies, and OEMs through direct and indirect channels, such as OEMs, distributors, value-added resellers, and mobile network operators. The company was incorporated in 1993 and is headquartered in Richmond, Canada."}, {"name": "TELUS Corporation", "ticker": "T.TO", "sector": "Communication Services", "description": "TELUS Corporation, together with its subsidiaries, provides a range of telecommunications and information technology products and services in Canada. It operates through Technology Solutions and Digitally-Led Customer Experiences segments. The Technology Solutions segment offers a range of telecommunications products and services; network revenue; equipment sales from mobile technologies; data services revenues, such as internet protocol; television; hosting, managed information technology, and cloud-based services; customer care and business services; healthcare solutions; and home and business security, agriculture, voice, and other telecommunications services. The Digitally-Led Customer Experiences segment provides digital customer experience and digital-enablement transformation solutions, including artificial intelligence and content management solutions. It has 16.9 million subscriber connections, which include 9.3 million mobile phone subscribers; 2.1 million connected device subscribers; 2.3 million internet subscribers; 1.1 million residential voice subscribers; 1.3 million TV subscribers; and 804,000 security subscribers. The company was formerly known as TELUS Communications Inc. and changed its name to TELUS Corporation in February 2005. TELUS Corporation was incorporated in 1998 and is headquartered in Vancouver, Canada."}, {"name": "TransAlta Corporation", "ticker": "TA.TO", "sector": "Utilities", "description": "TransAlta Corporation owns, operates, and develops a diverse fleet of electrical power generation assets in Canada, the United States, and Australia. It operates through four segments: Hydro, Wind and Solar, Gas, and Energy Transition. owns and operates hydro, wind and solar, natural gas-fired, and coal-fired facilities. The company also engages in wholesale trading of electricity and other energy-related commodities and derivatives; and related mining operations and natural gas pipeline operations. It serves municipalities, medium and large industries, businesses, and utility customers. The company was founded in 1909 and is headquartered in Calgary, Canada."}, {"name": "Tucows Inc.", "ticker": "TC.TO", "sector": "Technology", "description": "Tucows Inc. provides network access, domain name registration, email, mobile telephony, and other Internet services in Canada, the United States, and Europe. It operates through three segments: Fiber Internet Services, Mobile Services, and Domain Services. The Fiber Internet Services segment provides fixed high-speed Internet access services to individuals and small businesses primarily through the Ting website, and other billing solutions to small internet service providers. The Mobile Services segment offers mobile phones and retail telephony services; and professional services, including implementation, training, consulting, and software development and modification services, as well as operates Mobile Services Enabler platform that provides network access, provisioning, and billing services. The Domain Services segment provides wholesale and retail domain name registration services; portfolio services; and value-added services, such as hosted email, Internet security services, Internet hosting, WHOIS privacy, publishing tools, and other value-added services for end-users under the OpenSRS, eNom, Ascio, and Hover brands. The company was formerly known as Infonautics, Inc. and changed its name to Tucows Inc. in August 2001. Tucows Inc. was incorporated in 1992 and is headquartered in Toronto, Canada."}, {"name": "Tricon Residential Inc.", "ticker": "TCN.TO", "sector": "Real Estate", "description": "Founded in 1988, Tricon is a rental housing company focused on serving the middle-market demographic. Tricon owns and operates approximately 31,000 single-family rental homes and multi-family rental units in 21 markets across the United States and Canada, managed with an integrated technology-enabled operating platform. More information about Tricon is available at www.triconresidential.com."}, {"name": "Toronto-Dominion Bank (The)", "ticker": "TD.TO", "sector": "Financial Services", "description": "The Toronto-Dominion Bank, together with its subsidiaries, provides various financial products and services in Canada, the United States, and internationally. It operates through three segments: Canadian Retail, U.S. Retail, and Wholesale Banking. The company offers personal deposits, such as chequing, savings, and investment products; financing, investment, cash management, international trade, and day-to-day banking services to businesses; and financing options to customers at point of sale for automotive and recreational vehicle purchases. It also provides credit cards and payments; real estate secured lending, auto finance, and consumer lending services; point-of-sale payment solutions for large and small businesses; wealth and asset management products, and advice to retail and institutional clients through direct investing, advice-based, and asset management businesses; and property and casualty insurance, as well as life and health insurance products. The company also provides capital markets, and corporate and investment banking products and services, including underwriting and distribution of new debt and equity issues; advice on strategic acquisitions and divestitures; and trading, funding, and investment services to corporations, governments, and institutions. It offers its products and services under the TD Bank and America's Most Convenient Bank brand names. The company operates through a network of 1,061 branches and 3,381 automated teller machines (ATMs) in Canada, and 1,148 stores and 2,701 ATMs in the United States, as well as offers telephone, digital, and mobile banking services. It has a strategic alliance with Canada Post Corporation. The Toronto-Dominion Bank was founded in 1855 and is headquartered in Toronto, Canada."}, {"name": "TFI International Inc.", "ticker": "TFII.TO", "sector": "Industrials", "description": "TFI International Inc. provides transportation and logistics services in the United States, Canada, and Mexico. The company operates through Package and Courier, Less-Than-Truckload (LTL), Truckload (TL), and Logistics segments. The Package and Courier segment engages in the pickup, transport, and delivery of items. The LTL segment is involved in the pickup, consolidation, transportation, and delivery of smaller loads. The TL segment offers expedited transportation, flatbed, tank container, and dedicated services, as well as TL brokerage services. This segment carries full loads directly from the customer to the destination using a closed van or specialized equipment. The Logistics segment provides asset-light logistics services, including brokerage, freight forwarding, and transportation management, as well as small package parcel delivery. As of December 31, 2021, the company had 13,384 tractors, 50,091 trailers, and 9,428 independent contractors. The company was formerly known as TransForce Inc. and changed its name to TFI International Inc. in December 2016. TFI International Inc. is headquartered in Saint-Laurent, Canada."}, {"name": "TransGlobe Energy Corporation", "ticker": "TGL.TO", "sector": "Energy", "description": "TransGlobe Energy Corporation, together with its subsidiaries, engages in the acquisition, exploration, development, and production of crude oil and natural gas in Egypt and Canada. The company holds interests in four production sharing concessions, which include West Gharib, West Bakr, NW Gharib, and South Ghazalat, Egypt; and owns production and working interests in facilities in the Cardium light oil and Mannville liquid-rich gas assets in the Harmattan area of west central Alberta, Canada. TransGlobe Energy Corporation was incorporated in 1968 and is headquartered in Calgary, Canada."}, {"name": "Theratechnologies Inc.", "ticker": "TH.TO", "sector": "Healthcare", "description": "Theratechnologies Inc., a biopharmaceutical company, focuses on the development and commercialization of various therapies to address the unmet medical needs in the United States, Canada, and Europe. The company offers EGRIFTA and EGRIFTA SV, for the reduction of excess abdominal fat in human immunodeficiency virus (HIV)-infected patients with lipodystrophy; and Trogarzo, an injection refers to ibalizumab for the treatment of multidrug resistant HIV-1 infected patients. Its pipeline products include F8 Formulation for the treatment of lipodystrophy in people living with HIV; TH1902, which is in Phase 1/Part A clinical trials for the treatment of triple negative breast cancer; and TH1904 for the treatment of ovarian cancer. The company was incorporated in 1993 and is headquartered in Montreal, Canada."}, {"name": "TELUS International (Cda) Inc.", "ticker": "TIXT.TO", "sector": "Technology", "description": "TELUS International (Cda) Inc. provides customer experience and digital business services in Europe, North America, the Asia-Pacific, and the Central America. It offers digital experience solutions, such as AI and bots, omnichannel CX, mobility solutions, cloud contact center, big data, platform transformation, and UX/UI design; and customer experience solutions, including work anywhere/work from home, customer care, technical support, sales growth and retention, and healthcare/patient experience. The company also provides IT lifecycle services comprising cloud and platform services, app dev and management, quality assurance and testing, system operations, IT service desk, internet of things, engineering solutions, and enterprise platform services; advisory services consisting of digital strategy, CX process consulting, data and customer analytics, workforce management, learning excellence solutions, and business and process transformation; robotic process automation, talent acquisition, finance and accounting, and supply chain management; and content moderation and social media, and fraud prevention and detection. It serves tech and games, communications and media, ecommerce and fintech, healthcare, and travel and hospitality industries. The company was founded in 2005 and is headquartered in Vancouver, Canada. TELUS International (Cda) Inc. is a subsidiary of TELUS Communications Inc."}, {"name": "Taseko Mines Limited", "ticker": "TKO.TO", "sector": "Basic Materials", "description": "Taseko Mines Limited, a mining company, acquires, develops, and operates mineral properties. The company explores for copper, molybdenum, gold, niobium, and silver deposits. It holds 75% interest in the Gibraltar mine located in British Columbia. It also holds 100% interest in Yellowhead copper project, the Aley niobium project, and the New Prosperity gold and copper project located in British Columbia; and the Florence copper project located in Arizona. The company was incorporated in 1966 and is headquartered in Vancouver, Canada."}, {"name": "Tilray", "ticker": "TLRY.TO", "sector": "Healthcare", "description": "Tilray Brands Inc. engages in the research, cultivation, production, marketing, and distribution of medical cannabis products. It operates through five segments: Cannabis Business, Distribution Business, Beverage Alcohol Business, Wellness Business, and Business Under Development. The company provides medical and adult-use cannabis products; pharmaceutical and wellness products; beverage alcohol products; and hemp-based food and other wellness products. It offers its products to retailers, wholesalers, patients, physicians, pharmacies, clinics, hospitals, governments, and researchers. The company operates Tilray Medical, a medical platform that provides GMP-certified flowers, oils, vapes, edibles, and topicals. It has operations in Canada, the United States, Europe, Australia, New Zealand, Latin America, and internationally. The company was formerly known as Tilray, Inc. Tilray Brands Inc. was incorporated in 2018 and is headquartered in New York, New York."}, {"name": "Titan Medical Inc.", "ticker": "TMD.TO", "sector": "Healthcare", "description": "Titan Medical Inc., a medical technology company, focuses on the development and commercialization of robotic assisted surgical technologies for application in minimally invasive surgery. It is developing the Enos system, a robotic single access surgical system that includes a surgeon-controlled patient cart comprising a 3D high-definition vision system and multi-articulating instruments for performing surgical procedures; and a surgeon workstation that provides the surgeon with ergonomic interface to the patient cart and a 3D endoscopic view inside the patient's body during surgical procedures. The company is headquartered in Toronto, Canada."}, {"name": "Trilogy Metals Inc.", "ticker": "TMQ.TO", "sector": "Basic Materials", "description": "Trilogy Metals Inc., a base metals exploration company, explores for and develops mineral properties in the United States. It principally holds interests in the Upper Kobuk mineral projects that include the Arctic, which contains polymetallic volcanogenic massive sulfide deposits; and Bornite that contains carbonate-hosted copper - cobalt deposits covering an area of approximately 426,690 acres located in the Ambler mining district in Northwest Alaska. The company was formerly known as NovaCopper Inc. and changed its name to Trilogy Metals Inc. in September 2016. Trilogy Metals Inc. was founded in 2004 and is headquartered in Vancouver, Canada."}, {"name": "Tanzanian Gold Corporation", "ticker": "TNX.TO", "sector": "Basic Materials", "description": "Tanzanian Gold Corporation engages in the acquisition, financing, exploration and development of mineral property interests in the United Republic of Tanzania. The company primarily explores for gold deposits. It holds interests in the Buckreef gold project located in north-central Tanzania. The company was formerly known as Tanzanian Royalty Exploration Corporation and changed its name to Tanzanian Gold Corporation in April 2019. Tanzanian Gold Corporation was incorporated in 1990 and is based in Toronto, Canada."}, {"name": "Thomson Reuters Corporation", "ticker": "TRI.TO", "sector": "Industrials", "description": "Thomson Reuters Corporation provides business information services in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It operates in five segments: Legal Professionals, Corporates, Tax & Accounting Professionals, Reuters News, and Global Print. The Legal Professionals segment offers research and workflow products focusing on legal research and integrated legal workflow solutions that combine content, tools, and analytics to law firms and governments. The Corporates segment provides a suite of content-enabled technology solutions for legal, tax, regulatory, compliance, and IT professionals. The Tax & Accounting Professionals segment offers research and workflow products focusing on tax offerings and automating tax workflows to tax, accounting, and audit professionals in accounting firms. The Reuters News segment provides business, financial, and international news to media organizations, professional, and news consumers through news agency and industry events. The Global Print segment offers legal and tax information primarily in print format to legal and tax professionals, governments, law schools, and corporations. The company was formerly known as The Thomson Corporation and changed its name to Thomson Reuters Corporation in April 2008. The company was founded in 1851 and is headquartered in Toronto, Canada. Thomson Reuters Corporation is a subsidiary of The Woodbridge Company Limited."}, {"name": "TC Energy Corporation", "ticker": "TRP.TO", "sector": "Energy", "description": "TC Energy Corporation operates as an energy infrastructure company in North America. It operates through five segments: Canadian Natural Gas Pipelines; U.S. Natural Gas Pipelines; Mexico Natural Gas Pipelines; Liquids Pipelines; and Power and Storage. The company builds and operates 93,300 km network of natural gas pipelines, which transports natural gas from supply basins to local distribution companies, power generation plants, industrial facilities, interconnecting pipelines, LNG export terminals, and other businesses. It also has regulated natural gas storage facilities with a total working gas capacity of 535 billion cubic feet. In addition, it has approximately 4,900 km liquids pipeline system that connects Alberta crude oil supplies to refining markets in Illinois, Oklahoma, Texas, and the U.S. Gulf Coast. Further, the company owns or has interests in seven power generation facilities with a combined capacity of approximately 4,300 megawatts that are powered by natural gas and nuclear fuel sources located in Alberta, Ontario, Québec, and New Brunswick; and owns and operates approximately 118 billion cubic feet of non-regulated natural gas storage capacity in Alberta. The company was formerly known as TransCanada Corporation and changed its name to TC Energy Corporation in May 2019. TC Energy Corporation was incorporated in 1951 and is headquartered in Calgary, Canada."}, {"name": "Turquoise Hill Resources Ltd.", "ticker": "TRQ.TO", "sector": "Basic Materials", "description": "Turquoise Hill Resources Ltd., together with its subsidiaries, operates as a mining company. The company primarily explores for copper, gold, and silver deposits. It engages in the operation and development of the Oyu Tolgoi copper-gold mine located in Southern Mongolia. The company was formerly known as Ivanhoe Mines Ltd. and changed its name to Turquoise Hill Resources Ltd. in August 2012. Turquoise Hill Resources Ltd. was incorporated in 1994 and is headquartered in Montreal, Canada."}, {"name": "Telesat Corporation", "ticker": "TSAT.TO", "sector": "Technology", "description": "Telesat Corporation, a satellite operator, provides mission-critical communications services to broadcast, enterprise, and consulting customers worldwide. The company's satellite-based services allow direct-to-home (DTH) service providers to deliver television programming, audio, and information channels directly to customers' homes; and enables broadcasters, cable networks, and DTH service providers to transmit television programming services. It offers value-added services, such as satellite capacity, digital encoding of video channels, authorization, and uplinking and downlinking services; and occasional use services for the broadcast of video news, sports, and live event coverages. The company also provides satellite capacity and end-to-end services, including space segment services and terrestrial facilities for enterprise connectivity, and internet and cellular backhaul; and rural telephony to telecommunications carriers and network services integrators. In addition, it offers broadband communication services to maritime and aeronautical markets comprising commercial airplanes and vessels; services to the U.S. government through government service integrators, and satellite services to the Canadian government; and direct-to-consumer broadband services. Further, the company operates satellite and hybrid satellite/terrestrial networks; and communications services for the oil and gas and mining industries. Additionally, it provides satellite operator services; and consulting services related to space and earth segments, government studies, satellite control, and research and development services. The company offers its services primarily through a direct sales force. As of December 31, 2021, it operated a fleet of 14 in-orbit geostationary satellites and a Canadian payload on the ViaSat-1 satellite. The company was founded in 1969 and is headquartered in Ottawa, Canada."}, {"name": "Trevali Mining Corporation", "ticker": "TV.TO", "sector": "Basic Materials", "description": "Trevali Mining Corporation, a base-metals mining company, engages in the acquisition, exploration, development of, and production from mineral properties. It primarily explores for zinc, lead, silver, copper, and gold deposits. The company's operational assets include the 90%-owned Perkoa Mine in Burkina Faso; 90%-owned Rosh Pinah Mine in Namibia; and Caribou Mine in northern New Brunswick, Canada. It also holds interests in the Halfmile, Stratmat, and Restigouche properties situated in New Brunswick, Canada; Gergarub project in Namibia; and Ruttan Mine located in northern Manitoba, Canada. In addition, the company has an option to acquire a 100% interest in the Heath Steele deposit located in New Brunswick, Canada. Trevali Mining Corporation was formerly known as Trevali Resources Corp. and changed its name to Trevali Mining Corporation in April 2011. The company was incorporated in 1964 and is headquartered in Vancouver, Canada."}, {"name": "Touchstone Exploration Inc.", "ticker": "TXP.TO", "sector": "Energy", "description": "Touchstone Exploration Inc., an upstream oil and gas company, engages in the exploration, development, production, and sale of petroleum and natural gas properties in the Republic of Trinidad and Tobago. The company has interests in various private exploration mineral leasing properties; and two exploration blocks. Its primary exploration focus is the Ortoire exploration block. The company was formerly known as Petrobank Energy and Resources Ltd. and changed its name to Touchstone Exploration Inc. in May 2014. Touchstone Exploration Inc. was incorporated in 2012 and is headquartered in Calgary, Canada."}, {"name": "Ur-Energy Inc.", "ticker": "URE.TO", "sector": "Energy", "description": "Ur-Energy Inc. engages in the acquisition, exploration, development, and operation of uranium mineral properties. The company holds interests in 12 projects located in the United States. Its flagship property is the Lost Creek project comprising a total of approximately 1,800 unpatented mining claims and three Wyoming mineral leases covering an area of approximately 48,000 acres located in the Great Divide Basin, Wyoming. The company was incorporated in 2004 and is headquartered in Littleton, Colorado."}, {"name": "Americas Gold and Silver Corporation", "ticker": "USA.TO", "sector": "Basic Materials", "description": "Americas Gold and Silver Corporation, together with its subsidiaries, engages in the acquisition, exploration, development, and operation of mineral properties in North America. It explores for silver, lead, zinc, copper, and gold deposits. The company holds 100% interests in the Cosalá Operations consisting of 67 mining concessions that covers approximately 19,385 hectares located in the state of Sinaloa, Mexico; and the San Felipe development project in Sonora, Mexico. It also owns a 60% interest in the Galena Complex located in the northern Idaho Silver Valley, Idaho; and a 100% interest in the Relief Canyon mine located in the Pershing County, Nevada, the United States. The company was formerly known as Americas Silver Corporation and changed its name to Americas Gold and Silver Corporation in September 2019. Americas Gold and Silver Corporation was incorporated in 1998 and is headquartered in Toronto, Canada."}, {"name": "VersaBank", "ticker": "VBNK.TO", "sector": "Financial Services", "description": "VersaBank, a schedule I chartered bank, provides various banking products and services in Canada. The company offers deposit products, such as guaranteed investment certificates, registered retirement savings plans, daily interest savings accounts, and tax-free savings accounts, as well as deposit insurance products. It also provides lending services, including point of sale financing that involves purchasing loan and lease receivables from finance companies operating in various industries; and commercial banking services comprising commercial real estate, public sector/infrastructure financing, condominium financing, and residential mortgages. The company was formerly known as Pacific & Western Bank of Canada and changed its name to VersaBank in May 2016. VersaBank was incorporated in 1979 and is headquartered in London, Canada."}, {"name": "Vermilion Energy Inc.", "ticker": "VET.TO", "sector": "Energy", "description": "Vermilion Energy Inc., together with its subsidiaries, engages in the acquisition, exploration, development, and production of petroleum and natural gas in North America, Europe, and Australia. It owns 81% working interest in 636,714 net acres of developed land and 85% working interest in 301,026 net acres of undeveloped land; 130,715 net acres of land in the Powder River basin in the United States; 96% working interest in 248,873 net acres of developed land and 86% working interest in 134,160 net acres of undeveloped land in the Aquitaine and Paris Basins in France; 53% working interest in 901,791 net acres of land in the Netherlands; 54,625 net developed acres and 920,723 net undeveloped acres in Germany; 975,375 net acres land in Croatia; 946,666 net acres land in Hungary; and 48,954 net acres land in Slovakia. As of December 31, 2021, the company had 401 net producing conventional natural gas wells and 2,132 net producing light and medium crude oil wells in Canada; 167.6 net producing light and medium crude oil wells in the United States; 297.0 net producing light and medium crude oil wells and 3 net producing conventional natural gas wells in France; and 47 net producing natural gas wells in the Netherlands. It also owns 20% interests in the offshore Corrib natural gas field located to the northwest coast of Ireland; and 100% working interest in the Wandoo offshore oil field and related production facilities that covers 59,553 acres located on Western Australia's northwest shelf. Vermilion Energy Inc. was founded in 1994 and is headquartered in Calgary, Canada."}, {"name": "Vista Gold Corp.", "ticker": "VGZ.TO", "sector": "Basic Materials", "description": "Vista Gold Corp., together with its subsidiaries, engages in the evaluation, acquisition, exploration, and advancement of gold exploration and development projects primarily in Australia. The company's flagship asset is the Mt Todd gold project located in Northern Territory. Vista Gold Corp. was founded in 1983 and is headquartered in Littleton, Colorado."}, {"name": "Valeura Energy Inc.", "ticker": "VLE.TO", "sector": "Energy", "description": "Valeura Energy Inc., together with its subsidiaries, engages in the exploration, development, and production of petroleum and natural gas in Turkey. As of December 31, 2021, the company had interests in six production leases and exploration licenses covering approximately 0.23 million gross acres and 0.19 net acres of deep rights in the Thrace Basin of northwest Turkey. Valeura Energy Inc. was incorporated in 2000 and is headquartered in Calgary, Canada."}, {"name": "Valens Company Inc. (The)", "ticker": "VLNS.TO", "sector": "Healthcare", "description": "The Valens Company Inc. develops, manufactures, and sells cannabinoid-based products in Canada and internationally. It produces dried cannabis and hemp biomass products. The company also provides a range of products, including tinctures, two-piece caps, soft gels, oral sprays, and vape pens, as well as beverages, concentrates, topicals, edibles, natural health, and other products. In addition, it offers CO2, ethanol, hydrocarbon, solvent-less and terpene extraction, analytical testing, formulation, product development, and custom manufacturing services. The company was formerly known as Valens Groworks Corp. and changed its name to The Valens Company Inc. in June 2020. The Valens Company Inc. is headquartered in Toronto, Canada."}, {"name": "Viemed Healthcare", "ticker": "VMD.TO", "sector": "Healthcare", "description": "Viemed Healthcare, Inc., through its subsidiaries, provides in-home durable medical equipment (DME) and post-acute respiratory healthcare services to patients in the United States. It provides respiratory disease management solutions, including treatment of chronic obstructive pulmonary disease (COPD), which include non-invasive ventilation, percussion vests, and other therapies; and invasive and non-invasive ventilation and related equipment and supplies to patients suffering from COPD. The company also leases non-invasive and invasive ventilators, positive airway pressure machines (PAP), percussion vests, oxygen concentrator units, and other small respiratory equipment; and sells and rents DME and patient medical services. In addition, it provides neuromuscular care and oxygen therapy services; and sleep apnea management related solutions and/or equipment, such as PAP, automatic continuous positive airway pressure, and bi-level positive airway pressure machines. Further, the company offers in home sleep apnea testing services. Viemed Healthcare, Inc. was founded in 2006 and is headquartered in Lafayette, Louisiana."}, {"name": "VIQ Solutions Inc.", "ticker": "VQS.TO", "sector": "Technology", "description": "VIQ Solutions Inc. operates as a technology and service platform provider for digital evidence capture, retrieval, and content management in Australia, the United States, the United Kingdom, Canada, and internationally. It operates through two segments, Technology and Related Revenue, and Technology Services. The Technology segment develops, distributes, and licenses computer-based digital solutions based on its technology. The Technology Services segment provides recording and transcription services. The company offers CapturePro that securely speeds the capture, creation, and management of large volumes of information, as well as preserves and secures the spoken word and video image, and delivers data; MobileMic Pro for capturing and managing incident reports, recorded statements, case notes, and other vital information; NetScribe, a speech-to-text engine to consolidate, accelerate, and optimize transcription workflows; aiAssist, a multi-tenant workflow and analysis platform to manage, convert, and analyze large volumes of audio and visual content; and FirstDraft that converts audio files to text to provide access to interviews, testimonies, recorded calls, and dictations. It also provides legal, criminal justice, insurance, government, medical, corporate finance, media, and transcription services. The company was incorporated in 2004 and is based in Mississauga, Canada."}, {"name": "Waste Connections", "ticker": "WCN.TO", "sector": "Industrials", "description": "Waste Connections, Inc. provides non-hazardous waste collection, transfer, disposal, and resource recovery services in the United States and Canada. It offers collection services to residential, commercial, municipal, industrial, and exploration and production (E&P) customers; landfill disposal services; and recycling services for various recyclable materials, including compost, cardboard, mixed paper, plastic containers, glass bottles, and ferrous and aluminum metals. The company also owns and operates transfer stations that receive compact and/or load waste to be transported to landfills or treatment facilities through truck, rail, or barge; and intermodal services for the rail haul movement of cargo and solid waste containers in the Pacific Northwest through a network of intermodal facilities. In addition, it provides E&P waste treatment, recovery, and disposal services for waste resulting from oil and natural gas exploration and production activity, such as drilling fluids, drill cuttings, completion fluids, and flowback water; production wastes and produced water during a well's operating life; contaminated soils that require treatment during site reclamation; and substances, which require clean-up after a spill, reserve pit clean-up, or pipeline rupture. Further, the company offers leasing services to its customers. As of December 31, 2021, it owned 334 solid waste collection operations; 142 transfer stations; 61 municipal solid waste (MSW) landfills; 12 E&P waste landfills; 14 non-MSW landfills; 71 recycling operations; 4 intermodal operations; 23 E&P liquid waste injection wells; and 19 E&P waste treatment and oil recovery facilities. The company also operates an additional 53 transfer stations, 10 MSW landfills, and 2 intermodal operations. Waste Connections, Inc. was founded in 1997 and is based in Woodbridge, Canada."}, {"name": "Canopy Growth Corporation", "ticker": "WEED.TO", "sector": "Healthcare", "description": "Canopy Growth Corporation, together with its subsidiaries, engages in the production, distribution, and sale of cannabis and hemp-based products for recreational and medical purposes primarily in Canada, the United States, and Germany. It operates through two segments, Global Cannabis and Other Consumer Products. The company's products include dried cannabis flowers, oils and concentrates, and softgel capsules. It offers its products under the Tweed, Quatreau, Deep Space, Spectrum Therapeutics, First & Free, TWD, This Works, BioSteel, DNA Genetics CraftGrow, Tokyo Smoke, DOJA, Van der Pop, and Bean & Bud brands. The company also provides growth capital and a strategic support platform that pursues investment opportunities in the global cannabis sector. Canopy Growth Corporation has a clinical research partnership with NEEKA Health Canada and NHL Alumni Association to examine the efficacy of CBD-based therapies as part of the mitigation of persistent post-concussion symptoms. The company was formerly known as Tweed Marijuana Inc. and changed its name to Canopy Growth Corporation in September 2015. Canopy Growth Corporation is headquartered in Smiths Falls, Canada."}, {"name": "West Fraser Timber Co. Ltd.", "ticker": "WFG.TO", "sector": "Basic Materials", "description": "West Fraser Timber Co. Ltd., a diversified wood products company, engages in manufacturing, selling, marketing, and distributing lumber, engineered wood products, pulp, newsprint, wood chips, and other residuals and renewable energy. It offers spruce-pine-fir and southern yellow pine lumber, treated wood products, medium density fiberboard panels and plywood, oriented strand board, and laminated veneer lumber wood products. The company also provides northern bleached softwood Kraft pulp and bleached chemical thermo-mechanical pulp used to produce various paper products, including printing and writing papers, specialty grades, and various tissue products. It sells its products to major retail chains, contractor supply yards, and wholesalers, as well as industrial customers for further processing or as components for other products in Canada, the United States, China, Europe, Asia, and other countries. West Fraser Timber Co. Ltd. was founded in 1955 and is based in Vancouver, Canada."}, {"name": "Wheaton Precious Metals Corp.", "ticker": "WPM.TO", "sector": "Basic Materials", "description": "Wheaton Precious Metals Corp., a streaming company, primarily sells precious metals in Canada and internationally. The company sells gold, silver, palladium, and cobalt deposits. It has a portfolio of interests in the 23 operating mines and 13 development projects. The company was formerly known as Silver Wheaton Corp. and changed its name to Wheaton Precious Metals Corp. in May 2017. Wheaton Precious Metals Corp. was founded in 2004 and is headquartered in Vancouver, Canada."}, {"name": "Westport Fuel Systems Inc.", "ticker": "WPRT.TO", "sector": "Consumer Cyclical", "description": "Westport Fuel Systems Inc. engages in the engineering, manufacturing, and supplying alternative fuel systems and components for use in transportation applications worldwide. The company operates through Original Equipment Manufacturer and Independent Aftermarket segments. It offers alternative fuel systems and components, which include a range of alternative fuels, such as liquefied petroleum gas, compressed natural gas, liquefied natural gas, renewable natural gas, and hydrogen; and independent aftermarket, light and heavy-duty original equipment manufacturers (OEMs) and delayed OEMs, electronics, hydrogen, and fuel storage activities. The company also provides Westport High Pressure Direct Injection 2.0, a fully integrated fuel systems that enables diesel engines using primarily natural gas fuel to match the power, torque, and fuel economy benefits found in traditional compression ignition diesel engines, which reduces greenhouse gas emissions. Its products and services are used for passenger cars; light-, medium-, and heavy-duty trucks; and cryogenics and hydrogen applications under the Cummins Westport, BRC Gas Equipment, Westport, OMVL, Prins, GFi Control systems, Emer, Zavoli, TA Gas Technology, Valtek, and AFS brands. The company was formerly known as Westport Innovations Inc. and changed its name to Westport Fuel Systems Inc. in June 2016. Westport Fuel Systems Inc. was incorporated in 1995 and is headquartered in Vancouver, Canada."}, {"name": "Western Copper and Gold Corporation", "ticker": "WRN.TO", "sector": "Basic Materials", "description": "Western Copper and Gold Corporation, an exploration stage company, engages in the exploration and development of mineral properties in Canada. The company explores for gold, copper, silver, and molybdenum deposits. Its principal property is the Casino mineral property that comprise 1,136 full and partial quartz claims, and 55 placer claims located in Yukon, Canada. The company was formerly known as Western Copper Corporation and changed its name to Western Copper and Gold Corporation in October 2011. Western Copper and Gold Corporation was incorporated in 2006 and is headquartered in Vancouver, Canada."}, {"name": "Xanadu Mines Ltd.", "ticker": "XAM.TO", "sector": "Basic Materials", "description": "Xanadu Mines Limited engages in the exploration and development of various mineral projects in Mongolia. The company primarily explores for copper and gold deposits. Its flagship project is the Kharmagtai copper-gold project located in Omnogovi province to the southeast of Ulaanbaatar. The company also holds interest in the Red Mountain copper-gold project located in the Dornogovi Province of southern Mongolia. Xanadu Mines Limited has a strategic partnership with Zijin Mining Group Co., Ltd to progress the Kharmagtai copper-gold project through its next phase of project evaluation and decision on future development. The company was incorporated in 2005 and is headquartered in Sydney, Australia."}, {"name": "Yamana Gold Inc.", "ticker": "YRI.TO", "sector": "Basic Materials", "description": "Yamana Gold Inc., together with its subsidiaries, operates as a precious metal producer. It has gold and silver production, development-stage properties, exploration properties, and land positions throughout the Americas, including Canada, Brazil, Chile, and Argentina. The company was formerly known as Yamana Resources Inc. and changed its name to Yamana Gold Inc. in August 2003. Yamana Gold Inc. was founded in 2003 and is headquartered in Toronto, Canada."}]